{
  "model": "c22a5bd", 
  "scored_article_sentences": [
    {
      "index": 21, 
      "score": 0.29852467775344849, 
      "sent": "Koeslag's job was to bring to life this chimera of Swiss engineering and Silicon Valley wizardry."
    }, 
    {
      "index": 6, 
      "score": 0.28212961554527283, 
      "sent": "The watch's mechanisms -- including its \"balance wheel,\" whose oscillation is visible through an opening in the watch face -- are so precise that the device loses or gains only two seconds a day."
    }, 
    {
      "index": 13, 
      "score": 0.28107902407646179, 
      "sent": "This is the tradition that Koeslag is selling to his customers: the patient Swiss art of manufacturing complex, handmade mechanisms."
    }, 
    {
      "index": 7, 
      "score": 0.2771211564540863, 
      "sent": "The Grand Tourbillon Minute Repeater sells for just over $200,000, and Koeslag has made just eight of them."
    }, 
    {
      "index": 55, 
      "score": 0.27705591917037964, 
      "sent": "The industry got its start in the 16th century after John Calvin persuaded the City Council in Geneva to impose sumptuary laws banning jewelry, and the city's skilled jewelers joined forces with the makers of pocket watches instead."
    }, 
    {
      "index": 5, 
      "score": 0.26653146743774414, 
      "sent": "One of them is a circular metal gong, struck by small hammers that mark the time with two-tone melodies."
    }, 
    {
      "index": 15, 
      "score": 0.2614627480506897, 
      "sent": "In response to Apple's plans to introduce a high-tech watch this year, the chief executive of Frederique Constant, Peter Stas, decided the company would produce its own."
    }, 
    {
      "index": 18, 
      "score": 0.26014912128448486, 
      "sent": "A Silicon Valley company would produce the tiny sensors that count steps and measure sleep cycles, and this information would be transmitted to a phone through a Bluetooth connection."
    }, 
    {
      "index": 70, 
      "score": 0.25885406136512756, 
      "sent": "The \"quartz crisis\" killed off so many Swiss watchmakers that by the end of the 1970s, the number of workers in the industry had shrunk to 30,000 from 90,000."
    }, 
    {
      "index": 4, 
      "score": 0.25881174206733704, 
      "sent": "The watch, a gorgeous chunk of white gold, includes more than 400 painstakingly machined, polished and hand-assembled parts."
    }, 
    {
      "index": 51, 
      "score": 0.25388166308403015, 
      "sent": "For example, to achieve the satiny finish on the bodies of the Apple Watch Sport, the company uses robotized nozzles to blast the aluminum surface with microscopic beads of zirconia."
    }, 
    {
      "index": 2, 
      "score": 0.25280889868736267, 
      "sent": "When I visited his bright, sunlit factory in Geneva in May, he opened a refrigerator-size safe to show me one of them."
    }, 
    {
      "index": 19, 
      "score": 0.25073584914207458, 
      "sent": "The phone would also control the watch -- resetting its hands in different time zones, for example."
    }, 
    {
      "index": 127, 
      "score": 0.25000137090682983, 
      "sent": "A watch hand is \"glanceable,\" as he puts it, because it's only semi-accurate; we peek at an analog wall clock to get a general sense of the time of day, not a precise one."
    }, 
    {
      "index": 58, 
      "score": 0.24658741056919098, 
      "sent": "The emigres hired them to spend their winters hand-polishing tiny metal components for the \"movements,\" the watch's spring-driven inner workings."
    }, 
    {
      "index": 60, 
      "score": 0.24528521299362183, 
      "sent": "Jonathan De Villiers for The New York Times                           By the 20th century, Swiss watches had become famous for their reliability and complexity."
    }, 
    {
      "index": 0, 
      "score": 0.24458111822605133, 
      "sent": "Pim Koeslag designs and fabricates some of the world's most complicated mechanical timepieces."
    }, 
    {
      "index": 34, 
      "score": 0.24123607575893402, 
      "sent": "By January, he finally had a prototype working well, just in time to show it off at Baselworld, the annual Swiss jewelers' and watchmakers' fair."
    }, 
    {
      "index": 62, 
      "score": 0.23930776119232178, 
      "sent": "Each new \"complication\" -- say, a calendar that advances the date with a satisfying snap at midnight -- demanded a new set of gears and more energy, thus requiring ever more clever compensations."
    }, 
    {
      "index": 74, 
      "score": 0.23929274082183838, 
      "sent": "In the 1990s, as Ryan Raffaelli, a Harvard business professor who has studied the Swiss industry, has written, Swiss watchmakers hit on an even more profitable strategy: marketing their expensive mechanical watches as luxury items steeped in history."
    }, 
    {
      "index": 1, 
      "score": 0.23824818432331085, 
      "sent": "Especially ambitious is his Grand Tourbillon Minute Repeater, created for Ateliers deMonaco, a watch company he helped start."
    }, 
    {
      "index": 57, 
      "score": 0.23746514320373535, 
      "sent": "In the mountains of the Jura region, they encountered local farmers who spent half the year indoors and idle and who turned out to be extremely patient and detail-oriented."
    }, 
    {
      "index": 126, 
      "score": 0.23658648133277893, 
      "sent": "To Ronnie Bernheim, co-owner (with his brother Andre) of the watchmaker Mondaine, which is licensing some of Stas's and Koeslag's technology, this approach is superior to the blunt accuracy of a screen."
    }, 
    {
      "index": 56, 
      "score": 0.23533540964126587, 
      "sent": "Later, French Catholics chased Protestant Huguenots out of their country; many of these French exiles happened to be watchmakers, and they settled in Switzerland."
    }, 
    {
      "index": 29, 
      "score": 0.23437385261058807, 
      "sent": "To install it properly, he sought advice from an associate at a technology company."
    }, 
    {
      "index": 37, 
      "score": 0.23178876936435699, 
      "sent": "Frederique Constant was producing its enhanced watch, and a few Swiss companies were announcing similar plans."
    }, 
    {
      "index": 35, 
      "score": 0.23138689994812012, 
      "sent": "Watch designers typically boast about their latest \"complications,\" clever ways of creating gear work to power new features, like calendars or extra dials."
    }, 
    {
      "index": 22, 
      "score": 0.22916232049465179, 
      "sent": "Koeslag faced a significant problem, though: He had never worked with chips and sensors before."
    }, 
    {
      "index": 14, 
      "score": 0.22903625667095184, 
      "sent": "Last fall, however, Koeslag set off on a very different, decidedly 21st-century project: a smartwatch."
    }, 
    {
      "index": 59, 
      "score": 0.22698488831520081, 
      "sent": "A technician inspects the movement of a watch at the Frederique Constant factory."
    }, 
    {
      "index": 20, 
      "score": 0.22690355777740479, 
      "sent": "From the outside, the watch wouldn't look \"smart\" at all, but it would be packed with electronics."
    }, 
    {
      "index": 17, 
      "score": 0.22637446224689484, 
      "sent": "Instead, it would combine the functions of a Fitbit, a device that tracks physical activity, with a traditional Swiss timepiece, a $1,200 entry-level Frederique Constant watch."
    }, 
    {
      "index": 16, 
      "score": 0.22562126815319061, 
      "sent": "It would not be a minicomputer with a screen, like Apple's."
    }, 
    {
      "index": 53, 
      "score": 0.22523526847362518, 
      "sent": "The company's design prowess rests in part on its mastery of high-volume operations like this."
    }, 
    {
      "index": 75, 
      "score": 0.22495520114898682, 
      "sent": "If you wanted to hand something down to your children, the sales pitch went, spend thousands of dollars on a Rolex or, at the very least, several hundred on a quartz watch with elegant Swiss design."
    }, 
    {
      "index": 46, 
      "score": 0.22385814785957336, 
      "sent": "Many observers had predicted that Apple would spell trouble for Swiss watchmakers, and now Koeslag had some personal data to prove it."
    }, 
    {
      "index": 82, 
      "score": 0.22358278930187225, 
      "sent": "Wearing a mechanical watch today makes an explicitly antidigital statement, embracing the long pedigree of a device that predates not only computers but electricity itself."
    }, 
    {
      "index": 61, 
      "score": 0.22349101305007935, 
      "sent": "They are also marvels of energy efficiency, because dozens or even hundreds of components depend on tiny wound springs for power."
    }, 
    {
      "index": 64, 
      "score": 0.22244483232498169, 
      "sent": "In the early 1970s, centuries of tradition were overturned by an upstart technology: quartz watches."
    }, 
    {
      "index": 136, 
      "score": 0.2223074734210968, 
      "sent": "But Koeslag's stylish analog design felt like a steampunk midpoint, the best of both domains: a device that delivered modern types of information, with the romance of old-fashioned dials."
    }, 
    {
      "index": 212, 
      "score": 0.22225622832775116, 
      "sent": "The goal is to release something by the end of this year that can compete with Apple on the apps front while also being unmistakably Swiss."
    }, 
    {
      "index": 216, 
      "score": 0.2204865962266922, 
      "sent": "Biver is a famously voluble, opinionated figure, prone to grand statements and poetic riffs on the beauty of timepieces."
    }, 
    {
      "index": 50, 
      "score": 0.21936751902103424, 
      "sent": "Very few companies can turn out such consistently glossy electronics, because few sell enough of their devices to justify the automated processes that keep quality high and prices relatively affordable."
    }, 
    {
      "index": 48, 
      "score": 0.21833181381225586, 
      "sent": "Much of the allure, of course, was Apple's famously elegant design."
    }, 
    {
      "index": 52, 
      "score": 0.21766412258148193, 
      "sent": "\"No company in the world is finishing and anodizing to Apple's level,\" the product designer Greg Koenig has written."
    }, 
    {
      "index": 189, 
      "score": 0.21696145832538605, 
      "sent": "But at the Basel fair, he displayed a traditional mechanical timepiece -- a \"perpetual calendar\" with bold dials and a meter showing how much energy the spring has left in it."
    }, 
    {
      "index": 10, 
      "score": 0.21608415246009827, 
      "sent": "On the factory floor behind us, a dozen white-coated women were piecing together other watches that Koeslag has designed for Frederique Constant, a midrange watch brand."
    }, 
    {
      "index": 36, 
      "score": 0.21601422131061554, 
      "sent": "This year, though, the chatter at Basel kept coming nervously back to the Apple smartwatch."
    }, 
    {
      "index": 65, 
      "score": 0.21458837389945984, 
      "sent": "In these, a battery's electricity causes a quartz crystal to vibrate at an extremely regular frequency, running a motor that turns the watch hands."
    }, 
    {
      "index": 8, 
      "score": 0.21458721160888672, 
      "sent": "\"A Prince of Qatar has bought three already,\" said Koeslag, a mannerly blond man who wore a trim pinstriped suit."
    }, 
    {
      "index": 111, 
      "score": 0.21441391110420227, 
      "sent": "After hunting online for suitable electronics to work with, Stas found Fullpower Technologies, a company in Santa Cruz, Calif., that makes the sensors and firmware in activity-trackers built by companies like Nike."
    }, 
    {
      "index": 63, 
      "score": 0.21433471143245697, 
      "sent": "A mechanical watch is both a dance with and a fight against physics."
    }, 
    {
      "index": 49, 
      "score": 0.21402379870414734, 
      "sent": "It was recognizably a watch, complete with a crown that controlled on-screen apps, but it had Apple's distinctive aesthetic, with its minimal lines and sleek curves; the watch is a smaller version of an iPhone, essentially."
    }, 
    {
      "index": 177, 
      "score": 0.21383535861968994, 
      "sent": "Montblanc, however, is trying to safeguard a much older brand name: In 2007, it bought Minerva, a storied Swiss watchmaker founded in 1858."
    }, 
    {
      "index": 233, 
      "score": 0.21267892420291901, 
      "sent": "Even if the Swiss smartwatch never takes off, many of the watch executives I spoke with said that the Apple Watch might be good for sales of high-end mechanical watches."
    }, 
    {
      "index": 232, 
      "score": 0.2119859904050827, 
      "sent": "The clock itself was a first step toward the \"quantified self,\" making visible information that was previously hidden, your precise progress through the day."
    }, 
    {
      "index": 47, 
      "score": 0.21149054169654846, 
      "sent": "Smartwatches have been around for years, but none have received as much attention as the Apple Watch."
    }, 
    {
      "index": 66, 
      "score": 0.21086262166500092, 
      "sent": "The resulting timepiece is far more accurate and much cheaper than most mechanical watches."
    }, 
    {
      "index": 165, 
      "score": 0.20997290313243866, 
      "sent": "But the Montblanc pen is as good as ever; indeed, the years have imparted character."
    }, 
    {
      "index": 210, 
      "score": 0.20857131481170654, 
      "sent": "TAG Heuer's engineers will design the physical case, but everything else will come from technology partners."
    }, 
    {
      "index": 88, 
      "score": 0.20752741396427155, 
      "sent": "But luxury brands also sell a great many less-expensive quartz watches, and this is where the Apple Watch poses a threat."
    }, 
    {
      "index": 118, 
      "score": 0.20690725743770599, 
      "sent": "When Fullpower develops new sensors a few years from now, owners can have their Frederique Constant watches upgraded with better electronics."
    }, 
    {
      "index": 3, 
      "score": 0.20670270919799805, 
      "sent": "\"If you want to go for the real complex stuff,\" he said, \"here it is.\""
    }, 
    {
      "index": 175, 
      "score": 0.20647473633289337, 
      "sent": "But looking at this Janus device -- analog and digital faces on opposing sides -- I couldn't help thinking that it would be harder for Montblanc to strike a balance between smartwatch and mechanical device than for Frederique Constant or Mondaine."
    }, 
    {
      "index": 69, 
      "score": 0.20599037408828735, 
      "sent": "Where was the challenge?When Swiss companies declined to make quartz devices, inexpensive Japanese watches from companies like Seiko became popular around the world."
    }, 
    {
      "index": 230, 
      "score": 0.20276685059070587, 
      "sent": "He says that the Swiss watchmakers may promote their preindustrial history, but they've long been experts at innovating."
    }, 
    {
      "index": 196, 
      "score": 0.20191019773483276, 
      "sent": "But he considers putting smartwatch technology inside a mechanical Swiss timepiece to be brand suicide."
    }, 
    {
      "index": 112, 
      "score": 0.20162633061408997, 
      "sent": "He contacted Philippe Kahn, the chief executive, who told Stas that Fullpower's technology could run for two years on one watch battery."
    }, 
    {
      "index": 25, 
      "score": 0.20095139741897583, 
      "sent": "He led me to a large microscope and placed one of the chip sets under it."
    }, 
    {
      "index": 176, 
      "score": 0.19842439889907837, 
      "sent": "The latter are younger companies, and Mondaine primarily sells affordable quartz watches."
    }, 
    {
      "index": 97, 
      "score": 0.19771893322467804, 
      "sent": "At first, Stas considered making a smartwatch through and through -- LCD screen, apps, Google's free operating system for wearable devices."
    }, 
    {
      "index": 67, 
      "score": 0.19717338681221008, 
      "sent": "Swiss inventors actually helped pioneer this technology, but watchmakers regarded it as beneath them."
    }, 
    {
      "index": 31, 
      "score": 0.19677442312240601, 
      "sent": "\" The technician told him it couldn't be done manually; technology companies use robots to fix in place components that require that kind of precision."
    }, 
    {
      "index": 169, 
      "score": 0.19598795473575592, 
      "sent": "Dividing the Montblanc smartwatch into two components may make it less intrusive, Schmiedt believes, because the e-Strap's screen usually faces away from the wearer."
    }, 
    {
      "index": 174, 
      "score": 0.19597317278385162, 
      "sent": "Schmiedt is enthusiastic about the e-Strap, of course."
    }, 
    {
      "index": 92, 
      "score": 0.19592249393463135, 
      "sent": "\"For Switzerland to compete with Silicon Valley, it needed to answer a question that was no longer just stylistic or technical but existential."
    }, 
    {
      "index": 209, 
      "score": 0.19449515640735626, 
      "sent": "\"TAG Heuer is one high-end brand that plans to produce what Silicon Valley might recognize as a smartwatch: a digital version of the TAG Heuer Carrera."
    }, 
    {
      "index": 76, 
      "score": 0.19435422122478485, 
      "sent": "Sales of Swiss watches rebounded; exports have more than doubled since 2000, rising even in the years after the economic meltdown."
    }, 
    {
      "index": 68, 
      "score": 0.19413849711418152, 
      "sent": "A quartz watch might have only a few dozen parts, compared with hundreds in a mechanical one."
    }, 
    {
      "index": 81, 
      "score": 0.19381961226463318, 
      "sent": "For those willing to spend $30,000, a traditional Swiss watch marks its owner as a man or woman who appreciates quality, artistry and ingenuity (and, of course, as a wealthy and conspicuous consumer)."
    }, 
    {
      "index": 186, 
      "score": 0.19194108247756958, 
      "sent": "On the wall was pinned one of the oldest types of technology in the building: the dried stalk of a local flower."
    }, 
    {
      "index": 38, 
      "score": 0.19180144369602203, 
      "sent": "But what did this trend mean for the industry?"
    }, 
    {
      "index": 185, 
      "score": 0.19169852137565613, 
      "sent": "His job was to assemble the watch and ensure it worked, then to disassemble it, recleaning and reoiling the parts before putting it back together one final time."
    }, 
    {
      "index": 84, 
      "score": 0.19072996079921722, 
      "sent": "\"A mechanical watch,\" Jean-Claude Biver, the chief executive of TAG Heuer, said, \"is a piece of eternity in a box."
    }, 
    {
      "index": 178, 
      "score": 0.19064553081989288, 
      "sent": "Famous for producing deeply complex movements beloved by collectors, Minerva foundered during the quartz crisis."
    }, 
    {
      "index": 122, 
      "score": 0.1904863566160202, 
      "sent": "Using the phone app, the owner can set an activity goal, like 8,000 steps for a day."
    }, 
    {
      "index": 26, 
      "score": 0.1903330385684967, 
      "sent": "When the image appeared on a large computer screen, he zoomed in on the Bluetooth antenna, which looked like a dark, square block."
    }, 
    {
      "index": 107, 
      "score": 0.19026705622673035, 
      "sent": "\"And in the watch industry,\" Stas told me, \"we know actually that square screens don't sell to men."
    }, 
    {
      "index": 116, 
      "score": 0.19022160768508911, 
      "sent": "Kahn too: He detested the environmental waste of many disposable electronics and loved the idea of building sensors into a watch sufficiently expensive that it would be regarded as an heirloom."
    }, 
    {
      "index": 102, 
      "score": 0.18994222581386566, 
      "sent": "The energy-hungry display would be turned off most of the time and activated with a flick of the wrist, but the gesture isn't always successful."
    }, 
    {
      "index": 96, 
      "score": 0.18833675980567932, 
      "sent": "Their watches retail for $1,000 and more: \"Classical, accessible luxury,\" he called them as he sat in his office, surrounded by models of his mahogany motorboat."
    }, 
    {
      "index": 239, 
      "score": 0.18832302093505859, 
      "sent": "Having acquired the habit of glancing down, maybe they'll eventually decide they want to look at an older sort of device instead -- a machine that, in a sense, is outside time."
    }, 
    {
      "index": 117, 
      "score": 0.18824879825115204, 
      "sent": "Watches are easy to open and repair, unlike many of today's electronics."
    }, 
    {
      "index": 142, 
      "score": 0.18784382939338684, 
      "sent": "\"He is even more dubious that any Silicon Valley company could create something with aesthetics lovely enough to penetrate the European luxury market."
    }, 
    {
      "index": 104, 
      "score": 0.18784072995185852, 
      "sent": "Like most watchmakers, Stas wanted his quartz watches to run for two years on a single battery."
    }, 
    {
      "index": 179, 
      "score": 0.1874290406703949, 
      "sent": "When Schmiedt walked into the Minerva factory for the first time, it had a mere 20 workers, fashioning watches using century-old tools."
    }, 
    {
      "index": 110, 
      "score": 0.18734507262706757, 
      "sent": "A watch is inherently a wristband, albeit a prettier one."
    }, 
    {
      "index": 95, 
      "score": 0.18640285730361938, 
      "sent": "A Dutch emigre in Switzerland, Stas and his wife, Aletta, founded Frederique Constant in 1988 to make the sort of midlevel quartz timepieces now threatened by Apple."
    }, 
    {
      "index": 188, 
      "score": 0.18599647283554077, 
      "sent": "At Basel this year, Edouard Meylan, chief executive of the high-end watchmaker H. Moser, issued a news release claiming that he, too, would be introducing a smartwatch."
    }, 
    {
      "index": 152, 
      "score": 0.18587402999401093, 
      "sent": "The actual timepiece is entirely mechanical, from Montblanc's \"TimeWalker\" line of watches."
    }, 
    {
      "index": 149, 
      "score": 0.18418458104133606, 
      "sent": "\"A traditional watch with hidden electronics is one solution to the smartwatch challenge."
    }, 
    {
      "index": 28, 
      "score": 0.18376526236534119, 
      "sent": "\"Under the microscope, we actually welded it on, by hand,\" he said."
    }, 
    {
      "index": 83, 
      "score": 0.18373417854309082, 
      "sent": "It tells the time but is timeless."
    }, 
    {
      "index": 40, 
      "score": 0.18212233483791351, 
      "sent": "Adding chips might help these watchmakers ride the high-tech wave, but it also risked eroding what made them special."
    }, 
    {
      "index": 187, 
      "score": 0.181499183177948, 
      "sent": "It's used, I was told, to polish brass parts to a luminous glow."
    }, 
    {
      "index": 204, 
      "score": 0.18094190955162048, 
      "sent": "\"That's a little bit the scary thing,\" says Pim Koeslag of his work at Frederique Constant."
    }, 
    {
      "index": 89, 
      "score": 0.18082945048809052, 
      "sent": "\"If a young man, young woman, is 25 years old, would they rather put 1,200 Swiss francs\" -- about $1,300 -- \"for a watch that tells you what time it is and the date, or will they buy, for only $800, a watch that tells you everything?\""
    }, 
    {
      "index": 54, 
      "score": 0.18079489469528198, 
      "sent": "Swiss watchmaking emerged from a radically different background, one rooted in meticulous manual labor."
    }, 
    {
      "index": 150, 
      "score": 0.18074388802051544, 
      "sent": "Montblanc, the European luxury-goods brand, has another, more unusual idea."
    }, 
    {
      "index": 231, 
      "score": 0.18059989809989929, 
      "sent": "All those mechanical features -- perpetual calendars, self-winding mechanisms -- were the transformative high tech of their day."
    }, 
    {
      "index": 33, 
      "score": 0.17980380356311798, 
      "sent": "\" He had to shave the tip of his soldering iron down to a fine point to use it successfully."
    }, 
    {
      "index": 93, 
      "score": 0.17977882921695709, 
      "sent": "Raffaelli said, \"What does it mean to be a watchmaker in a digital world?"
    }, 
    {
      "index": 12, 
      "score": 0.17934586107730865, 
      "sent": "One woman peered into a microscope as she carefully wielded a long, thin needle to apply a drop of pink oil, before setting a tiny pin in place."
    }, 
    {
      "index": 157, 
      "score": 0.17892412841320038, 
      "sent": "The screen can only display 16 characters at a time, so reading a message means swiping back and forth across it."
    }, 
    {
      "index": 164, 
      "score": 0.17871503531932831, 
      "sent": "Decades later, a phone from the '90s is a useless relic."
    }, 
    {
      "index": 137, 
      "score": 0.17830978333950043, 
      "sent": "Bernheim and Stas are diplomatic about the Apple Watch."
    }, 
    {
      "index": 194, 
      "score": 0.17827625572681427, 
      "sent": "To be sure, he said -- as many of his peers did -- the Apple Watch will probably be successful."
    }, 
    {
      "index": 217, 
      "score": 0.17795328795909882, 
      "sent": "He wears, and occasionally caresses, a chunky watch from Hublot (another luxury brand that he oversees)."
    }, 
    {
      "index": 206, 
      "score": 0.17769385874271393, 
      "sent": "There's no GPS in his smartwatch now, but he could imagine putting it in."
    }, 
    {
      "index": 114, 
      "score": 0.17769365012645721, 
      "sent": "It would analyze activity and deep-sleep patterns, so the watch's alarm could go off at precisely the least disruptive time to wake its wearer."
    }, 
    {
      "index": 240, 
      "score": 0.17692488431930542, 
      "sent": "Clive Thompson is a contributing writer for the magazine and the author of \"Smarter Than You Think.\""
    }, 
    {
      "index": 106, 
      "score": 0.1769087016582489, 
      "sent": "In 2013, the only LCDs available to him were rectangular."
    }, 
    {
      "index": 115, 
      "score": 0.17664441466331482, 
      "sent": "The prospect of a partnership excited Stas."
    }, 
    {
      "index": 205, 
      "score": 0.17589142918586731, 
      "sent": "\"Once you get into it, you see that this is only the beginning of the beginning.\""
    }, 
    {
      "index": 241, 
      "score": 0.17550472915172577, 
      "sent": "He last wrote for the magazine about how video games could help the aging mind."
    }, 
    {
      "index": 151, 
      "score": 0.17541787028312683, 
      "sent": "When I visited Alexander Schmiedt, who runs the company's watch business, in the village of Villeret, he handed me a smartwatch prototype."
    }, 
    {
      "index": 42, 
      "score": 0.1751057505607605, 
      "sent": "The night before the show, he wore his smartwatch to bed."
    }, 
    {
      "index": 199, 
      "score": 0.17482607066631317, 
      "sent": "His company, like Montblanc and Ateliers deMonaco, sells watches that cost tens of thousands of dollars."
    }, 
    {
      "index": 24, 
      "score": 0.1742333322763443, 
      "sent": "Swiss watchmakers don't need them; their devices are put together with screws and screwdrivers."
    }, 
    {
      "index": 27, 
      "score": 0.17335167527198792, 
      "sent": "Getting that into the right spot caused him a great deal of trouble, he said."
    }, 
    {
      "index": 222, 
      "score": 0.17311955988407135, 
      "sent": "As several observers told me, it's just as much an Intel-and-Google watch."
    }, 
    {
      "index": 123, 
      "score": 0.17273645102977753, 
      "sent": "Then the watch displays how close you are to meeting it, using the hand on a small, secondary dial: At 2,000 steps, for example, the hand would point to 3 o'clock, signifying 25 percent."
    }, 
    {
      "index": 9, 
      "score": 0.17265228927135468, 
      "sent": "\"Very special watches, for very special people.\""
    }, 
    {
      "index": 80, 
      "score": 0.17211487889289856, 
      "sent": "They market their mechanical watches as not only accurate but also deeply symbolic."
    }, 
    {
      "index": 73, 
      "score": 0.17150743305683136, 
      "sent": "Swatch introduced a line of inexpensive quartz watches, and other Swiss companies followed its lead."
    }, 
    {
      "index": 139, 
      "score": 0.17142529785633087, 
      "sent": "But he thinks its limitations -- especially the hassle of charging it every night -- will deter some would-be owners."
    }, 
    {
      "index": 162, 
      "score": 0.17141065001487732, 
      "sent": "\"It would mean that after a predetermined while, the watch itself would become outdated."
    }, 
    {
      "index": 190, 
      "score": 0.17138269543647766, 
      "sent": "In a promotional video, H. Moser called it \"the original smartwatch,\" joking that even \"our grandmother could use it.\""
    }, 
    {
      "index": 87, 
      "score": 0.17130587995052338, 
      "sent": "Nobody, they argue, who spends $50,000 on a piece of handmade eternity will regard an Apple Watch as a substitute."
    }, 
    {
      "index": 11, 
      "score": 0.17106550931930542, 
      "sent": "These will sell for as much as $30,000."
    }, 
    {
      "index": 135, 
      "score": 0.17034997045993805, 
      "sent": "I'm a fan of gadgets and even wore early, clunky smartwatches with LCD screens able to display texts and tweets."
    }, 
    {
      "index": 203, 
      "score": 0.17019431293010712, 
      "sent": "Does watchness become only a trivial part of a smartwatch's function?"
    }, 
    {
      "index": 77, 
      "score": 0.17015476524829865, 
      "sent": "These days, nobody needs a watch to know the time."
    }, 
    {
      "index": 119, 
      "score": 0.17010372877120972, 
      "sent": "\"The Swiss watch industry sells tens of millions of watches a year, and they are wearable objects that people tend to keep,\" Kahn told me."
    }, 
    {
      "index": 229, 
      "score": 0.16976073384284973, 
      "sent": "Raffaelli, the Harvard professor, is a bit more sanguine."
    }, 
    {
      "index": 124, 
      "score": 0.16959391534328461, 
      "sent": "Eventually, the dial could quantify all sorts of data: How full is your inbox?"
    }, 
    {
      "index": 105, 
      "score": 0.16935394704341888, 
      "sent": "A subtler problem was the screen shape."
    }, 
    {
      "index": 144, 
      "score": 0.16822831332683563, 
      "sent": "\"Luxury business is coming either from Paris, or it's coming from Italy, and watches are coming from Switzerland."
    }, 
    {
      "index": 141, 
      "score": 0.16776478290557861, 
      "sent": "I think the real question will be in three months, five months, if people are still going to wear them."
    }, 
    {
      "index": 98, 
      "score": 0.16665031015872955, 
      "sent": "He consulted a Portuguese design team but couldn't find a concept he liked."
    }, 
    {
      "index": 215, 
      "score": 0.16638925671577454, 
      "sent": "\"That will give us the watchmaking appeal, which the computer guys at Apple, Samsung don't have.\""
    }, 
    {
      "index": 132, 
      "score": 0.166216179728508, 
      "sent": ")When Koeslag handed me a Frederique Constant smartwatch to try on, it had a pleasantly hefty feel."
    }, 
    {
      "index": 211, 
      "score": 0.16612717509269714, 
      "sent": "Intel will make the touch screen and the electronics; Google will provide Android Wear software."
    }, 
    {
      "index": 86, 
      "score": 0.1658892035484314, 
      "sent": "Few Swiss executives think smartwatches will kill off the high-end market."
    }, 
    {
      "index": 163, 
      "score": 0.16570578515529633, 
      "sent": "\"At Montblanc, he said, the engineers tell a story to illustrate the perils of high-tech obsolescence: At graduations in the 1990s, students receive gifts from their parents -- some the latest mobile phone, others a Montblanc fountain pen."
    }, 
    {
      "index": 156, 
      "score": 0.16493074595928192, 
      "sent": "The module has an inch-and-a-half touch-screen, where white text and images alert the wearer to incoming calls, SMS messages, emails and social-media messages."
    }, 
    {
      "index": 161, 
      "score": 0.16281658411026001, 
      "sent": "\"You don't want to put the technology inside the watch,\" Schmiedt said as he strapped on the TimeWalker, a handsome brushed-stainless-steel body whose black-and-red face was encircled by a black ceramic ring."
    }, 
    {
      "index": 23, 
      "score": 0.16236214339733124, 
      "sent": "He didn't even own a soldering iron."
    }, 
    {
      "index": 121, 
      "score": 0.16217496991157532, 
      "sent": "\"In pursuing an analog design, they hit upon an intriguing concept."
    }, 
    {
      "index": 155, 
      "score": 0.1620943695306778, 
      "sent": "This \"e-Strap\" features a small rubber module that sits on the wrist's underside."
    }, 
    {
      "index": 30, 
      "score": 0.16178230941295624, 
      "sent": "\"I said, 'I have to place this big antenna, which way do I put it?'"
    }, 
    {
      "index": 71, 
      "score": 0.16063991189002991, 
      "sent": "Brands in existence for centuries vanished in a puff of disruption."
    }, 
    {
      "index": 167, 
      "score": 0.16005857288837433, 
      "sent": "\"If I ever scratch up a watch, or -- I don't know, my child maybe dropped it -- it's a mark of life.\""
    }, 
    {
      "index": 236, 
      "score": 0.16001951694488525, 
      "sent": "Apple is now spending millions to convince younger consumers -- those who coordinate their lives not by looking at a wristwatch, but with \"I'm on my way!\""
    }, 
    {
      "index": 228, 
      "score": 0.159626305103302, 
      "sent": "It's not the use of their human capital.\""
    }, 
    {
      "index": 200, 
      "score": 0.15860973298549652, 
      "sent": "They shouldn't be creating \"some kind of monsters that are a merger of a mobile phone and an actually beautiful mechanical watch."
    }, 
    {
      "index": 91, 
      "score": 0.15770873427391052, 
      "sent": "\"For me there is no doubt we will have a very tough competition in the $1,200 price segment."
    }, 
    {
      "index": 128, 
      "score": 0.15756738185882568, 
      "sent": "\"You're not interested if it's 23 percent or 27 percent.\""
    }, 
    {
      "index": 154, 
      "score": 0.15684948861598969, 
      "sent": "Instead, the computerized parts are in the wristband."
    }, 
    {
      "index": 85, 
      "score": 0.15620386600494385, 
      "sent": "\"Is the smartwatch the next \"quartz crisis\"?"
    }, 
    {
      "index": 168, 
      "score": 0.15609720349311829, 
      "sent": "Our electronics are much less tolerant of faults, he noted, grinning as he held up his own iPhone, whose screen was spider-webbed with cracks."
    }, 
    {
      "index": 243, 
      "score": 0.1560274213552475, 
      "sent": "A version of this article appears in print on June 7, 2015, on page MM28 of the Sunday Magazine with the headline: Face-Off."
    }, 
    {
      "index": 100, 
      "score": 0.15514907240867615, 
      "sent": "Watches can accommodate only very small batteries, so users would have to charge their watches every night."
    }, 
    {
      "index": 131, 
      "score": 0.15463936328887939, 
      "sent": "\" (The French watchmaker Withings began selling a cheaper watch with similar capabilities this spring."
    }, 
    {
      "index": 221, 
      "score": 0.15434421598911285, 
      "sent": "\"Yet it's fair to ask how \"Swiss\" his prospective watch will really be."
    }, 
    {
      "index": 78, 
      "score": 0.1538742333650589, 
      "sent": "Time is all around us, displayed on every computer, phone and microwave oven."
    }, 
    {
      "index": 195, 
      "score": 0.15384942293167114, 
      "sent": "\"With the right battery, eventually it'll become something very useful that I will probably wear myself,\" he said."
    }, 
    {
      "index": 193, 
      "score": 0.15372785925865173, 
      "sent": "Making smartwatches is a mistake, he argued, particularly for elite brands."
    }, 
    {
      "index": 172, 
      "score": 0.15351749956607819, 
      "sent": "The OLED screen preserves battery life, too."
    }, 
    {
      "index": 133, 
      "score": 0.15305924415588379, 
      "sent": "It didn't seem like a smartwatch at all; there was nothing visibly electronic about it."
    }, 
    {
      "index": 166, 
      "score": 0.15305438637733459, 
      "sent": "\"It has a meaning, it has little scratches,\" Schmiedt said."
    }, 
    {
      "index": 238, 
      "score": 0.15284158289432526, 
      "sent": "\"Many young people who would never wear something on their wrist, they will start wearing something on their wrist, which is the connected watch,\" Biver said."
    }, 
    {
      "index": 43, 
      "score": 0.15266391634941101, 
      "sent": "It tracked his sleep patterns."
    }, 
    {
      "index": 226, 
      "score": 0.1525004506111145, 
      "sent": "Swiss watchmakers, she adds, will need to create their own high-tech intellectual property in smartwatches."
    }, 
    {
      "index": 120, 
      "score": 0.15184585750102997, 
      "sent": "\"I'm a dad, and I've got kids, and I don't want to leave a Kleenex world where nothing's worth fixing and everything gets thrown away."
    }, 
    {
      "index": 148, 
      "score": 0.14946165680885315, 
      "sent": "We bring something else to the story."
    }, 
    {
      "index": 235, 
      "score": 0.14907583594322205, 
      "sent": "Because a generation of Americans has grown up without the habit of wearing a watch."
    }, 
    {
      "index": 218, 
      "score": 0.14903037250041962, 
      "sent": "He says the design of the Apple Watch is \"not very sexy."
    }, 
    {
      "index": 173, 
      "score": 0.14810085296630859, 
      "sent": "Montblanc promises five days before the device needs charging."
    }, 
    {
      "index": 72, 
      "score": 0.14791594445705414, 
      "sent": "In the 1980s, Swiss companies came back."
    }, 
    {
      "index": 214, 
      "score": 0.1475677490234375, 
      "sent": "\" said Biver, the chief executive of TAG Heuer, when I visited his office in Nyon."
    }, 
    {
      "index": 44, 
      "score": 0.14707566797733307, 
      "sent": "\"I was so stressed I woke up eight times,\" he said."
    }, 
    {
      "index": 227, 
      "score": 0.14691975712776184, 
      "sent": "\"Otherwise,\" she says, \"what they've got is just the use of their name."
    }, 
    {
      "index": 41, 
      "score": 0.14636117219924927, 
      "sent": "The prospect made Koeslag jittery."
    }, 
    {
      "index": 108, 
      "score": 0.1461770087480545, 
      "sent": "\"So if a screen-based smartwatch wasn't viable, he wondered, was there another alternative?"
    }, 
    {
      "index": 220, 
      "score": 0.1460382342338562, 
      "sent": "\"It's just a reduction of the phone for the wrist."
    }, 
    {
      "index": 180, 
      "score": 0.1451488733291626, 
      "sent": "\"You had really this living heritage, like a sleeping beauty, as if the thing had been stopped in time,\" he told me."
    }, 
    {
      "index": 103, 
      "score": 0.14510525763034821, 
      "sent": "(Another complaint about Apple's watch: You turn your wrist to check the time, and the screen remains dark.)"
    }, 
    {
      "index": 140, 
      "score": 0.14497914910316467, 
      "sent": "\"There will be plenty of people who are going to buy them."
    }, 
    {
      "index": 109, 
      "score": 0.14425110816955566, 
      "sent": "Stas knew that \"activity tracker\" wristbands were popular."
    }, 
    {
      "index": 79, 
      "score": 0.14412596821784973, 
      "sent": "The Swiss watchmakers realize this."
    }, 
    {
      "index": 197, 
      "score": 0.14248079061508179, 
      "sent": "\"It shouldn't be a gimmick,\" he said."
    }, 
    {
      "index": 242, 
      "score": 0.1423979252576828, 
      "sent": "Sign up for our newsletter to get the best of The New York Times Magazine delivered to your inbox every week."
    }, 
    {
      "index": 182, 
      "score": 0.14233106374740601, 
      "sent": "In one room, a line of expert watchmakers polished individual pieces."
    }, 
    {
      "index": 147, 
      "score": 0.14213655889034271, 
      "sent": "They really don't have this culture of refinement."
    }, 
    {
      "index": 32, 
      "score": 0.14178465306758881, 
      "sent": "\"And I said, 'Well, we'll see.'"
    }, 
    {
      "index": 237, 
      "score": 0.14168736338615417, 
      "sent": "text messages and shared Google Calendar events -- that a watch can be useful and fashionable again."
    }, 
    {
      "index": 39, 
      "score": 0.14116469025611877, 
      "sent": "Should they move into smartwatches?"
    }, 
    {
      "index": 201, 
      "score": 0.1410718560218811, 
      "sent": "\"Once a timepiece becomes a computer, what should it not do?"
    }, 
    {
      "index": 192, 
      "score": 0.14092199504375458, 
      "sent": "When I spoke to Meylan, he was even more direct."
    }, 
    {
      "index": 45, 
      "score": 0.1406271755695343, 
      "sent": "His deep sleep totaled just 25 minutes."
    }, 
    {
      "index": 143, 
      "score": 0.14053677022457123, 
      "sent": "\"We have to be very clear here,\" he told me, leaning back on his black chaise longue."
    }, 
    {
      "index": 181, 
      "score": 0.13954368233680725, 
      "sent": "When I visited that factory, it was alive with quiet, careful activity."
    }, 
    {
      "index": 94, 
      "score": 0.13924628496170044, 
      "sent": "\"Peter Stas began pondering that question two years ago."
    }, 
    {
      "index": 213, 
      "score": 0.13856847584247589, 
      "sent": "\"At two meters distance, you will not know, 'Is this guy wearing a TAG Heuer Carrera connected or is this guy wearing a chronograph Carrera normal?'"
    }, 
    {
      "index": 223, 
      "score": 0.13753645122051239, 
      "sent": "\"Where is your value-add?\""
    }, 
    {
      "index": 113, 
      "score": 0.13625724613666534, 
      "sent": "Better yet, Kahn could make the phone software for Stas."
    }, 
    {
      "index": 99, 
      "score": 0.13491822779178619, 
      "sent": "One crucial issue was power."
    }, 
    {
      "index": 138, 
      "score": 0.13484083116054535, 
      "sent": "\"We try to be nice,\" Stas said."
    }, 
    {
      "index": 208, 
      "score": 0.13454711437225342, 
      "sent": "The only limit is imagination."
    }, 
    {
      "index": 160, 
      "score": 0.13435837626457214, 
      "sent": "Watch and e-Strap together will sell for roughly $5,000."
    }, 
    {
      "index": 198, 
      "score": 0.13215577602386475, 
      "sent": "\"Especially in our range.\""
    }, 
    {
      "index": 171, 
      "score": 0.13076144456863403, 
      "sent": "\"You can choose when you want to see it.\""
    }, 
    {
      "index": 170, 
      "score": 0.13075414299964905, 
      "sent": "\"You don't always have it in your sight,\" he said."
    }, 
    {
      "index": 184, 
      "score": 0.13012847304344177, 
      "sent": "Across the room sat a master watchmaker with tattoos down his left arm and on his elbow."
    }, 
    {
      "index": 125, 
      "score": 0.12978112697601318, 
      "sent": "How close is your friend to arriving at the restaurant?"
    }, 
    {
      "index": 153, 
      "score": 0.1291964203119278, 
      "sent": "It contains no circuitry."
    }, 
    {
      "index": 191, 
      "score": 0.12870755791664124, 
      "sent": "The message was clear: Watches are already smart."
    }, 
    {
      "index": 225, 
      "score": 0.12607535719871521, 
      "sent": "professor who has written about the watch industry."
    }, 
    {
      "index": 158, 
      "score": 0.12513454258441925, 
      "sent": "Internal activity sensors track and send data to your phone."
    }, 
    {
      "index": 219, 
      "score": 0.12027081102132797, 
      "sent": "\"\"There is not enough emotion,\" he said."
    }, 
    {
      "index": 145, 
      "score": 0.11561594158411026, 
      "sent": "They're not coming from the U.S.\" He shook his head."
    }, 
    {
      "index": 146, 
      "score": 0.11112594604492188, 
      "sent": "\"Silicon Valley -- my God, what they're wearing and everything!"
    }, 
    {
      "index": 207, 
      "score": 0.10880739241838455, 
      "sent": "\"You could put in cameras or weather stations or whatever."
    }, 
    {
      "index": 183, 
      "score": 0.10776307433843613, 
      "sent": "One man in a white coat was hunched over an elongated figure eight of stainless steel, which he would spend a week shaping; next to him, a woman used a 40x magnification microscope and color-coded emery boards to etch 45-degree beveled edges into a half-inch-long \"bridge.\""
    }, 
    {
      "index": 101, 
      "score": 0.1041618287563324, 
      "sent": "(This has been a complaint leveled against the Apple Watch.)"
    }, 
    {
      "index": 202, 
      "score": 0.10181736946105957, 
      "sent": "Should there be limits?"
    }, 
    {
      "index": 224, 
      "score": 0.09904104471206665, 
      "sent": "asks Amy Glasmeier, an M.I.T."
    }, 
    {
      "index": 159, 
      "score": 0.097022108733654022, 
      "sent": "(The module I saw was a nonworking mock-up.)"
    }, 
    {
      "index": 130, 
      "score": 0.095559351146221161, 
      "sent": "\"You only want to know 'Do I have to move or have I already done pretty good?'"
    }, 
    {
      "index": 90, 
      "score": 0.093812167644500732, 
      "sent": "Biver said."
    }, 
    {
      "index": 129, 
      "score": 0.090425662696361542, 
      "sent": "Bernheim said."
    }, 
    {
      "index": 134, 
      "score": 0.088669881224632263, 
      "sent": "I loved it."
    }, 
    {
      "index": 234, 
      "score": 0.085506871342658997, 
      "sent": "Why?"
    }
  ], 
  "title": null
}