{
  "model": "c22a5bd", 
  "scored_article_sentences": [
    {
      "index": 7, 
      "score": 0.33847469091415405, 
      "sent": "As is the case with many films that flop with the same kind of epic grandeur as the premise of their story, Lynch's Dune was the director's attempt at condensing the story equivalent of the Pacific Ocean into a Solo Cup."
    }, 
    {
      "index": 26, 
      "score": 0.3362477719783783, 
      "sent": "The simple fact is that in its own strange way, a film's inability to capture the enormity and grandeur of a book is less a criticism of the filmmaker and more a testament to the book's incalculable brilliance."
    }, 
    {
      "index": 14, 
      "score": 0.33082142472267151, 
      "sent": "Looking at what the director was in fact able to do with the little he had to work with, the film becomes less a travesty against the sanctity of laser pistol cinema art and more another example in what can go so horribly wrong it's almost right with movie adaptations of books."
    }, 
    {
      "index": 36, 
      "score": 0.32054594159126282, 
      "sent": "What's rarely mentioned--at least without a snort and obscure reference to the Fremen doctrine of not giving a fuck about anything but water--is that Lynch's Dune is a de facto illustration of what can go horribly awry when desperation is the driving point for making a film, even more so when that film is based on one of the most cherished books of the century."
    }, 
    {
      "index": 21, 
      "score": 0.3197072446346283, 
      "sent": "Arriving in the middle of what was arguably the most politically and socially divisive time in American history, Dune could have very easily been Herbert's attempt to capitalize on that civil unrest with a ham-fisted allegory of the haves versus the have-nots or the always reliable overstated literary exercise in self-righteous grandstanding."
    }, 
    {
      "index": 55, 
      "score": 0.31357204914093018, 
      "sent": "The anti-heroism and self-reliance of the Fremen people is one of Dune's most powerful components because it places less importance on the superstitious reductions of fanaticism and on the logical practicality of autonomy."
    }, 
    {
      "index": 37, 
      "score": 0.31279948353767395, 
      "sent": "It's the primary difference in filmmaking derived from a script built specifically for the screen, and filmmaking that relies on a condensed version of literature."
    }, 
    {
      "index": 54, 
      "score": 0.30378693342208862, 
      "sent": "The primary issue with the film's interpretation of Paul's character is that it overstates the heroism to imply the helplessness of the Fremen, a point fiercely contrasted by how completely self-sufficient and self-sustaining the Arrakeen indigenous culture had been for generations."
    }, 
    {
      "index": 72, 
      "score": 0.29303756356239319, 
      "sent": "One of the most divisive of Lynch's modifications in the film is his treatment of the Weirding Way, a telepathic form of combat developed by the Bene Gesserit school of witchcraft and wizardry."
    }, 
    {
      "index": 8, 
      "score": 0.28966823220252991, 
      "sent": "That said, Lynch's vision for turning one of the greatest and most inherently complex science fiction stories ever written into a film was about as valiant an effort as anyone could've made in the same circumstances."
    }, 
    {
      "index": 23, 
      "score": 0.28715339303016663, 
      "sent": "The problem, as it relates to translating those concepts into a visual experience, is not unlike the same kind of roadblock that filmmakers had for years in attempts to bring those Lord Of The Rings stories to the screen."
    }, 
    {
      "index": 13, 
      "score": 0.28492340445518494, 
      "sent": "That's not to say that Lynch failed at bringing to life Herbert's brilliantly imagined world and its still relevant environmental cautionary tale."
    }, 
    {
      "index": 6, 
      "score": 0.28457874059677124, 
      "sent": "The complete and total failure of Dune as a film has become the stuff of Ishtar-level ridicule, despite (or maybe because of) the fact that both films featuring copious use of sand footage."
    }, 
    {
      "index": 63, 
      "score": 0.28127160668373108, 
      "sent": "Kyle MacLachlan plays the part incredibly well, despite being much older than the character, but the safety of keeping him close to an already well-established character for moviegoers ended up being a large part of the film's undoing."
    }, 
    {
      "index": 22, 
      "score": 0.27948516607284546, 
      "sent": "Instead, Herbert's novel manages to touch on those issues with a subtlety and depth that still reads as a relevant cautionary tale for today's socio-cultural, political, and environmental issues."
    }, 
    {
      "index": 24, 
      "score": 0.27918902039527893, 
      "sent": "For all that the book is in terms of its influence and acclaim, Dune has the plot structure density of a supermassive black hole."
    }, 
    {
      "index": 53, 
      "score": 0.27877804636955261, 
      "sent": "For ardent fans of Herbert's book, the suggestion that Paul was a supernatural being able to bless the planet and the Fremen with these strange sky tears, was an intolerable and unnecessary addition by way of omission from Lynch."
    }, 
    {
      "index": 84, 
      "score": 0.27848610281944275, 
      "sent": "Though not to suggest that a great film adaption is impossible, Herbert's novel was and continues to be powerful because of what it shows through the imagination of the author and the relevance it bears to the reader."
    }, 
    {
      "index": 52, 
      "score": 0.27765277028083801, 
      "sent": "For unwitting filmgoers who'd not read the book and powered through to the bitter end, the film's denouement seems like a perfectly bizarre conclusion to what had been a two-hour backward time warp into the most incomprehensible levels of bizarre."
    }, 
    {
      "index": 57, 
      "score": 0.27489432692527771, 
      "sent": "But the elevation of Herbert's completely human Paul to Lynch's perfectly conceived and untouchable superman detracts from the story's overall and most compelling idea that the only perfection is found in nature and environment."
    }, 
    {
      "index": 64, 
      "score": 0.26860782504081726, 
      "sent": "Had Lynch or any one of the glut of directors attached over the years given the time and freedom necessary to do the story justice, it's safe to assume that Paul's character, the central point of the book and trilogy, would have been given the necessary depth that Herbert intended."
    }, 
    {
      "index": 62, 
      "score": 0.26751476526260376, 
      "sent": "Undoubtedly a play off of Luke Skywalker and the rhetorically challenged prophetic revelations of Yoda, the character of Paul had to be a familiar sell to audiences."
    }, 
    {
      "index": 25, 
      "score": 0.26622447371482849, 
      "sent": "Yes, Star Wars tells a better visual story (for the most part), but taking into account the kind of detailed, non-cursory perspective of every character, setting, background, and thematic narrative down to the subatomic level would make seven films work just as an introduction piece if there was any hope of giving any semblance of justice to the depth of Herbert's book."
    }, 
    {
      "index": 19, 
      "score": 0.25993961095809937, 
      "sent": "Tolkien's seminal first installment of The Lord Of The Rings series, Dune worked as a kind of respite for those readers who preferred their fantastical storytelling with fewer swords and more telepathic, voice-throwing messiah figures."
    }, 
    {
      "index": 73, 
      "score": 0.25945219397544861, 
      "sent": "In the book, Herbert goes to great lengths to describe the fighting method, which is dependent upon the psychokinetic makeup of the mind and consciousness."
    }, 
    {
      "index": 29, 
      "score": 0.25689953565597534, 
      "sent": "Four years removed from his time behind the chair as director for the spirit-lifting biopic The Elephant Man and its eight Academy Award nominations, Lynch received the go-ahead from producer Raffaella De Laurentiis to direct the film adaption of Dune."
    }, 
    {
      "index": 41, 
      "score": 0.25626453757286072, 
      "sent": "With Dune, focusing on a few of the most striking differences between film and book would have to begin with what's arguably the film's most significant omission."
    }, 
    {
      "index": 68, 
      "score": 0.25564458966255188, 
      "sent": "Resembling the love child of a T-Rex, Sloth from The Goonies, and a tube of meat, the Guild Navigators are absolutely hideous but also weirdly mesmerizing--a dynamic that has worked in the director's favor for years."
    }, 
    {
      "index": 69, 
      "score": 0.25539276003837585, 
      "sent": "When considering what kind of structure Lynch hoped to cull from an incalculably complicated source material, the criticism at the time of the film's more visually unsettling aspects seems outdated in retrospect."
    }, 
    {
      "index": 20, 
      "score": 0.25349026918411255, 
      "sent": "Though not at all a slight to Tolkien's masterpiece, Dune didn't simply offer an imaginative world for its characters to inhabit; it offered a world in which the characters didn't belong."
    }, 
    {
      "index": 35, 
      "score": 0.25184687972068787, 
      "sent": "So what were the expectations with the name David Lynch tacked on to every promotion ahead of the film's release?Overstating the doomed from the outset nadir of Lynch's film is like second nature to the sci-fi hive mind, with whole blogs dedicated to the cause of beating the film equivalent of a dead horse."
    }, 
    {
      "index": 4, 
      "score": 0.24858935177326202, 
      "sent": "If you're David Lynch, Universal Studios, or one of the millions of confused and horrified moviegoers in December 1984?"
    }, 
    {
      "index": 80, 
      "score": 0.24797502160072327, 
      "sent": "If anything, the film pares down the immense complexity of its source material to avoid allowing the film to be (even more) convoluted."
    }, 
    {
      "index": 71, 
      "score": 0.2459099292755127, 
      "sent": "There are far worse things in the movie than the unfortunate dermatological issues of Baron Harkonnen or the nurse guy whose eyes are sewn completely shut for some reason or even the inclusion of Paul's Mentat trainer being forced to milk a cat in order to obtain the antidote for the poison that's been introduced into his body."
    }, 
    {
      "index": 49, 
      "score": 0.24573740363121033, 
      "sent": "The synchronicity takes a swan dive, though, once Paul's training, self-awareness, and general sense of being \"the chosen one\" become a platform for what's little more than magic or sorcery, a la The Force.The most groan-inducing example of the gaffe comes at the film's end, when it's revealed that in addition to his skills at making modules and tamin' sand serpents, Paul can also bring the rain."
    }, 
    {
      "index": 30, 
      "score": 0.24232986569404602, 
      "sent": "This after 20 years, no less than 10 directors, producers, screenwriters, scripts, and general filmmaking anxiety that included the likes of Ridley Scott, Rudy Wurlitzer, Robert Greenhut, and of course the brilliantly documented attempt by Alejandro Jodorowsky.Several of Hollywood's elite took a brief glance at one of the umpteen screenplay treatments of Dune before Olympian sprinting in the opposite direction."
    }, 
    {
      "index": 47, 
      "score": 0.2411963939666748, 
      "sent": "The book wastes no time in revealing that Paul is the assumed messianic figure, otherwise known as the Kwisatz Haderach, for the Fremen people of Arrakis (Dune)."
    }, 
    {
      "index": 15, 
      "score": 0.23985807597637177, 
      "sent": "It just so happens that this book in particular happened to be densely packed with entire civilizations, religions, mathematics, philosophies, mystery worms, and the entirely imagined ecological makeup of a planet, its inhabitants, and the inhabiting collective consciousness of those inhabitants."
    }, 
    {
      "index": 42, 
      "score": 0.23967963457107544, 
      "sent": "In the novel, Paul Atreides, the 15-year-old son and heir to Duke Leto Atreides, is a precocious, albeit emotionally naive character."
    }, 
    {
      "index": 17, 
      "score": 0.23963649570941925, 
      "sent": "In the 50 years since, Dune has become one of the best-selling science fiction novels of all time."
    }, 
    {
      "index": 66, 
      "score": 0.23863424360752106, 
      "sent": "Though significant characters, The Spacing Guild's presence in the first of Herbert's Dune series is just this side of Nien Nunb (or Catfish Co-Pilot) from Return Of The Jedi."
    }, 
    {
      "index": 12, 
      "score": 0.23849482834339142, 
      "sent": "Add to that the fact that the previous seven years had been ass and elbows absorbed into a relatively well known and cherished film franchise called Star Wars, and Dune likely felt like The Beastmaster did for audiences after seeing Conan The Barbarian."
    }, 
    {
      "index": 38, 
      "score": 0.23755231499671936, 
      "sent": "In the case of Dune, that kind of undertaking continues to prove damn near impossible even 50 years after its publication."
    }, 
    {
      "index": 46, 
      "score": 0.23716911673545837, 
      "sent": "Therein lies the beginning of what runs the film aground when compared to the book."
    }, 
    {
      "index": 83, 
      "score": 0.23639419674873352, 
      "sent": "Details of Paul's wife, Chani; their children; Paul's political marriage to Princess Irulan; the expanded role of Stilgar as Paul's Fremen mentor--there are enough layers and digression within the novel that Lynch's real challenge came less in interpreting every one of them but in deciding which ones he could excise without damaging the central theme."
    }, 
    {
      "index": 59, 
      "score": 0.23580914735794067, 
      "sent": "To be fair, that distorted view of Paul by Lynch or one of the umpteen screenwriters who had beaten the script out of the novel was far more marketable than Herbert's."
    }, 
    {
      "index": 85, 
      "score": 0.23498328030109406, 
      "sent": "No amount of filmmaking technology or budgetary expenditures will ever be able to provide Dune with the kind of scope and magnitude of its story, or at least not without sacrificing some crucial part."
    }, 
    {
      "index": 39, 
      "score": 0.23319466412067413, 
      "sent": "To that end, the purpose isn't to suggest a \"better\" take on what should or could have happened with a film adaption of Dune but to suggest that the best bet is to leave well enough alone."
    }, 
    {
      "index": 81, 
      "score": 0.23123818635940552, 
      "sent": "For all that it misses, Lynch's Dune makes its greatest error in background omission."
    }, 
    {
      "index": 11, 
      "score": 0.2301999032497406, 
      "sent": "to Peter Jackson's Lord Of The Rings films, directors like Lynch were fighting an uphill battle to go past the 120-minute mark, much less go full Godfather and unleash holy celluloid running-time hell."
    }, 
    {
      "index": 45, 
      "score": 0.22934055328369141, 
      "sent": "While the former is a given for any son of royalty, the latter is the Bene Gesserit equivalent of blasphemy--a transgression that results in a visit from the affable Reverend Mother Gaius Helen Mohiam who, along with making Paul put his hand in a box full of pain (not the real kind), takes Jessica to task for deigning to get pregnant with a male child."
    }, 
    {
      "index": 67, 
      "score": 0.22921223938465118, 
      "sent": "Lynch's decision to not only include them but to visually construct them in the most Lynchian-level disgusting of ways is an interesting if not slightly jarring digression."
    }, 
    {
      "index": 91, 
      "score": 0.22224919497966766, 
      "sent": "It's all fun and games until you fuck up and strip the threading on a bolt, so you consult the manual and at least have a road map to get you the rest of the way."
    }, 
    {
      "index": 65, 
      "score": 0.22224901616573334, 
      "sent": "Another key difference between book and film is the larger role given to the collective known as The Spacing Guild."
    }, 
    {
      "index": 28, 
      "score": 0.22193193435668945, 
      "sent": "Before the collective \"everything\" echoes through the internet, it's important to understand that the phrase itself \"Lynch's Dune\" should already throw up the kind of red flags usually reserved for impending, air-raid level danger."
    }, 
    {
      "index": 60, 
      "score": 0.22142055630683899, 
      "sent": "He rendered an entire culture who planned to reset the ecology of a desolate, waterless planet by essentially creating a terrarium environment over thousands of years with hidden, underground water reservoirs."
    }, 
    {
      "index": 61, 
      "score": 0.21945491433143616, 
      "sent": "Never mind the fact that a Messianic monsoon would turn their millenniums-long plan into a shitshow: The Fremen looked better on film as a sort of primitive culture in need of a savior."
    }, 
    {
      "index": 1, 
      "score": 0.21934464573860168, 
      "sent": "The analysis goes into deep detail about specific plot points--in other words, you've been warned."
    }, 
    {
      "index": 43, 
      "score": 0.21868568658828735, 
      "sent": "Paul's mother is Lady Jessica, a student of the Bene Gesserit sisterhood, an exclusively female school for training its students in the highest levels of physical and mental powers."
    }, 
    {
      "index": 82, 
      "score": 0.21865841746330261, 
      "sent": "Background of the Harkonnens, the Atreides, the Padishah Emperor, his daughter who provides the unnecessary hush-whisper voiceover narration, but most unfortunately, that of the Fremen.One of the novel's most engaging and powerfully rendered components, the backstory and cultural dissection of the Fremen is to a great extent the backbone of the entire story, providing a who that goes beyond names into a depth of character that's rarely if ever been matched in science fiction."
    }, 
    {
      "index": 58, 
      "score": 0.2185855358839035, 
      "sent": "For Herbert, survival and enlightenment are the closest to perfection the rest of us can ever hope for."
    }, 
    {
      "index": 48, 
      "score": 0.21494866907596588, 
      "sent": "The film does this as well, and at least in that regard, both film and book run parallel."
    }, 
    {
      "index": 70, 
      "score": 0.21392974257469177, 
      "sent": "The problem again lies in trying to collapse grandeur into a marketable format."
    }, 
    {
      "index": 0, 
      "score": 0.2132810652256012, 
      "sent": "In Page To Screen, we compare a movie to the book that spawned it."
    }, 
    {
      "index": 56, 
      "score": 0.21284595131874084, 
      "sent": "Yes, Paul is the Kwisatz Haderach, and sure, the scene with his little scary-as-hell demon-voiced sister declaring him as such is a nice if not overcooked exclamation point to a cinematic run-on sentence."
    }, 
    {
      "index": 33, 
      "score": 0.21200080215930939, 
      "sent": "To that point, one of the more prevalent criticisms, specifically from Roger Ebert, was that the movie was ugly."
    }, 
    {
      "index": 44, 
      "score": 0.2101936936378479, 
      "sent": "She's also the concubine, but not wife, of the Duke, a decision he expresses throughout both book and film (he is portrayed outstandingly in the movie by actor Jurgen Prochnow).Paul is a student of his father and his father's trainers, Thufir Hawat and Gurney Halleck (played by the unnervingly ageless Patrick Stewart), and he has also received the Bene Gesserit training from his mother."
    }, 
    {
      "index": 90, 
      "score": 0.20202526450157166, 
      "sent": "It's kind of like trying to put together an entertainment center without reading the instructions."
    }, 
    {
      "index": 87, 
      "score": 0.19783924520015717, 
      "sent": "Herbert's carefully constructed ecology of people, plants, animals, politics, cultures, and belief systems is not unlike any ecological system where even the smallest change eventually becomes a vast deviation from the norm."
    }, 
    {
      "index": 51, 
      "score": 0.19735242426395416, 
      "sent": "Lynch's film, which by that time was a smoldering pile of \"what the hell just happened,\" concludes with a robed Paul looking upward just as rain begins to pour on the up until then un-rained-upon Arrakis."
    }, 
    {
      "index": 16, 
      "score": 0.19682131707668304, 
      "sent": "Published in 1965, Herbert's novel received with near universal acclaim, culminating in his being awarded the 1966 Hugo Award."
    }, 
    {
      "index": 3, 
      "score": 0.19237500429153442, 
      "sent": "If you're Frank Herbert, absolutely nothing."
    }, 
    {
      "index": 31, 
      "score": 0.19012871384620667, 
      "sent": "So the \"What's the worst that could possibly happen?\""
    }, 
    {
      "index": 32, 
      "score": 0.18732848763465881, 
      "sent": "mentality set in as all eyes focused on the guy who had made not one but two films centered around hideousness."
    }, 
    {
      "index": 79, 
      "score": 0.18372112512588501, 
      "sent": "Aside from replacing the old standby laser sound with the deadly hazards of a rogue sneeze, Lynch's \"complete abortion of a sacred text\" is really not so much."
    }, 
    {
      "index": 2, 
      "score": 0.18346399068832397, 
      "sent": "Space, witches, prophesies, lasers, gigantic worms, hallucinogenics, Messiahs, gom jabbars, Kyle MacLachlan--what could possibly go wrong?"
    }, 
    {
      "index": 27, 
      "score": 0.18198403716087341, 
      "sent": "So what the hell is wrong with Lynch's Dune?"
    }, 
    {
      "index": 89, 
      "score": 0.17065896093845367, 
      "sent": "That way you can abate your unhinged frustration over what the hell you just witnessed by reading the guidebook of sorts."
    }, 
    {
      "index": 5, 
      "score": 0.17024850845336914, 
      "sent": "A metric fuck ton."
    }, 
    {
      "index": 86, 
      "score": 0.17010970413684845, 
      "sent": "That's the thing with book, too."
    }, 
    {
      "index": 18, 
      "score": 0.16330045461654663, 
      "sent": "Released just a little over a decade after J.R.R."
    }, 
    {
      "index": 40, 
      "score": 0.14690379798412323, 
      "sent": "Some things are better left unseen."
    }, 
    {
      "index": 74, 
      "score": 0.14433693885803223, 
      "sent": "Not satisfied with such a primitive concept, Lynch or who the hell knows, really, decided to replace mind-to-mind combat with--wait for it--laser pistols."
    }, 
    {
      "index": 34, 
      "score": 0.14094984531402588, 
      "sent": "Others said it was gross and hard to watch."
    }, 
    {
      "index": 9, 
      "score": 0.138967365026474, 
      "sent": "Long before New Line Cinema were saying \"Fuck it."
    }, 
    {
      "index": 88, 
      "score": 0.1308293342590332, 
      "sent": "Start with: Watch the film before you read the book."
    }, 
    {
      "index": 78, 
      "score": 0.11171764135360718, 
      "sent": "it's \"Aaaaaa-CHA\"."
    }, 
    {
      "index": 50, 
      "score": 0.10628580302000046, 
      "sent": "Literally."
    }, 
    {
      "index": 10, 
      "score": 0.10161736607551575, 
      "sent": "Why not?\""
    }, 
    {
      "index": 75, 
      "score": 0.094513945281505585, 
      "sent": "Laser pistols that use sound as their lasers."
    }, 
    {
      "index": 77, 
      "score": 0.079110778868198395, 
      "sent": "Zap!\""
    }, 
    {
      "index": 76, 
      "score": 0.075830571353435516, 
      "sent": "So instead of \"Zap!"
    }
  ], 
  "title": null
}