{"model": "c22a5bd", "scored_article_sentences": [{"index": 3, "score": 0.33300775289535522, "sent": "During a Pacific Extreme Pattern, a large area of the Pacific north of Hawaii experiences unusual temperatures both at the water's surface and far above it in the atmosphere."}, {"index": 7, "score": 0.28907012939453125, "sent": "The researchers examined weather data from sensors in both the Pacific and throughout the Eastern US between 1982 to 2015, finding that the Pacific Extreme Pattern was a strong predictor of heat waves."}, {"index": 10, "score": 0.28642019629478455, "sent": "Given that the Eastern US has a high population as well as many agricultural regions that are breadbaskets for the nation, this kind of long-range prediction could be lifesaving."}, {"index": 4, "score": 0.28308406472206116, "sent": "Specifically, the southern part of the region gets far hotter than is typical, and the northeastern part of the region gets much colder."}, {"index": 11, "score": 0.27490919828414917, "sent": "What's remarkable about this study is that it might pave the way for other kinds of extreme weather prediction as well."}, {"index": 14, "score": 0.27383294701576233, "sent": "The authors of the study emphasize that the heat waves are a combination of heat in the Pacific with low rain in the east."}, {"index": 2, "score": 0.27082917094230652, "sent": "A new study, published today in Nature Geoscience, reveals that heat waves arise in a predictable pattern roughly 40 to 50 days after an event called the Pacific Extreme Pattern."}, {"index": 8, "score": 0.26638293266296387, "sent": "When the pattern emerges, there is a 1 in 4 chance that the Eastern US will experience extreme heat in 50 days."}, {"index": 13, "score": 0.26614066958427429, "sent": "It is exciting that there is some skill demonstrated as far out as 50 days as this also gives us hope for linkages to other extreme weather events."}, {"index": 12, "score": 0.26509049534797668, "sent": "Tornado forecasting researcher Victor Gensini, who was not involved in the study, told the Associated Press: The physical mechanisms underpinning the results of their study make sense."}, {"index": 5, "score": 0.25693401694297791, "sent": "These unusual temperature patterns create a wave of weather effects that sweep over most of the US, then stop over the humid inland eastern region, creating a high pressure zone that brings clear skies and oppressive heat."}, {"index": 15, "score": 0.22969445586204529, "sent": "They write, \"The results presented here link two previously identified precursors to hot days--precipitation deficits and an anomalous atmospheric wave train--with the occurrence of [Pacific Extreme Pattern].\""}, {"index": 6, "score": 0.22848223149776459, "sent": "The effect is intensified if there has been little rain in the east as well."}, {"index": 9, "score": 0.22816036641597748, "sent": "There's a 1 in 2 chance that they'll experience it in 40 days."}, {"index": 16, "score": 0.20283342897891998, "sent": "That's one train you don't want to be riding when summer comes."}, {"index": 17, "score": 0.18434092402458191, "sent": "Now, at least, you may have seven weeks to prepare for it."}, {"index": 1, "score": 0.18170458078384399, "sent": "Extreme heat waves like the one that hit the Eastern US in 2012, leaving at least 82 dead, don't just come out of nowhere."}, {"index": 0, "score": 0.17069916427135468, "sent": "Scientists have just discovered a bizarre pattern in global weather."}, {"index": 18, "score": 0.12743020057678223, "sent": "Nature Geoscience, 2016."}, {"index": 19, "score": 0.014380982145667076, "sent": "DOI: 10.1038/ngeo2687"}], "title": null}