{"model": "c22a5bd", "scored_article_sentences": [{"index": 19, "score": 0.24953214824199677, "sent": "Though I preferred the name dorveille, because it sounded glamorous, \"the watch\" was technically more accurate during those early weeks, when I mainly got up and watched Netflix.In the preindustrial West, most people slept in two discrete blocks and used dorveille for all kinds of purposes."}, {"index": 34, "score": 0.23749181628227234, "sent": "Dorveille's appeal doesn't derive from historicity: what appeals is the escape from the very conditions that obliterated it."}, {"index": 30, "score": 0.23711724579334259, "sent": "It was the Industrial Revolution, saturating us with electric light, that caused dorveille to obsolesce -- but now it's electricity that makes it so useful."}, {"index": 51, "score": 0.22810833156108856, "sent": "This isn't the whole story (pre- and non-Christian cultures practiced biphasic sleep), but what is true is that dorveille was communal."}, {"index": 28, "score": 0.22348727285861969, "sent": "Much of this was forgotten until 2001, when the historian Roger Ekirch unearthed segmented sleep in the cultural history of pre-19th-century Europe, supporting the research of an American chronobiologist who, in a 1992 study, asserted that segmented sleep is more natural than the monophasic variety we now aspire to."}, {"index": 29, "score": 0.22263307869434357, "sent": "Exposed over several weeks to preindustrial light conditions, most of us will gradually start sleeping twice a night, hooked to the Ur-rhythm of our internal clock."}, {"index": 2, "score": 0.21488550305366516, "sent": "I'd find myself sitting at my desk, facing emails that I couldn't remember sending and deeply wished to retract."}, {"index": 45, "score": 0.21445377171039581, "sent": "The author of that 1992 study -- the one that proved the innateness of segmented sleep -- described dorveille as a state of \"nonanxious wakefulness,\" which truly sounds oxymoronic until you experience it."}, {"index": 18, "score": 0.21375556290149689, "sent": "Conversation has a conspiratorial intimacy, as if you've sneaked behind the tent to find the only other smoker at the wedding."}, {"index": 25, "score": 0.21350963413715363, "sent": "We tend to view our basic patterns, like spending the evening out and then lying unconscious for eight hours straight, as belonging to a natural order."}, {"index": 31, "score": 0.2113356739282608, "sent": "Dorveille is the only part of the day when no one expects to hear from anyone at all."}, {"index": 50, "score": 0.21111974120140076, "sent": "It is sometimes noted that segmented sleep fits snugly within the Christian Liturgy of the Hours, which obligated the faithful to rise at dawn for Lauds and pray in the dead of night."}, {"index": 44, "score": 0.20986285805702209, "sent": "Metabolically, the alertness of dorveille differs from the taut insomniac variety."}, {"index": 38, "score": 0.20377171039581299, "sent": "For me, the tasks undertaken in dorveille retained a little of the ease of dreaming."}, {"index": 10, "score": 0.20359356701374054, "sent": "It looked embarrassing in a modern context, but it was once the most normal thing in the world."}, {"index": 12, "score": 0.2025509774684906, "sent": "The French called it dorveille, or wakesleep, a hypnotic state."}, {"index": 39, "score": 0.20144252479076385, "sent": "During the day, I can't reliably read 20 pages in a row before I experience an overwhelming physical urge to waste my time."}, {"index": 57, "score": 0.19877472519874573, "sent": "I get the postmodern afterglow, the decay of a mass-cultural behavior into an individual preference."}, {"index": 3, "score": 0.19694596529006958, "sent": "How had my life been put in the hands of someone like me?"}, {"index": 58, "score": 0.19009655714035034, "sent": "I've gained another routine, when what I want is a sense of ritual."}, {"index": 22, "score": 0.18233633041381836, "sent": "Many people wrote in journals or interpreted dreams, which feel more proximate at 3 a.m. than in daylight."}, {"index": 24, "score": 0.17965446412563324, "sent": "But everyone did something, because dorveille was ubiquitous."}, {"index": 1, "score": 0.17931565642356873, "sent": "Illustration by Valero Doval                           Late last year, an edgy, blanked-out feeling nestled in with me and wouldn't leave."}, {"index": 26, "score": 0.17915207147598267, "sent": "But until streetlights, being up late meant wandering town in butt-clenching terror, tripping over stray animals until the wind blew out your lantern and you were set upon by armed bandits."}, {"index": 0, "score": 0.17714443802833557, "sent": "Sleeping in two distinct blocks opens an ancient portal to the other side of midnight."}, {"index": 11, "score": 0.17620867490768433, "sent": "Back when segmented sleep was common, this period between \"first\" and \"second\" sleep inspired reverence."}, {"index": 23, "score": 0.17600317299365997, "sent": "You could drink a cup of tea and take a satisfied leak on the embers of your fire."}, {"index": 4, "score": 0.17459826171398163, "sent": "I had no attention, no patience; whatever I did, I was bored 10 seconds later."}, {"index": 32, "score": 0.17412744462490082, "sent": "You can keep yourself unavailable without that abstract sense of guilt."}, {"index": 17, "score": 0.17291764914989471, "sent": "The urge to be busy abates."}, {"index": 35, "score": 0.1729121208190918, "sent": "At first, I treated dorveille like stolen time, and like most thieves, I was careless with my loot, frittering it away each night."}, {"index": 14, "score": 0.17080165445804596, "sent": "I had usually approached the post-midnight hours full-sail, by staying up."}, {"index": 5, "score": 0.16718684136867523, "sent": "I closed my eyes and saw browser tabs on the inside of my lids."}, {"index": 9, "score": 0.16692502796649933, "sent": "And the next, and the next, until I was regularly entering the forgotten, ancient tunnel to the other side of midnight: segmented sleep."}, {"index": 43, "score": 0.16326618194580078, "sent": "I found that snaggly, insoluble problems, in friendships and writing and marriage, were more easily confronted and could be muddled through for longer."}, {"index": 6, "score": 0.16124585270881653, "sent": "Soon insomnia knocked me totally out of sync, and I compensated one night by nodding off at 8 p.m. That caused me to wake up at 2 a.m., disoriented."}, {"index": 37, "score": 0.16024896502494812, "sent": "Dorveille once served as a time to remember dreams."}, {"index": 46, "score": 0.16007748246192932, "sent": "I'm one of the least relaxed people I know; having lived most of my adult life in New York, \"awake\" and \"anxious\" are synonyms as far as I'm concerned."}, {"index": 21, "score": 0.15728065371513367, "sent": "Benjamin Franklin liked to \"take cold-air baths,\" a fancy way of saying \"open his windows naked.\""}, {"index": 61, "score": 0.15433153510093689, "sent": "A version of this article appears in print on April 3, 2016, on page MM26 of the Sunday Magazine with the headline: Segmented Sleep."}, {"index": 56, "score": 0.15400534868240356, "sent": "That's the part of segmented sleep I might never experience."}, {"index": 59, "score": 0.15185651183128357, "sent": "Jesse Barron is a writer in New York."}, {"index": 13, "score": 0.15052114427089691, "sent": "English speakers called it \"the watch.\""}, {"index": 52, "score": 0.15040639042854309, "sent": "Waking at 2 a.m. in 1550, you were not quite alone."}, {"index": 40, "score": 0.13971716165542603, "sent": "During dorveille, I finished books."}, {"index": 15, "score": 0.13927395641803741, "sent": "Waking into them is different, childlike."}, {"index": 20, "score": 0.13771116733551025, "sent": "Having sex was popular."}, {"index": 36, "score": 0.13667477667331696, "sent": "But as I persisted, I saw the deeper value."}, {"index": 16, "score": 0.13659998774528503, "sent": "The time feels freer."}, {"index": 7, "score": 0.13657347857952118, "sent": "I spent a few hours brooding, then slept again until 6, when I got up, had coffee and showered."}, {"index": 41, "score": 0.13622908294200897, "sent": "It was like having a superpower."}, {"index": 33, "score": 0.13368521630764008, "sent": "You never need to open an email."}, {"index": 27, "score": 0.13361328840255737, "sent": "So you went home before dark and went to bed early, waking after midnight."}, {"index": 8, "score": 0.12928615510463715, "sent": "Tired again at 8 p.m., I repeated the pattern the following night."}, {"index": 55, "score": 0.12925446033477783, "sent": "An invisible clamor of writing, drinking, lovemaking, fighting humanity enveloped you."}, {"index": 42, "score": 0.1286395788192749, "sent": "Nor must dorveille be all business."}, {"index": 60, "score": 0.12759482860565186, "sent": "Sign up for our newsletter to get the best of The New York Times Magazine delivered to your inbox every week."}, {"index": 54, "score": 0.12283530086278915, "sent": "Your neighbors were up, you might reasonably think, probably doing the same things you were."}, {"index": 48, "score": 0.11497121304273605, "sent": "Most amazing, I had no desire to reach for my phone."}, {"index": 53, "score": 0.1129370704293251, "sent": "Your husband or wife was up, too."}, {"index": 47, "score": 0.10809697210788727, "sent": "But during these hours I felt calm."}, {"index": 49, "score": 0.10263190418481827, "sent": "I felt an unfamiliar lack of itch."}], "title": null}