{
  "model": "c22a5bd", 
  "scored_article_sentences": [
    {
      "index": 402, 
      "score": 0.31365221738815308, 
      "sent": "The level of distrust between U.S. and Mexican officials on this issue is pronounced; indeed, one theory I heard for the Americans' decision to leak the news of Guzman's capture to the Associated Press was that going public would foreclose any possibility of Mexican authorities quietly letting him go."
    }, 
    {
      "index": 15, 
      "score": 0.30886414647102356, 
      "sent": "Guzman has been characterized by the U.S. Treasury Department as \"the world's most powerful drug trafficker,\" and after the killing of Osama bin Laden, three years ago, he became perhaps the most wanted fugitive on the planet."
    }, 
    {
      "index": 177, 
      "score": 0.2932794988155365, 
      "sent": "This is sometimes described as a \"mirror\" system, and it is fiendishly difficult for authorities to penetrate (especially when the transcribers keep moving from one WiFi hot spot to another)."
    }, 
    {
      "index": 280, 
      "score": 0.29027226567268372, 
      "sent": "When young Mexican officers study their nation's military history, the curriculum dwells, inescapably, on the many invasions by the United States; the prospect of an overbearing American law-enforcement presence south of the border offended many Mexicans' sense of sovereignty."
    }, 
    {
      "index": 3, 
      "score": 0.28877192735671997, 
      "sent": "This was not a business trip: the killer, who was thirty-three, liked to travel, and often documented his journeys around Europe on Instagram."
    }, 
    {
      "index": 285, 
      "score": 0.28834769129753113, 
      "sent": "At the time of the Obama meeting, the SEMAR unit was still pursuing Guzman in Culiacan."
    }, 
    {
      "index": 95, 
      "score": 0.2874375581741333, 
      "sent": "Sinaloa remains poor, however, and Badiraguato, the municipality containing Guzman's home village, is one of the most desperate areas in the state."
    }, 
    {
      "index": 443, 
      "score": 0.28348469734191895, 
      "sent": "One by-product of the culture of corruption in Mexico is a reflexive cynicism about any official story put out by the government."
    }, 
    {
      "index": 289, 
      "score": 0.28346452116966248, 
      "sent": "Information from one of Guzman's captured associates led the marines to a nearby warehouse, where they uncovered a cache of heavy weaponry and more than three tons of cocaine and methamphetamine."
    }, 
    {
      "index": 305, 
      "score": 0.28340107202529907, 
      "sent": "In light of the debacle in Los Cabos, the SEMAR operators and their American colleagues worried that Guzman might have already left Mazatlan."
    }, 
    {
      "index": 9, 
      "score": 0.28090015053749084, 
      "sent": "To work in the Mexican drug trade is to have a nickname, and Arechiga went by the whimsically malevolent handle El Chino Antrax."
    }, 
    {
      "index": 435, 
      "score": 0.28009223937988281, 
      "sent": "But the question of who will inherit the Sinaloa cartel may be somewhat beside the point, because, well before Guzman's capture, the landscape of crime in Mexico had begun to shift."
    }, 
    {
      "index": 290, 
      "score": 0.2799319326877594, 
      "sent": "Some of the drugs had been concealed inside plastic cucumbers and bananas, in preparation for a surreptitious journey across the border."
    }, 
    {
      "index": 291, 
      "score": 0.27934202551841736, 
      "sent": "The marines knew that, in addition to the safe houses and the escape routes, Guzman had aides who could provide him with a new BlackBerry or a ride out of town."
    }, 
    {
      "index": 8, 
      "score": 0.27924248576164246, 
      "sent": "Only after the Dutch authorities had the man in custody did they learn his real identity: Jose Rodrigo Arechiga, the chief enforcer for the biggest drug-trafficking organization in history, Mexico's Sinaloa cartel."
    }, 
    {
      "index": 277, 
      "score": 0.27919554710388184, 
      "sent": "For years, U.S. law-enforcement officers had chafed at the pretense that they were merely \"advising\" their Mexican counterparts in the fight against the narcos; some of them wanted American armed forces to have wide operational latitude on the ground, as they had once had in Colombia."
    }, 
    {
      "index": 45, 
      "score": 0.27905914187431335, 
      "sent": "When the cartel suffers the loss of a major figure like El Chino Antrax, it can reconstitute itself--but not without a few phone calls among the leadership."
    }, 
    {
      "index": 284, 
      "score": 0.27881187200546265, 
      "sent": "For Pena Nieto, establishing rhetorical distance from the gringos may have created the political latitude for him to collaborate with them."
    }, 
    {
      "index": 367, 
      "score": 0.27789652347564697, 
      "sent": "It was a huge victory for Pena Nieto and for the D.E.A., if largely a symbolic one."
    }, 
    {
      "index": 393, 
      "score": 0.27717414498329163, 
      "sent": "His victims were overwhelmingly Mexican; one reason that the drug war has been so easy for most Americans to ignore is that very little of the violence visited upon Mexico has spilled into the U.S. During the years when Juarez was the most dangerous city on the planet--and a resident there had a greater statistical likelihood of being murdered than someone living in the war zones of Afghanistan or Iraq--El Paso, just across the border, was one of the safest cities in America."
    }, 
    {
      "index": 392, 
      "score": 0.27711954712867737, 
      "sent": "As both the instigator and the victor of some of the bloodiest battles on the border, Guzman bears responsibility for an appalling proportion of these atrocities."
    }, 
    {
      "index": 18, 
      "score": 0.27639979124069214, 
      "sent": "According to one study, the Sinaloa cartel is now active in more than fifty countries."
    }, 
    {
      "index": 265, 
      "score": 0.27600467205047607, 
      "sent": "When Pena Nieto came into office, in 2012, many Washington officials had doubts about his determination to fight the cartels."
    }, 
    {
      "index": 385, 
      "score": 0.27600225806236267, 
      "sent": "Guzman still needed to complete his original twenty-year sentence, and then face multiple new charges, before the Mexican government would consider turning him over to the U.S."
    }, 
    {
      "index": 386, 
      "score": 0.27574515342712402, 
      "sent": "Earlier this month, he announced that Mexico has \"no intention\" of extraditing Guzman, citing a concern that other Mexican officials raised with me: that American authorities might flip Guzman and grant him a reduced sentence, in exchange for his cooperation."
    }, 
    {
      "index": 89, 
      "score": 0.27550306916236877, 
      "sent": "If Chapo's escape suggested that the Mexican political system had been corroded by drug money, his subsequent years as a fugitive did not diminish this impression."
    }, 
    {
      "index": 178, 
      "score": 0.27456927299499512, 
      "sent": "Nevertheless, by studying the communications patterns of the cartel, analysts at the Special Operations Division of the D.E.A."
    }, 
    {
      "index": 269, 
      "score": 0.27453288435935974, 
      "sent": "In Ciudad Juarez, one of the flashpoints in the conflict, the annual murder rate jumped from about three hundred in 2007 to more than three thousand in 2010."
    }, 
    {
      "index": 292, 
      "score": 0.27394953370094299, 
      "sent": "So SEMAR occupied each safe house it discovered, and focussed on pursuing the men in Guzman's entourage, on the theory that if they cut him off from his support network he would no longer have a place to hide."
    }, 
    {
      "index": 281, 
      "score": 0.27269032597541809, 
      "sent": "Soon after Pena Nieto assumed office, he declared that all initiatives led or assisted by the U.S. must be routed through an office in Mexico's Ministry of the Interior, which became known as \"the single window.\""
    }, 
    {
      "index": 181, 
      "score": 0.27261698246002197, 
      "sent": "In early February of this year, when the special-forces unit from SEMAR began making forays into Sinaloa, it was the first time that Mexico's marines had ever pursued such a significant operation in the state."
    }, 
    {
      "index": 233, 
      "score": 0.27201443910598755, 
      "sent": "In the early days of Guzman's career, before his time at Puente Grande, he distinguished himself as a trafficker who brought an unusual sense of imagination and play to the trade."
    }, 
    {
      "index": 264, 
      "score": 0.27102106809616089, 
      "sent": "Obama praised the \"excellent cooperation between the United States and Mexico\" on criminal-justice issues."
    }, 
    {
      "index": 116, 
      "score": 0.27060353755950928, 
      "sent": "The peaks of the Sierra Madre Occidental are steep and jagged, and the roads that vein their contours often taper to a single dirt track."
    }, 
    {
      "index": 371, 
      "score": 0.26909232139587402, 
      "sent": "Guzman's genius was always architectural, and the infrastructure that he created will almost certainly survive him."
    }, 
    {
      "index": 306, 
      "score": 0.26776602864265442, 
      "sent": "He enjoyed considerable protection in the city, where he had often received shipments from India and China of the precursor chemicals used to manufacture meth."
    }, 
    {
      "index": 57, 
      "score": 0.26756536960601807, 
      "sent": "Fighting drug traffickers in Mexico has become a matter of triage, and the SEMAR unit was soon to be redeployed to battle another cartel, the Knights Templar, in the restive state of Michoacan."
    }, 
    {
      "index": 124, 
      "score": 0.26742392778396606, 
      "sent": "The only traffickers in Sinaloa who beat the odds are those who are content to follow a more austere life in the mountains."
    }, 
    {
      "index": 268, 
      "score": 0.26725476980209351, 
      "sent": "But the campaign was a resounding failure: the death toll in Mexico spiralled as the cartels fought daylight gun battles with the authorities and among themselves."
    }, 
    {
      "index": 40, 
      "score": 0.26713323593139648, 
      "sent": "Guzman was known to use sophisticated encryption and to limit the number of people he communicated with, keeping his organization compartmentalized and allowing subordinates a degree of autonomy, as long as the shipments kept running on time."
    }, 
    {
      "index": 437, 
      "score": 0.26660975813865662, 
      "sent": "With cocaine consumption declining in the U.S., and marijuana on a path toward widespread legalization, a Darwinian logic is driving the cartels' expansion into more parasitic varieties of crime."
    }, 
    {
      "index": 363, 
      "score": 0.26533308625221252, 
      "sent": "In another recent case, officials in Michoacan announced that they had killed the infamous kingpin Nazario Moreno, a triumph that was somewhat undercut by the fact that Moreno--who was known as El Mas Loco, or the Craziest One--had supposedly perished in a showdown with government forces in 2010."
    }, 
    {
      "index": 407, 
      "score": 0.26485973596572876, 
      "sent": "He is permitted visits not just with his lawyer but also with members of his family, many of whom have been implicated in the activities of his cartel."
    }, 
    {
      "index": 309, 
      "score": 0.26485756039619446, 
      "sent": "But, if Condor was so indispensable to the drug lord, capturing him could provide valuable intelligence and squeeze Guzman even further."
    }, 
    {
      "index": 55, 
      "score": 0.26429429650306702, 
      "sent": "According to the Dallas Morning News, the government of Mexico's President Enrique Pena Nieto informed the marines and their American partners that they would have approximately three weeks to bring down the drug lord."
    }, 
    {
      "index": 204, 
      "score": 0.26415807008743286, 
      "sent": "Nariz was part of this privileged circle, serving as Guzman's personal assistant and errand boy."
    }, 
    {
      "index": 276, 
      "score": 0.26396393775939941, 
      "sent": "In the past, PRI officials had largely countenanced drug trafficking, in exchange for well-placed bribes, and it wasn't clear if Pena Nieto was sincere about pursuing a different path."
    }, 
    {
      "index": 61, 
      "score": 0.26364856958389282, 
      "sent": "A battleship anchored off the coast was used as a decoy, so that curious observers might conclude that the sudden influx of commandos was part of a standard naval exercise."
    }, 
    {
      "index": 91, 
      "score": 0.26279392838478088, 
      "sent": "The sociologist Diego Gambetta, in his 1993 book \"The Sicilian Mafia,\" observes that durable criminal enterprises are often woven into the social and political fabric, and part of their \"intrinsic tenacity\" is their ability to offer certain services that the state does not."
    }, 
    {
      "index": 388, 
      "score": 0.2617049515247345, 
      "sent": "The opposition to extradition, however, could be driven by less noble concerns: flipping Guzman might provide the American government with evidence against top Mexican officials."
    }, 
    {
      "index": 312, 
      "score": 0.26161733269691467, 
      "sent": "It has long been a corridor for narcotics trafficking, but, as uncontested Sinaloa territory, it has been spared the severe internecine violence that has plagued more disputed areas."
    }, 
    {
      "index": 201, 
      "score": 0.26100516319274902, 
      "sent": "A plump-cheeked man with a droopy mustache and a crooked boxer's nose, he was a veteran of Mexico's special forces who had switched sides to work for the traffickers."
    }, 
    {
      "index": 44, 
      "score": 0.26098302006721497, 
      "sent": "Structurally, its network is distributed, and has more in common with a terrorist organization like Al Qaeda than with the antiquated hierarchies of the Cosa Nostra."
    }, 
    {
      "index": 304, 
      "score": 0.26052629947662354, 
      "sent": "The authorities traced the signal and saw that it came from the port city of Mazatlan, a hundred and forty miles to the southeast."
    }, 
    {
      "index": 316, 
      "score": 0.26035833358764648, 
      "sent": "Geolocation technology can trace a signal to a given city block or building, but not necessarily determine where in the building the device is situated."
    }, 
    {
      "index": 14, 
      "score": 0.26034858822822571, 
      "sent": "The Sinaloa cartel exports industrial volumes of cocaine, marijuana, heroin, and methamphetamine to America; it is thought to be responsible for as much as half the illegal narcotics that cross the border every year."
    }, 
    {
      "index": 308, 
      "score": 0.26030588150024414, 
      "sent": "By this point, federal authorities in Mexico City had learned about the botched operation in Culiacan, and the three-week window before the SEMAR redeployment was nearly closed."
    }, 
    {
      "index": 266, 
      "score": 0.25970393419265747, 
      "sent": "His predecessor, Felipe Calderon, had launched an unprecedented assault against drug trafficking, deploying fifty thousand troops to battle the traffickers in the streets; the armed forces pursued a \"kingpin strategy,\" seeking to dismantle drug syndicates by killing or capturing their leaders."
    }, 
    {
      "index": 272, 
      "score": 0.25912973284721375, 
      "sent": "The flow of narcotics across the border never diminished significantly, and, as cartels like Sinaloa and the Zetas vanquished smaller competitors, they consolidated territorial control, growing more powerful and more grotesque in the process."
    }, 
    {
      "index": 406, 
      "score": 0.25871026515960693, 
      "sent": "Guzman is ostensibly being held \"in isolation,\" at Mexico's most secure prison, Altiplano, about fifty miles west of Mexico City."
    }, 
    {
      "index": 195, 
      "score": 0.25818195939064026, 
      "sent": "The first important arrest of Operation Gargoyle occurred on February 13th, when the SEMAR unit apprehended a group of Sinaloa assassins on a highway outside Culiacan."
    }, 
    {
      "index": 395, 
      "score": 0.25798392295837402, 
      "sent": "But the Mexican officials I spoke with acknowledge that the criminal-justice system in their country is fragile, and that corruption remains endemic."
    }, 
    {
      "index": 21, 
      "score": 0.25778016448020935, 
      "sent": "Three years later, Guzman married a teen-age beauty queen named Emma Coronel and invited half the criminal underworld of Mexico to attend the ceremony."
    }, 
    {
      "index": 74, 
      "score": 0.25733733177185059, 
      "sent": "The next spring, the traffickers arranged for their own hit men to murder Guzman at the international airport in Guadalajara."
    }, 
    {
      "index": 343, 
      "score": 0.25729984045028687, 
      "sent": "With his wife and daughters present, Guzman may have realized that the only way to spare their lives was to surrender."
    }, 
    {
      "index": 380, 
      "score": 0.25720763206481934, 
      "sent": "The morning after his capture, Michael McCaul, the Texas Republican who chairs the House Homeland Security committee, announced that Guzman should be extradited to America, telling ABC, \"There is a history here--he escaped from a prison in 2001.\""
    }, 
    {
      "index": 452, 
      "score": 0.25664550065994263, 
      "sent": "So it should come as no surprise that many observers believe that Guzman's \"capture\" in Mazatlan was a theatrical event directed by the drug lord himself."
    }, 
    {
      "index": 254, 
      "score": 0.25625589489936829, 
      "sent": "A tunnel is an exceedingly dangerous environment in which to stalk someone who is armed: if he should turn and fire at you, he doesn't even need to aim--one of the ricocheting bullets will likely hit you."
    }, 
    {
      "index": 10, 
      "score": 0.25517365336418152, 
      "sent": "He supervised the armed wing of the Sinaloa--a cadre of executioners known as Los Antrax--and coordinated drug shipments for the cartel's leader, Joaquin Guzman Loera, who was known as El Chapo, or Shorty."
    }, 
    {
      "index": 436, 
      "score": 0.25457707047462463, 
      "sent": "Whereas Sinaloa is a traditional drug cartel, focussing chiefly on the manufacture and export of narcotics, newer groups, such as the Zetas and the Knights Templar, have diversified their money-making activities to include extortion, human trafficking, and kidnapping for ransom."
    }, 
    {
      "index": 165, 
      "score": 0.25431284308433533, 
      "sent": "But a courier system is too inefficient for the fast pace of the narcotics trade, and so, as U.S. and Mexican authorities eventually discovered, Chapo devised an elaborate solution."
    }, 
    {
      "index": 94, 
      "score": 0.25362774729728699, 
      "sent": "Juan Millan, the former state governor of Sinaloa, once estimated that sixty-two per cent of the state's economy is tied up with drug money."
    }, 
    {
      "index": 173, 
      "score": 0.25340673327445984, 
      "sent": "The transcribed message would be sent not to Guzman but to a second intermediary, who, also using a tablet and public WiFi, would transcribe the words onto his BlackBerry and relay them to Guzman."
    }, 
    {
      "index": 297, 
      "score": 0.25320321321487427, 
      "sent": "Picudo said that he had picked up Guzman and the bodyguard by a storm drain on the outskirts of Culiacan."
    }, 
    {
      "index": 198, 
      "score": 0.2523668110370636, 
      "sent": "In American debates over the National Security Agency's warrantless collection of \"metadata,\" this is one reason that many authorities have been quick to defend these techniques; a constellation of dialled phone numbers can be used to build a \"link chart\" exposing the hierarchy of an organization."
    }, 
    {
      "index": 432, 
      "score": 0.25156590342521667, 
      "sent": "Guzman's sons would appear to be candidates, but, as the coddled children of a wealthy trafficker, they may be more enamored of the narco life style than of the business itself."
    }, 
    {
      "index": 240, 
      "score": 0.2511487603187561, 
      "sent": "Guzman ordered Corona-Verbera to design a tunnel that ran from a residence in Agua Prieta, immediately south of the border, to a cartel-owned warehouse in Douglas, Arizona."
    }, 
    {
      "index": 115, 
      "score": 0.25109535455703735, 
      "sent": "According to a diplomatic cable that was later released by WikiLeaks, Galvan explained that Guzman was believed to move among a dozen or so ranches, and to be protected by up to three hundred armed men."
    }, 
    {
      "index": 373, 
      "score": 0.24989239871501923, 
      "sent": "Some believe that, even before Guzman's capture, his role in the organization had become largely symbolic."
    }, 
    {
      "index": 17, 
      "score": 0.24968639016151428, 
      "sent": "But part of Guzman's fame stemmed from the perception that he was uncatchable, and he continued to thrive, consolidating control of key smuggling routes and extending his operation into new markets in Europe, Asia, and Australia."
    }, 
    {
      "index": 155, 
      "score": 0.2496209591627121, 
      "sent": "Whether or not Guzman had been alerted in advance remains unclear, but he had enough time to sneak out the back of the property; he went to an adjacent resort, where he blended into a crowd of vacationers before moving on."
    }, 
    {
      "index": 24, 
      "score": 0.24915261566638947, 
      "sent": "agents developed fresh intelligence about Guzman's whereabouts all they could do was feed the leads to their Mexican counterparts and hope for the best."
    }, 
    {
      "index": 267, 
      "score": 0.24794253706932068, 
      "sent": "Calderon's approach received strong financial and material support from Washington."
    }, 
    {
      "index": 344, 
      "score": 0.24726478755474091, 
      "sent": "When the marines searched the Miramar apartment, they found a blue vinyl wheelchair: Guzman had entered the building pretending to be a frail old man."
    }, 
    {
      "index": 313, 
      "score": 0.24719119071960449, 
      "sent": "On the night of Friday, February 21st, about forty marines assembled in the city, along with a small contingent of agents from the D.E.A., the U.S."
    }, 
    {
      "index": 377, 
      "score": 0.24701040983200073, 
      "sent": "Alejandro Hope, a former senior official in Mexican intelligence, told me that the message of Operation Gargoyle is simple and resounding: \"No one is beyond sanction.\""
    }, 
    {
      "index": 62, 
      "score": 0.24694129824638367, 
      "sent": "But one reason that Guzman had remained at large so long was his unparalleled network of informants."
    }, 
    {
      "index": 90, 
      "score": 0.24672874808311462, 
      "sent": "He retreated to Sinaloa and expanded his operations, launching violent turf wars with rival cartels over control of prized entry points along the U.S. border."
    }, 
    {
      "index": 271, 
      "score": 0.24627180397510529, 
      "sent": "But, as Ioan Grillo observes in his recent book, \"El Narco,\" \"In the drug business, it seems, a war economy functions perfectly well.\""
    }, 
    {
      "index": 372, 
      "score": 0.24613845348358154, 
      "sent": "Earlier this month, five weeks after Guzman's apprehension, two new drug tunnels were discovered in Sinaloa territory, starting in Tijuana and emerging in the industrial outskirts of San Diego."
    }, 
    {
      "index": 358, 
      "score": 0.24559873342514038, 
      "sent": "At eleven-forty-two that morning, Pena Nieto announced the capture on Twitter: \"I acknowledge the work of the security agencies of the Mexican state in pulling off the apprehension of Joaquin Guzman Loera in Mazatlan.\""
    }, 
    {
      "index": 293, 
      "score": 0.24526911973953247, 
      "sent": "What had started as a covert operation became overt as Mexican forces attempted to heighten the pressure on Chapo."
    }, 
    {
      "index": 72, 
      "score": 0.24512763321399689, 
      "sent": "The targets were Tijuana-based traffickers whom Guzman was challenging for control of the lucrative smuggling routes through Baja California."
    }, 
    {
      "index": 378, 
      "score": 0.24478358030319214, 
      "sent": "Yet, almost as soon as Pena Nieto's government took Guzman into custody, questions arose about its ability to hold him."
    }, 
    {
      "index": 390, 
      "score": 0.24465224146842957, 
      "sent": "If this figure includes not just individuals he murdered personally but people he authorized subordinates to kill, it is surely a gross underestimate."
    }, 
    {
      "index": 307, 
      "score": 0.24464714527130127, 
      "sent": "But it would be folly to move from one major population center to another, and, judging from Guzman's past behavior, he was probably already back in the Sierra Madre."
    }, 
    {
      "index": 324, 
      "score": 0.2442023903131485, 
      "sent": "Guzman's decision to jettison his huge security force had allowed him to move around quickly and inconspicuously, but he was left essentially defenseless."
    }, 
    {
      "index": 282, 
      "score": 0.24409452080726624, 
      "sent": "It was especially surprising, then, when Pena Nieto's administration began capturing or killing some of the country's most brutal drug kingpins, often in close collaboration with the U.S. Last July, the authorities arrested Miguel Angel Trevino Morales, one of the leaders of the Zetas, who sometimes burned his victims alive."
    }, 
    {
      "index": 311, 
      "score": 0.24401824176311493, 
      "sent": "Mazatlan is a resort town popular with retirees from the U.S. and Canada."
    }, 
    {
      "index": 439, 
      "score": 0.24361562728881836, 
      "sent": "\"We don't have a drug problem--we have a crime problem,\" more than one Mexican official told me, and, as the criminal syndicates continue to evolve, this dynamic could end up rendering organizations like Guzman's obsolete."
    }, 
    {
      "index": 362, 
      "score": 0.24358716607093811, 
      "sent": "Guzman's family chimed in, with barely suppressed glee, that the young man in custody was not Alfredo."
    }, 
    {
      "index": 244, 
      "score": 0.24339170753955841, 
      "sent": "When the marines began breaking into the house on Rio Humaya Street, Guzman was inside, as was a bodyguard."
    }, 
    {
      "index": 270, 
      "score": 0.2432175874710083, 
      "sent": "The carnage might have been somewhat redeemed had Calderon succeeded in curtailing the narcotraficantes."
    }, 
    {
      "index": 361, 
      "score": 0.2426968514919281, 
      "sent": "A lawyer representing the man then revealed that he was not Guzman's son but a local car dealer named Felix Beltran."
    }, 
    {
      "index": 197, 
      "score": 0.24245597422122955, 
      "sent": "Because cartel members frequently shed phones, a single device can offer an intelligence windfall if it contains current numbers for other members of the organization."
    }, 
    {
      "index": 396, 
      "score": 0.24215333163738251, 
      "sent": "Last summer, an old friend of Guzman's, Rafael Caro Quintero, was released in the middle of the night from the prison where he had been serving a forty-year sentence for murdering a D.E.A."
    }, 
    {
      "index": 470, 
      "score": 0.24082541465759277, 
      "sent": "Her uncle Ignacio (Nacho) Coronel was one of Chapo's closest associates at the time, and when the cartel boss conveyed his interest she may have had little choice but to indulge it."
    }, 
    {
      "index": 275, 
      "score": 0.24081993103027344, 
      "sent": "He pledged to focus not on attacking the cartels but on reducing the killing--though his plan for achieving this met with skepticism."
    }, 
    {
      "index": 360, 
      "score": 0.24033223092556, 
      "sent": "In the summer of 2012, Mexican authorities announced that they had captured Guzman's son Alfredo, and held a press conference in which they paraded before the cameras a sullen, pudgy young man in a red polo shirt."
    }, 
    {
      "index": 185, 
      "score": 0.23997345566749573, 
      "sent": "They were veterans of a 2009 firefight that had killed a former associate of Guzman's, Arturo Beltran Leyva, during a raid in Cuernavaca."
    }, 
    {
      "index": 283, 
      "score": 0.23968894779682159, 
      "sent": "The next month, military operatives apprehended the leader of the Gulf cartel--El Pelon, or Baldy--who was known for blindfolding his enemies and torturing them to death."
    }, 
    {
      "index": 13, 
      "score": 0.23966564238071442, 
      "sent": "Obsessively secretive, he ran his multibillion-dollar drug enterprise from hiding in Sinaloa, the remote western state where he was born, and from which the cartel takes its name."
    }, 
    {
      "index": 107, 
      "score": 0.2394445389509201, 
      "sent": "In one video, the bodyguard played a recorded conversation in which the Governor appeared to instruct his subordinates not to antagonize the Sinaloa cartel--and, instead, to crack down on its rivals."
    }, 
    {
      "index": 414, 
      "score": 0.2393127828836441, 
      "sent": "One curious feature of Guzman's capture was the fact that he was betrayed, in rapid succession, by at least two of his closest aides: Nariz and Picudo."
    }, 
    {
      "index": 438, 
      "score": 0.23906077444553375, 
      "sent": "Organizations that once concentrated exclusively on drugs now extract rents from Mexico's oil industry and export stolen iron ore to China; the price of limes in U.S. grocery stores has doubled in the past few years because the cartels are taxing Mexico's citrus farmers."
    }, 
    {
      "index": 387, 
      "score": 0.23883894085884094, 
      "sent": "The U.S. has a history of \"reaching deals with criminals,\" Karam noted."
    }, 
    {
      "index": 186, 
      "score": 0.2387145608663559, 
      "sent": "One of the marines in the unit, a young officer from Tabasco named Melquisedet Angulo Cordova, was killed in the shoot-out."
    }, 
    {
      "index": 22, 
      "score": 0.23870855569839478, 
      "sent": "The Army mobilized several Bell helicopters to crash the party; the troops arrived, guns drawn, to discover that Guzman had just departed."
    }, 
    {
      "index": 16, 
      "score": 0.23822726309299469, 
      "sent": "Mexican politicians promised to bring him to justice, and the U.S. offered a five-million-dollar reward for information leading to his capture."
    }, 
    {
      "index": 238, 
      "score": 0.23813104629516602, 
      "sent": "So he had Corona-Verbera devise a series of clavos, or stashes--secret compartments under the beds in his homes."
    }, 
    {
      "index": 25, 
      "score": 0.23798102140426636, 
      "sent": "In Washington, concerns about the competence of Mexican forces mingled with deeper fears about corruption."
    }, 
    {
      "index": 46, 
      "score": 0.23797264695167542, 
      "sent": "At the D.E.A., which taps hundreds of phone lines and e-mail accounts associated with traffickers, the process of applying pressure to a criminal organization and then monitoring furtive attempts at outreach is known as \"tickling the wires.\""
    }, 
    {
      "index": 427, 
      "score": 0.23797009885311127, 
      "sent": "But the Mexican armed forces have been implicated before in the use of torture as an interrogation technique in the pursuit of drug traffickers."
    }, 
    {
      "index": 47, 
      "score": 0.2378842681646347, 
      "sent": "When El Chino Antrax was arrested in Amsterdam, the cartel was still coping with two other high-level losses: in November, the twenty-three-year-old son of one of Guzman's closest associates was arrested while trying to cross the border in Nogales; in December, Mexican troops in a helicopter shot and killed another key cartel enforcer, on a stretch of highway by the Sea of Cortez."
    }, 
    {
      "index": 342, 
      "score": 0.23703376948833466, 
      "sent": "\"They notoriously kill everybody in the room when there is the slightest provocation,\" an American law-enforcement official who has worked with SEMAR told me."
    }, 
    {
      "index": 143, 
      "score": 0.23664630949497223, 
      "sent": "But the BlackBerry is made by a Canadian company, and Guzman felt more comfortable using one."
    }, 
    {
      "index": 20, 
      "score": 0.23651608824729919, 
      "sent": "In 2004, the Mexican Army descended on a dusty ranch in Sinaloa where he was holed up, but he had advance warning and fled along a rutted mountain track in an all-terrain vehicle."
    }, 
    {
      "index": 30, 
      "score": 0.23612450063228607, 
      "sent": "In dozens of narcocorridos, the heraldic Mexican ballads that glorify traffickers, singers portrayed Guzman as a country boy turned cunning bandit who had grown rich but not soft, his cuerno de chivo, or \"goat horn\"--Mexican slang for an assault rifle with a curved magazine--never far from his side."
    }, 
    {
      "index": 122, 
      "score": 0.2359238862991333, 
      "sent": "Many young men enter the industry expecting to enjoy a decadent life for a short time before being incarcerated or killed."
    }, 
    {
      "index": 11, 
      "score": 0.23567752540111542, 
      "sent": "Arechiga was a narcotraficante of the digital age, bantering with other criminals on Twitter and posting snapshots of himself guzzling Cristal, posing with exotic pets, and fondling a gold-plated AK-47."
    }, 
    {
      "index": 391, 
      "score": 0.23549069464206696, 
      "sent": "Nobody knows exactly how many people have been killed in Mexico's drug wars over the past decade, but between the dead and the disappeared the number likely exceeds eighty thousand."
    }, 
    {
      "index": 416, 
      "score": 0.23549063503742218, 
      "sent": "I was impressed, initially, by the speed with which the marines had elicited leads from these subordinates, both of them ex-members of Mexico's special forces who had been hardened by years in the cartel."
    }, 
    {
      "index": 248, 
      "score": 0.23529815673828125, 
      "sent": "The caulk had camouflaged the escape hatch; even the bodyguard might have been unaware of its existence before Guzman turned on the hydraulic lift."
    }, 
    {
      "index": 106, 
      "score": 0.23493562638759613, 
      "sent": "Last year, a former bodyguard for the current governor of Sinaloa, Mario Lopez Valdez, released a series of YouTube videos in which he described accompanying Lopez Valdez, who had just taken office, on a trip to meet with Guzman."
    }, 
    {
      "index": 258, 
      "score": 0.23468466103076935, 
      "sent": "Meanwhile, Chapo ran through the sewers, like Harry Lime in \"The Third Man.\""
    }, 
    {
      "index": 96, 
      "score": 0.23468318581581116, 
      "sent": "There had always been some sympathy for the drug trade in Sinaloa, but nothing deepens sympathy like charity and bribes."
    }, 
    {
      "index": 166, 
      "score": 0.23449477553367615, 
      "sent": "In the past, he had occasionally restricted his contact with others in the cartel by relaying his commands through a proxy."
    }, 
    {
      "index": 446, 
      "score": 0.23441818356513977, 
      "sent": "Hernandez argued that Guzman's influence was so pervasive, and the Mexican political system so thoroughly rotted by graft, that the whole Chapo saga could be interpreted as a grand charade."
    }, 
    {
      "index": 359, 
      "score": 0.23412324488162994, 
      "sent": "U.S. officials had already leaked the news to the Associated Press, but Pena Nieto wanted to be certain that his troops had the right man."
    }, 
    {
      "index": 87, 
      "score": 0.23381611704826355, 
      "sent": "Guzman controlled Puente Grande so thoroughly by the time of his exit that he might as well have walked out the front door."
    }, 
    {
      "index": 300, 
      "score": 0.2335437685251236, 
      "sent": "The marines knew who Condor was, and raided his house in Culiacan."
    }, 
    {
      "index": 172, 
      "score": 0.23353463411331177, 
      "sent": "Upon receiving the message, the lieutenant would transcribe it onto an iPad, so that he could forward the text using WiFi--avoiding the cellular networks that the cartel knew the authorities were trolling."
    }, 
    {
      "index": 376, 
      "score": 0.23316705226898193, 
      "sent": "Even so, the arrest signified a powerful reassertion of the rule of law in Mexico."
    }, 
    {
      "index": 189, 
      "score": 0.23276042938232422, 
      "sent": "The warning could not have been clearer, yet, according to people who know the SEMAR unit, the marines grew more determined to bring down the traffickers."
    }, 
    {
      "index": 142, 
      "score": 0.23270389437675476, 
      "sent": "Like many narcos, he was suspicious of satellite phones, because most of the companies that manufacture them are American and the devices are relatively easy for law-enforcement officials to compromise."
    }, 
    {
      "index": 299, 
      "score": 0.23261608183383942, 
      "sent": "According to Picudo, the bodyguard Guzman was travelling with was his most trusted employee: Carlos Hoo Ramirez, who was called El Condor."
    }, 
    {
      "index": 127, 
      "score": 0.23259212076663971, 
      "sent": "\"Here's a guy who has made hundreds of millions of dollars in the drug trade, and he's living like a pauper up in the mountains,\" Mike Vigil, a former D.E.A."
    }, 
    {
      "index": 278, 
      "score": 0.23234893381595612, 
      "sent": "Calderon had come closer to tolerating such a scenario than any previous Mexican head of state had."
    }, 
    {
      "index": 49, 
      "score": 0.23231223225593567, 
      "sent": "They learned that Guzman would soon be coming to Culiacan, the state capital of Sinaloa, for a meeting with his sons Alfredo and Ivan--ascendant traffickers who were both close friends of El Chino Antrax."
    }, 
    {
      "index": 394, 
      "score": 0.23226228356361389, 
      "sent": "Given this record, it makes intuitive sense that Guzman should answer for his crimes where the worst of them were committed."
    }, 
    {
      "index": 28, 
      "score": 0.23215995728969574, 
      "sent": "After a series of near-misses in which Chapo foiled his pursuers by sneaking out of buildings through back doors, officials at the U.S. Embassy in Mexico City took to joking, bitterly, that there is no word in Spanish for \"surround.\""
    }, 
    {
      "index": 67, 
      "score": 0.23206590116024017, 
      "sent": "Guzman left school for good in third grade, and in the seventies, in spite of his illiteracy, he became an apprentice to two drug chieftains: Amado Carrillo Fuentes, who owned a fleet of airplanes and was known as the Lord of the Skies; and Miguel Angel Felix Gallardo, a police officer turned drug baron, who ran the Guadalajara cartel and was known as El Padrino--the Godfather."
    }, 
    {
      "index": 261, 
      "score": 0.23172599077224731, 
      "sent": "Eventually, the marines emerged at a storm drain by the banks of a muddy river, more than a mile from the point where Guzman had entered the tunnel."
    }, 
    {
      "index": 315, 
      "score": 0.2316056489944458, 
      "sent": "The marshals, who specialize in locating fugitives, had been able to trace the signal on Condor's BlackBerry to the Hotel Miramar, a white, twelve-story condominium building with three columns of half-moon balconies overlooking the Pacific."
    }, 
    {
      "index": 403, 
      "score": 0.23114632070064545, 
      "sent": "\"Once bitten, twice shy,\" Ambassador Mora told me, maintaining there was no possibility that his country would risk the political embarrassment of allowing its most notorious convict to escape a second time."
    }, 
    {
      "index": 389, 
      "score": 0.23095725476741791, 
      "sent": "In a story that aired on the Televisa network, the Mexican journalist Carlos Loret de Mola reported that, during the flight from Mazatlan to Mexico City, Guzman told the marines that he had killed between two and three thousand people."
    }, 
    {
      "index": 112, 
      "score": 0.23094688355922699, 
      "sent": "In 2009, Dennis Blair, President Barack Obama's national intelligence director, met with Guillermo Galvan, who was then Mexico's Secretary of Defense."
    }, 
    {
      "index": 237, 
      "score": 0.2309219092130661, 
      "sent": "By this point, Guzman was making so much money that he needed secure locations in which to hide it, along with his drugs and his weapons."
    }, 
    {
      "index": 405, 
      "score": 0.23080383241176605, 
      "sent": "According to the U.S. Treasury Department, Caro Quintero continued to operate his drug business during his years in prison, much as Guzman did while he was at Puente Grande."
    }, 
    {
      "index": 176, 
      "score": 0.23069766163825989, 
      "sent": "Many members of the cartel did not realize that when they wrote to the boss and received an answer, every word had been transmitted via two intermediaries."
    }, 
    {
      "index": 217, 
      "score": 0.23048022389411926, 
      "sent": "Under questioning by the marines, Nariz admitted that Guzman was hiding in the city, and gave the address."
    }, 
    {
      "index": 23, 
      "score": 0.23047783970832825, 
      "sent": "American authorities have no jurisdiction to make arrests in Mexico, so whenever D.E.A."
    }, 
    {
      "index": 401, 
      "score": 0.23046228289604187, 
      "sent": "The prospect of a similar dead-of-night release for Chapo may not be far-fetched."
    }, 
    {
      "index": 174, 
      "score": 0.23022851347923279, 
      "sent": "Although Guzman continued to use a BlackBerry, it was almost impossible to track, because it communicated with only one other device."
    }, 
    {
      "index": 29, 
      "score": 0.22993120551109314, 
      "sent": "Guzman developed \"a Zorro-like reputation,\" Gil Gonzalez, who pursued him in Mexico for the D.E.A., told me."
    }, 
    {
      "index": 92, 
      "score": 0.22923068702220917, 
      "sent": "Today on the streets of Culiacan you see night clubs, fortified villas, and an occasional Lamborghini."
    }, 
    {
      "index": 257, 
      "score": 0.22880454361438751, 
      "sent": "In the sky, a covert U.S. drone looked down on the city, poised to track the fugitive if he emerged from a manhole and fled through the streets."
    }, 
    {
      "index": 317, 
      "score": 0.22860816121101379, 
      "sent": "So, in the early hours of Saturday morning, the marines fanned out, forming a perimeter around the property."
    }, 
    {
      "index": 65, 
      "score": 0.22848215699195862, 
      "sent": "Born in the mountain village of La Tuna, in Mexico's wild and craggy Sierra Madre Occidental, he was the oldest child of a subsistence farmer who dabbled in the drug trade."
    }, 
    {
      "index": 7, 
      "score": 0.22845001518726349, 
      "sent": "The U.S. Drug Enforcement Administration had filed a Red Notice with Interpol--an international arrest warrant--and knew that he was coming."
    }, 
    {
      "index": 319, 
      "score": 0.22812046110630035, 
      "sent": "A team of marines climbed to the sixth floor and burst into one of the apartments, where they discovered two groggy tourists, who were recovering from an evening of partying."
    }, 
    {
      "index": 154, 
      "score": 0.22809714078903198, 
      "sent": "After authorities traced the BlackBerry signal to a mansion on a cul-de-sac in a wealthy enclave near the coast, Mexican troops burst through the front door of the building."
    }, 
    {
      "index": 234, 
      "score": 0.22794416546821594, 
      "sent": "Today, tunnels that traverse the U.S.-Mexico border are a mainstay of drug smuggling: up to a mile long, they often feature air-conditioning, electricity, sophisticated drainage systems, and tracks, so that heavy loads of contraband can be transported on carts."
    }, 
    {
      "index": 5, 
      "score": 0.22789463400840759, 
      "sent": "His passport was an expensive fake, and he had used it successfully many times."
    }, 
    {
      "index": 456, 
      "score": 0.22770829498767853, 
      "sent": "She is not convinced that the man who was photographed in Mazatlan, and whose DNA was tested, is the real Chapo."
    }, 
    {
      "index": 239, 
      "score": 0.22745032608509064, 
      "sent": "Inevitably, a bolder idea presented itself: if you could dig a clavo beneath a house near the U.S. border, why not continue digging and come out on the other side?"
    }, 
    {
      "index": 194, 
      "score": 0.22743310034275055, 
      "sent": "Several days before an operation, the commandos were obliged to surrender their cell phones, to protect against leaks."
    }, 
    {
      "index": 203, 
      "score": 0.22734779119491577, 
      "sent": "Now that Guzman was spending more time in urban areas, his entourage had become very small."
    }, 
    {
      "index": 379, 
      "score": 0.22717323899269104, 
      "sent": "According to a memo sent to Attorney General Eric Holder a few hours after the Mazatlan raid, Guzman is the subject of indictments in Arizona, California, Texas, Illinois, New York, Florida, and New Hampshire."
    }, 
    {
      "index": 39, 
      "score": 0.22709432244300842, 
      "sent": "But traffickers at the top of the hierarchy maintain operational security by rarely making calls or sending e-mails."
    }, 
    {
      "index": 82, 
      "score": 0.22707907855510712, 
      "sent": "While he was there, the Mexican attorney general's office subjected him to psychological interviews."
    }, 
    {
      "index": 105, 
      "score": 0.22699245810508728, 
      "sent": "Guzman's influence over the public sector was not confined to law enforcement."
    }, 
    {
      "index": 6, 
      "score": 0.22641229629516602, 
      "sent": "But, moments after he presented his documents to Dutch customs, he was arrested."
    }, 
    {
      "index": 193, 
      "score": 0.22624942660331726, 
      "sent": "Apart from the admiral who commanded them and a few senior personnel, none of them knew where they were headed or who their target might be until they boarded a Blackhawk to undertake the mission."
    }, 
    {
      "index": 191, 
      "score": 0.2261970192193985, 
      "sent": "Whenever they were photographed in public, they followed the custom of other elite security forces in Mexico and wore black masks over their faces."
    }, 
    {
      "index": 70, 
      "score": 0.22618705034255981, 
      "sent": "One night in November, 1992, Guzman's henchmen massacred six people at a crowded discotheque in Puerto Vallarta."
    }, 
    {
      "index": 78, 
      "score": 0.22606411576271057, 
      "sent": "Ocampo's murder caused a political uproar, and it was not long before Guzman, who had gone into hiding, was picked up by authorities in Guatemala and turned over to Mexico."
    }, 
    {
      "index": 58, 
      "score": 0.22604067623615265, 
      "sent": "(Eduardo Sanchez, the chief spokesman for the government of Mexico, denied that any such time limit was in place."
    }, 
    {
      "index": 384, 
      "score": 0.22603058815002441, 
      "sent": "But Mexico's attorney general, Jesus Murillo Karam, was quick to object."
    }, 
    {
      "index": 169, 
      "score": 0.22592073678970337, 
      "sent": "If you needed to communicate with the boss, you could reach him via B.B.M., BlackBerry's instant-messaging application."
    }, 
    {
      "index": 216, 
      "score": 0.22526052594184875, 
      "sent": "Nariz returned to his own house in Culiacan, and discovered that the commandos from SEMAR had been waiting for him."
    }, 
    {
      "index": 202, 
      "score": 0.22508427500724792, 
      "sent": "Within the cartel, he was known as El Nariz--the Nose."
    }, 
    {
      "index": 182, 
      "score": 0.22496034204959869, 
      "sent": "Unlike the Mexican Army--which tended to move slowly, and always informed state authorities before conducting an operation, even when those authorities were corrupt--the marines were nimble and secretive."
    }, 
    {
      "index": 426, 
      "score": 0.22469918429851532, 
      "sent": "Eduardo Sanchez, the spokesman for the Mexican government, denied the allegation, and maintained that, in this and other operations, \"federal officials, agents, and officers perform their duties strictly within the applicable legal framework and with utmost respect for human rights.\""
    }, 
    {
      "index": 440, 
      "score": 0.22456616163253784, 
      "sent": "The prohibition of narcotics may have created a monster, but, as Alejandro Hope pointed out, even if you decriminalized all drugs tomorrow the monster would find a way to survive."
    }, 
    {
      "index": 123, 
      "score": 0.22436963021755219, 
      "sent": "Young narcos behave recklessly: they go to night clubs, they race Bentleys, and they post pictures of themselves online with their co-conspirators (and with the occasional dead body)."
    }, 
    {
      "index": 274, 
      "score": 0.22424463927745819, 
      "sent": "Mexican voters who went to the polls in 2012 were weary of the violence; Pena Nieto, a youthful-looking former governor who represented the Partido Revolucionario Institucional, or PRI, which had dominated Mexican politics for much of the past century, promised a fresh start."
    }, 
    {
      "index": 447, 
      "score": 0.2242264598608017, 
      "sent": "Guzman was \"imprisoned\" at Puente Grande, but he was actually running the place."
    }, 
    {
      "index": 66, 
      "score": 0.22410157322883606, 
      "sent": "For generations, Sinaloan ranchers had cultivated cannabis and opium, and children were taken out of elementary school to assist in the harvest."
    }, 
    {
      "index": 381, 
      "score": 0.22383268177509308, 
      "sent": "A federal prosecutor in New York declared that Guzman should be tried in New York."
    }, 
    {
      "index": 295, 
      "score": 0.2238306850194931, 
      "sent": "Soon after the escape in the tunnel, the marines arrested Manuel Lopez Osorio, another former special-forces officer who had joined Guzman's inner circle; he went by the name El Picudo (Pointy Nose)."
    }, 
    {
      "index": 156, 
      "score": 0.22378835082054138, 
      "sent": "Over the next three days, the authorities pursued him as he moved around the city, desperately trying to arrange an escape route to the mountains."
    }, 
    {
      "index": 451, 
      "score": 0.223504438996315, 
      "sent": "Hernandez's book sold more than a hundred thousand copies in Mexico--her taste for conspiracy and her tone of bitter knowingness struck a chord."
    }, 
    {
      "index": 212, 
      "score": 0.22334405779838562, 
      "sent": "Guzman also liked takeout food, and, on the night of February 16th, he sent Nariz out to pick up an order."
    }, 
    {
      "index": 43, 
      "score": 0.2231581062078476, 
      "sent": "The Sinaloa cartel is sometimes described as a \"cellular\" organization."
    }, 
    {
      "index": 351, 
      "score": 0.22287178039550781, 
      "sent": "As the marines frog-marched him out of a hangar at the airport, journalists photographed him looking furtively at his captors."
    }, 
    {
      "index": 298, 
      "score": 0.22283539175987244, 
      "sent": "He had driven them south of the city, where they met up with another aide and switched vehicles."
    }, 
    {
      "index": 68, 
      "score": 0.22282907366752625, 
      "sent": "Guzman started as a kind of air-traffic controller, coordinating cocaine flights from Colombia."
    }, 
    {
      "index": 79, 
      "score": 0.22269067168235779, 
      "sent": "He was sentenced to twenty years in prison, on charges of conspiracy, drug trafficking, and bribery, and ended up in Puente Grande, in Jalisco, which was considered one of the most secure prisons in Mexico."
    }, 
    {
      "index": 180, 
      "score": 0.22267851233482361, 
      "sent": "They resolved to focus on the small ring of logistical facilitators surrounding Guzman, to identify the mirrors that he was using, and, ultimately, to target their communications."
    }, 
    {
      "index": 121, 
      "score": 0.22264258563518524, 
      "sent": "There is a saying in the Mexican drug trade that it is better to live one good year than ten bad ones."
    }, 
    {
      "index": 97, 
      "score": 0.222579225897789, 
      "sent": "Eduardo Medina Mora, Mexico's Ambassador in Washington, described Guzman's largesse in the state: \"You are financing everything."
    }, 
    {
      "index": 146, 
      "score": 0.22226892411708832, 
      "sent": "That February, the agency confirmed that Guzman had travelled to Los Cabos for a liaison with a prostitute."
    }, 
    {
      "index": 341, 
      "score": 0.22219491004943848, 
      "sent": "But SEMAR had developed a reputation as an outfit that shoots first and asks questions later."
    }, 
    {
      "index": 184, 
      "score": 0.22174228727817535, 
      "sent": "The marines pursuing Guzman had seen intense combat in recent years, battling the Zetas cartel in northeast Mexico."
    }, 
    {
      "index": 253, 
      "score": 0.22167684137821198, 
      "sent": "By the time the SEMAR commandos entered the tunnel, Guzman had been running for more than ten minutes."
    }, 
    {
      "index": 52, 
      "score": 0.22163519263267517, 
      "sent": "The marines, who are the Mexican equivalent of Navy SEALs, were joined by a small group of American advisers."
    }, 
    {
      "index": 457, 
      "score": 0.22092464566230774, 
      "sent": "When Guzman was questioned in prison by authorities, he, too, seemed to suggest a case of mistaken identity."
    }, 
    {
      "index": 208, 
      "score": 0.22048644721508026, 
      "sent": "He is said to have feared poisoning, and sometimes made his underlings taste food before he would eat it."
    }, 
    {
      "index": 368, 
      "score": 0.22012010216712952, 
      "sent": "Nobody had any illusions that the arrest would slow down the drug trade."
    }, 
    {
      "index": 287, 
      "score": 0.22009289264678955, 
      "sent": "After the marines emerged from the sewers without capturing him, they discovered that the house on Rio Humaya Street was connected not just to Culiacan's sewer system but, through the sewers, to six other houses, each similarly furnished and appointed, and each with its own bathtub escape hatch."
    }, 
    {
      "index": 145, 
      "score": 0.22000801563262939, 
      "sent": "had homed in on Guzman's BlackBerry, and could not only monitor his communications but also use geolocation technology to triangulate his signal."
    }, 
    {
      "index": 433, 
      "score": 0.21973180770874023, 
      "sent": "\"The drug trade is one of the few really meritocratic sectors in the Mexican economy,\" Alejandro Hope said."
    }, 
    {
      "index": 88, 
      "score": 0.21948519349098206, 
      "sent": "Criminal charges were eventually brought against seventy-one people who worked at the prison, including the warden."
    }, 
    {
      "index": 353, 
      "score": 0.21858815848827362, 
      "sent": "The marines also noticed bruises and cuts on his feet, and learned that when he fled the house on Rio Humaya Street he didn't have time to grab his shoes; he had run through the tunnels barefoot."
    }, 
    {
      "index": 246, 
      "score": 0.21835646033287048, 
      "sent": "Chapo activated the escape hatch by pushing a plug into an electrical outlet by the sink while flicking a hidden switch on the side of the vanity mirror."
    }, 
    {
      "index": 12, 
      "score": 0.21823641657829285, 
      "sent": "Guzman, who is fifty-seven, typified an older generation."
    }, 
    {
      "index": 243, 
      "score": 0.21803146600723267, 
      "sent": "Since then, U.S. intelligence has attributed no fewer than ninety border tunnels to the Sinaloa cartel."
    }, 
    {
      "index": 34, 
      "score": 0.21792544424533844, 
      "sent": "Chapo escaped eight years later, and had been on the run ever since."
    }, 
    {
      "index": 399, 
      "score": 0.21769990026950836, 
      "sent": "The U.S. Justice Department furiously objected that Caro Quintero still faced charges in America and declared that the Mexicans should extradite him."
    }, 
    {
      "index": 161, 
      "score": 0.21760882437229156, 
      "sent": "While they were occupied with arresting him, Chapo made it into the desert, where a private plane picked him up and flew him back to the safety of the Sierra Madre."
    }, 
    {
      "index": 225, 
      "score": 0.21620582044124603, 
      "sent": "But the door was custom-made: inside the steel skin, it was filled with water, so that if anyone tried to break it down the heat from the impact would not spread."
    }, 
    {
      "index": 442, 
      "score": 0.21620436012744904, 
      "sent": "Some speculate that Guzman wasn't really captured against his will: seeing that his time had come, he chose to enjoy a quiet retirement behind bars."
    }, 
    {
      "index": 56, 
      "score": 0.21516537666320801, 
      "sent": "A U.S. official involved in planning the operation told me that this was true."
    }, 
    {
      "index": 466, 
      "score": 0.21500867605209351, 
      "sent": "In a poll of Mexicans conducted after the arrest, half the respondents said that Guzman was more powerful than the government of Mexico; in Culiacan, in the days after his capture, hundreds of protesters took to the streets, holding signs demanding his release."
    }, 
    {
      "index": 206, 
      "score": 0.21488504111766815, 
      "sent": "He rotated from house to house and seldom told those around him--even Nariz--where his next destination was, until they were en route."
    }, 
    {
      "index": 19, 
      "score": 0.21483312547206879, 
      "sent": "On several occasions, authorities had come close to catching Guzman."
    }, 
    {
      "index": 83, 
      "score": 0.21441110968589783, 
      "sent": "The resulting criminal profile noted that he was \"egocentric, narcissistic, shrewd, persistent, tenacious, meticulous, discriminating, and secretive.\""
    }, 
    {
      "index": 467, 
      "score": 0.2139606773853302, 
      "sent": "Guzman's wife, Emma Coronel, was born in California, and she retains U.S. citizenship."
    }, 
    {
      "index": 279, 
      "score": 0.21383725106716156, 
      "sent": "But Pena Nieto indicated that he preferred to maintain greater distance."
    }, 
    {
      "index": 157, 
      "score": 0.2134283035993576, 
      "sent": "At one point during the chase, Guzman must have realized that his BlackBerry had been compromised, and decided to turn this setback to his advantage."
    }, 
    {
      "index": 69, 
      "score": 0.21331095695495605, 
      "sent": "But he was clever and aggressive, and quickly began to acquire power."
    }, 
    {
      "index": 199, 
      "score": 0.21311904489994049, 
      "sent": "Using information extracted from the phones collected in the arrest, the marines and the D.E.A."
    }, 
    {
      "index": 222, 
      "score": 0.21293105185031891, 
      "sent": "A wooden door would have splintered off its hinges, but this door was a marvel of reinforced steel--some of the marines later likened it to an airlock on a submarine."
    }, 
    {
      "index": 329, 
      "score": 0.21279411017894745, 
      "sent": "The marines raced to the master bedroom in the back, where they discovered Emma Coronel, who had been sleeping."
    }, 
    {
      "index": 86, 
      "score": 0.2127888947725296, 
      "sent": "But many in Mexico speculate that he didn't have to bother with subterfuge."
    }, 
    {
      "index": 263, 
      "score": 0.21188154816627502, 
      "sent": "Two days later, on February 19th, President Obama, who was visiting Mexico City, held a press conference with President Pena Nieto."
    }, 
    {
      "index": 294, 
      "score": 0.2115819901227951, 
      "sent": "Eduardo Sanchez, the government spokesman, told me that authorities established conspicuous roadblocks \"so that Mr. Guzman could feel that we were after him.\""
    }, 
    {
      "index": 26, 
      "score": 0.21125137805938721, 
      "sent": "A former senior Mexican intelligence official told me that the cartel has \"penetrated most Mexican agencies.\""
    }, 
    {
      "index": 196, 
      "score": 0.21081137657165527, 
      "sent": "The marines confiscated the men's phones and sent them off for analysis."
    }, 
    {
      "index": 318, 
      "score": 0.21066072583198547, 
      "sent": "Someone consulted the registry and discovered that two apartments had been rented the previous day."
    }, 
    {
      "index": 33, 
      "score": 0.21059590578079224, 
      "sent": "A famous series taken after an arrest in 1993 shows a stocky, dark-eyed, square-jawed young man standing awkwardly in a prison yard; he gazes at the camera with a shyness that seems at odds with his fearsome reputation."
    }, 
    {
      "index": 63, 
      "score": 0.21026766300201416, 
      "sent": "One person involved in the operation told me, \"As soon as we landed, he knew.\""
    }, 
    {
      "index": 80, 
      "score": 0.21014377474784851, 
      "sent": "Behind bars, Guzman consolidated both his empire and his reputation."
    }, 
    {
      "index": 468, 
      "score": 0.20999898016452789, 
      "sent": "After the raid in Mazatlan, the authorities let her go, along with her daughters, and she has since disappeared from public view."
    }, 
    {
      "index": 205, 
      "score": 0.20984740555286407, 
      "sent": "In Culiacan, Guzman rarely spent consecutive nights in the same bed."
    }, 
    {
      "index": 256, 
      "score": 0.20980525016784668, 
      "sent": "In the streets of Culiacan, meanwhile, dozens of troops were in position, ready to pursue Guzman when he returned above ground."
    }, 
    {
      "index": 327, 
      "score": 0.20975370705127716, 
      "sent": "In one bedroom, the marines found two women: the chef and a nanny, who had been sleeping with Guzman's two-year-old twins, Mali and Maria Joaquina."
    }, 
    {
      "index": 207, 
      "score": 0.20943786203861237, 
      "sent": "Guzman had a personal chef, an attractive young woman who accompanied him everywhere he travelled."
    }, 
    {
      "index": 119, 
      "score": 0.20940515398979187, 
      "sent": "More recently, however, intelligence collected by Mexican authorities and the D.E.A."
    }, 
    {
      "index": 339, 
      "score": 0.20930059254169464, 
      "sent": "It had been a stunningly swift operation: less than three minutes after the marines stormed the apartment, Guzman surrendered."
    }, 
    {
      "index": 259, 
      "score": 0.20916657149791718, 
      "sent": "The tunnel forked, and at one juncture the marines were momentarily flummoxed, unable to tell which path he had taken."
    }, 
    {
      "index": 429, 
      "score": 0.2088875025510788, 
      "sent": "The broad employment of brutal techniques, coupled with the high profile and the urgency of the hunt for Guzman, makes it seem all the more plausible that Mexican authorities used unsavory, and illegal, means to pursue him."
    }, 
    {
      "index": 226, 
      "score": 0.2088731974363327, 
      "sent": "The marines hammered the door again and again, until the ram buckled and had to be replaced."
    }, 
    {
      "index": 167, 
      "score": 0.20886494219303131, 
      "sent": "For a time, a woman known as La Voz (the Voice) served as his gatekeeper, sending and receiving messages on his behalf."
    }, 
    {
      "index": 126, 
      "score": 0.20818817615509033, 
      "sent": "But because he was tired, or married to a much younger woman, or overconfident of his ability to escape, Guzman began spending time in Culiacan and other cities."
    }, 
    {
      "index": 35, 
      "score": 0.20815476775169373, 
      "sent": "Because he might have had plastic surgery to alter his appearance, the authorities could no longer be sure what he looked like."
    }, 
    {
      "index": 453, 
      "score": 0.20810289680957794, 
      "sent": "When I reached Hernandez and asked her what she made of the arrest, she challenged the premise of my question."
    }, 
    {
      "index": 251, 
      "score": 0.20808359980583191, 
      "sent": "They reached a small portal resembling the door of a bank safe, where the tunnel they were in connected to the main sewer system of Culiacan; crawling through this opening, they entered a cylindrical tunnel."
    }, 
    {
      "index": 444, 
      "score": 0.20788238942623138, 
      "sent": "Several years ago, a fearless journalist named Anabel Hernandez published a book about the Sinaloa cartel, called \"Los Senores del Narco.\""
    }, 
    {
      "index": 431, 
      "score": 0.2076147198677063, 
      "sent": "Chapo's top associates, Ismael Zambada and Juan Jose Esparragoza, are both older than he is, and seem unlikely to assume day-to-day management."
    }, 
    {
      "index": 345, 
      "score": 0.20756199955940247, 
      "sent": "But when they took him into custody they discovered that he looked much as he had in the earlier photographs."
    }, 
    {
      "index": 336, 
      "score": 0.20731070637702942, 
      "sent": "The standoff lasted only a few seconds, with the marines bellowing and Coronel screaming."
    }, 
    {
      "index": 147, 
      "score": 0.20683147013187408, 
      "sent": "He had been married at least three times, and he had relationships with many mistresses; nevertheless, he appears to have had an unflagging appetite for paid companionship."
    }, 
    {
      "index": 93, 
      "score": 0.20614327490329742, 
      "sent": "Chapo and other drug lords have invested and laundered their proceeds by buying hundreds of legitimate businesses: restaurants, soccer stadiums, day-care centers, ostrich farms."
    }, 
    {
      "index": 103, 
      "score": 0.20609132945537567, 
      "sent": "Mexico's municipal police were poorly trained, poorly paid, and poorly equipped, rendering them susceptible to bribery."
    }, 
    {
      "index": 168, 
      "score": 0.20573835074901581, 
      "sent": "After Los Cabos, Guzman reinstated this arrangement, but with additional precautions."
    }, 
    {
      "index": 213, 
      "score": 0.20570409297943115, 
      "sent": "Guzman's life had become largely nocturnal, and he ate dinner very late."
    }, 
    {
      "index": 109, 
      "score": 0.2055296003818512, 
      "sent": "Last August, the bodyguard was discovered beside a road in Sinaloa."
    }, 
    {
      "index": 192, 
      "score": 0.20552900433540344, 
      "sent": "They implemented clever safeguards against penetration by the cartels."
    }, 
    {
      "index": 236, 
      "score": 0.20438273251056671, 
      "sent": "A quarter of a century ago, he commissioned an architect, Felipe de Jesus Corona-Verbera, to design a grocery store that served as a front company, and a private zoo in Guadalajara for his collection of tigers, crocodiles, and bears."
    }, 
    {
      "index": 160, 
      "score": 0.20408514142036438, 
      "sent": "The authorities, unaware of the handoff, chased the signal around Los Cabos, until they finally pounced on the sacrificial subordinate."
    }, 
    {
      "index": 175, 
      "score": 0.20366424322128296, 
      "sent": "When he received your message, his reply would be relayed back to you through the same indirect means."
    }, 
    {
      "index": 352, 
      "score": 0.20348019897937775, 
      "sent": "His face was bruised and swollen, which SEMAR attributes not to any rough handling but to dings that he had received while sprinting through the dark tunnels beneath Culiacan."
    }, 
    {
      "index": 85, 
      "score": 0.20343543589115143, 
      "sent": "A subsequent investigation determined that Guzman had hidden in a laundry cart pushed by a paid accomplice."
    }, 
    {
      "index": 349, 
      "score": 0.20323489606380463, 
      "sent": "They got him dressed in a pair of black jeans and a white shirt, then escorted him out of the building and around the corner to a dirt soccer field, where he was placed on a Blackhawk and transported to a nearby naval base."
    }, 
    {
      "index": 111, 
      "score": 0.20272421836853027, 
      "sent": "As long as Guzman remained in the mountains, the inhospitable terrain and the allegiance of locals appeared to guarantee his safety."
    }, 
    {
      "index": 48, 
      "score": 0.20213624835014343, 
      "sent": "As the cartel attempted to regroup, authorities on both sides of the border intercepted scores of phone calls, texts, and e-mails."
    }, 
    {
      "index": 252, 
      "score": 0.20204621553421021, 
      "sent": "The passage was unlit and less than five feet high; nevertheless, they splashed through the dirty, shallow water at high speed, as if Guzman had rehearsed this escape."
    }, 
    {
      "index": 296, 
      "score": 0.20200648903846741, 
      "sent": "He, too, became cooperative under questioning, and gave up a significant detail."
    }, 
    {
      "index": 303, 
      "score": 0.20197536051273346, 
      "sent": "Suddenly, on February 20th, it came to life: he was sending a text."
    }, 
    {
      "index": 183, 
      "score": 0.20177866518497467, 
      "sent": "They mobilized rapidly, on Blackhawk helicopters, and did not ask permission before initiating raids."
    }, 
    {
      "index": 104, 
      "score": 0.20176501572132111, 
      "sent": "\"In practical terms, organized crime literally privatized the municipal police forces across many parts of the country,\" one senior Mexican official told me."
    }, 
    {
      "index": 245, 
      "score": 0.20166803896427155, 
      "sent": "As the battering ram clanged against the door, they moved quickly into the ground-floor bathroom."
    }, 
    {
      "index": 475, 
      "score": 0.20131708681583405, 
      "sent": "A jaunty guitar-and-accordion number, it's not so different from their other ballads, apart from the words."
    }, 
    {
      "index": 404, 
      "score": 0.20104813575744629, 
      "sent": "But there are plausible scenarios short of actual escape that would be troubling."
    }, 
    {
      "index": 0, 
      "score": 0.20060466229915619, 
      "sent": "El Chapo escaped from a maximum-security prison and evaded many attempts at capture, often hiding out in the Sierra Madre."
    }, 
    {
      "index": 144, 
      "score": 0.2001011073589325, 
      "sent": "This trust was misplaced: by early 2012, the D.E.A."
    }, 
    {
      "index": 148, 
      "score": 0.19979126751422882, 
      "sent": "(Numerous current and former officials noted Guzman's prodigious consumption of Viagra."
    }, 
    {
      "index": 113, 
      "score": 0.19972144067287445, 
      "sent": "Galvan told him that everybody knew, roughly, where Guzman was."
    }, 
    {
      "index": 224, 
      "score": 0.19971062242984772, 
      "sent": "Normally, the friction of a battering ram would heat the steel, rendering it more pliable."
    }, 
    {
      "index": 260, 
      "score": 0.19944943487644196, 
      "sent": "Then they spotted a tactical vest on the ground--Guzman or the bodyguard must have shed it--and charged onward in that direction."
    }, 
    {
      "index": 420, 
      "score": 0.19936135411262512, 
      "sent": "agent who has spoken to Mexican counterparts involved in the operation, he had a different explanation."
    }, 
    {
      "index": 219, 
      "score": 0.19898039102554321, 
      "sent": "Just before dawn, the marines arrived at a cream-colored two-story house on Rio Humaya Street, in the middle-class neighborhood of Libertad."
    }, 
    {
      "index": 84, 
      "score": 0.19885684549808502, 
      "sent": "One day in January, 2001, a prison administrator pulled aside a makeshift curtain that Guzman had draped across the entrance to his cell and shouted, \"He's escaped!\""
    }, 
    {
      "index": 141, 
      "score": 0.19872486591339111, 
      "sent": "It has been reported, erroneously, that Guzman used a satellite phone; in fact, his favored communication device was the BlackBerry."
    }, 
    {
      "index": 417, 
      "score": 0.19857968389987946, 
      "sent": "One U.S. law-enforcement official told me that it is not unusual for cartel members to start cooperating as soon as they are captured."
    }, 
    {
      "index": 51, 
      "score": 0.19848121702671051, 
      "sent": "presented an intelligence dossier to authorities in Mexico, and in mid-January a special-forces unit of commandos from the Mexican Marines, or SEMAR, began to assemble at a forward operating base near the resort town of Los Cabos, along the southern tip of the Baja Peninsula."
    }, 
    {
      "index": 171, 
      "score": 0.19829781353473663, 
      "sent": "Your message would go not directly to Guzman, however, but to a trusted lieutenant, who spent his days in Starbucks coffee shops and other locations with public wireless networks."
    }, 
    {
      "index": 310, 
      "score": 0.1981738954782486, 
      "sent": "So the marines flew down to the coast."
    }, 
    {
      "index": 247, 
      "score": 0.19806283712387085, 
      "sent": "Suddenly, the caulk around the rim of the bathtub broke and the tub rose from its tiled frame."
    }, 
    {
      "index": 469, 
      "score": 0.19803495705127716, 
      "sent": "She was only seventeen when she caught Chapo's eye, in 2006, while competing in a beauty contest at the annual Festival of Coffee and Guava, in her home state of Durango."
    }, 
    {
      "index": 473, 
      "score": 0.1979728490114212, 
      "sent": "They are rumored to have performed at private parties for Guzman and his associates; they even toured the U.S., with gigs in Los Angeles, Las Vegas, and Miami."
    }, 
    {
      "index": 117, 
      "score": 0.19772025942802429, 
      "sent": "An armored convoy would be spotted by Guzman's lookouts well before it arrived at its destination."
    }, 
    {
      "index": 214, 
      "score": 0.19748008251190186, 
      "sent": "That evening, he was sleeping at a safe house that belonged to his ex-wife Griselda Lopez."
    }, 
    {
      "index": 118, 
      "score": 0.19728535413742065, 
      "sent": "And if a Blackhawk helicopter was dispatched to attack his outpost he would hear it thundering across the valley from miles out, leaving plenty of time to flee."
    }, 
    {
      "index": 71, 
      "score": 0.19693614542484283, 
      "sent": "They severed the telephone lines so that nobody could call for help, then walked inside and opened fire on the dance floor."
    }, 
    {
      "index": 398, 
      "score": 0.19540712237358093, 
      "sent": "He was sprung on a technicality by a panel of Mexican judges, under circumstances that struck many observers as suspicious."
    }, 
    {
      "index": 4, 
      "score": 0.19518335163593292, 
      "sent": "He wore designer clothes and a heavy silver ring in the shape of a grimacing skull."
    }, 
    {
      "index": 476, 
      "score": 0.19511066377162933, 
      "sent": "\"They don't know what they've done, and what kind of trouble they've got themselves in, the people who ordered my arrest,\" the band sings, assuming the voice of the kingpin."
    }, 
    {
      "index": 472, 
      "score": 0.19447776675224304, 
      "sent": "Like Chapo, the band members came from the Badiraguato area, and they had found success playing narcocorridos about the cartel."
    }, 
    {
      "index": 133, 
      "score": 0.19426335394382477, 
      "sent": "\"She's not much of a mountain person,\" he said, adding that they had twin daughters, and, even though Guzman was a fugitive, his wife was adamant that he be present in the girls' lives: \"She would go out of her way to maintain that family life.\""
    }, 
    {
      "index": 101, 
      "score": 0.19386115670204163, 
      "sent": "So you have lots of local support, because you are Santa Claus."
    }, 
    {
      "index": 108, 
      "score": 0.19365812838077545, 
      "sent": "Lopez Valdez insisted that the recording was doctored."
    }, 
    {
      "index": 355, 
      "score": 0.19313579797744751, 
      "sent": "He had been planning to leave for the mountains that day, he told them."
    }, 
    {
      "index": 228, 
      "score": 0.19311125576496124, 
      "sent": "The marines streamed through a modest kitchen and into a series of windowless rooms."
    }, 
    {
      "index": 434, 
      "score": 0.19298167526721954, 
      "sent": "\"Being the son of Chapo Guzman doesn't necessarily guarantee you'll be his successor.\""
    }, 
    {
      "index": 448, 
      "score": 0.19278866052627563, 
      "sent": "He \"escaped,\" when in reality, Hernandez suggests, the President of Mexico at the time, Vicente Fox, personally authorized his release, in exchange for a colossal bribe."
    }, 
    {
      "index": 250, 
      "score": 0.19220535457134247, 
      "sent": "The space was lighted, but very tight, and they moved quickly, knowing that they had only a slight head start on the marines."
    }, 
    {
      "index": 370, 
      "score": 0.19217407703399658, 
      "sent": "of General Motors, General Motors will not go out of business,\" a Mexican official told me."
    }, 
    {
      "index": 288, 
      "score": 0.19146984815597534, 
      "sent": "Guzman had been shuttling nightly among these houses."
    }, 
    {
      "index": 430, 
      "score": 0.19138775765895844, 
      "sent": "What will become of the Sinaloa cartel remains unclear."
    }, 
    {
      "index": 383, 
      "score": 0.19128158688545227, 
      "sent": "office in Chicago vowed, \"I fully intend for us to have him tried here.\""
    }, 
    {
      "index": 37, 
      "score": 0.19093915820121765, 
      "sent": "The authorities tried to track Guzman by monitoring telephone lines."
    }, 
    {
      "index": 227, 
      "score": 0.19079628586769104, 
      "sent": "It took ten minutes to gain entry to the house."
    }, 
    {
      "index": 41, 
      "score": 0.19029660522937775, 
      "sent": "\"I never spoke to him directly,\" one former Sinaloa lieutenant told me."
    }, 
    {
      "index": 220, 
      "score": 0.19007071852684021, 
      "sent": "There were bars on the windows, but that was standard in Culiacan."
    }, 
    {
      "index": 76, 
      "score": 0.18970850110054016, 
      "sent": "Seven people were killed, including Archbishop Juan Jesus Posadas Ocampo."
    }, 
    {
      "index": 325, 
      "score": 0.18934135138988495, 
      "sent": "The commandos needed no battering ram as they crashed through a flimsy wooden door, shouting, \"Marines!\""
    }, 
    {
      "index": 232, 
      "score": 0.18911109864711761, 
      "sent": "In a bathroom on the ground floor, they discovered a bathtub that had been raised from its base, on hydraulic lifts, at a forty-five-degree angle, revealing a dark opening leading to a steep set of stairs: a tunnel."
    }, 
    {
      "index": 320, 
      "score": 0.18856731057167053, 
      "sent": "(One of them, an American, thought that their room had been stormed because they had been smoking marijuana."
    }, 
    {
      "index": 328, 
      "score": 0.18851275742053986, 
      "sent": "A pink Pack 'n Play--which matched the girls' miniature pink suitcases--had been set up."
    }, 
    {
      "index": 428, 
      "score": 0.18777640163898468, 
      "sent": "A 2011 Human Rights Watch report found that members of Mexico's security services \"systematically use torture to obtain forced confessions and information about criminal groups,\" and documented the use of such techniques as \"beatings, asphyxiation with plastic bags, waterboarding, electric shocks, sexual torture, and death threats.\""
    }, 
    {
      "index": 474, 
      "score": 0.18741171061992645, 
      "sent": "After the raid, Los Alegres posted a new single, \"La Captura de Joaquin Guzman,\" on YouTube."
    }, 
    {
      "index": 408, 
      "score": 0.18720695376396179, 
      "sent": "Shortly after the arrest in Mazatlan, Guzman's son Alfredo lashed out on Twitter."
    }, 
    {
      "index": 350, 
      "score": 0.18699683248996735, 
      "sent": "A Learjet then took him to Mexico City."
    }, 
    {
      "index": 411, 
      "score": 0.18654797971248627, 
      "sent": "The cartel is my father's and will always be my father's."
    }, 
    {
      "index": 340, 
      "score": 0.18638025224208832, 
      "sent": "No one would have imagined such a legendary outlaw going out in anything but a firefight."
    }, 
    {
      "index": 322, 
      "score": 0.1863560825586319, 
      "sent": "Meanwhile, on the fourth floor, a team of six marines approached Apartment 401, where they discovered Condor standing guard and holding an assault rifle."
    }, 
    {
      "index": 60, 
      "score": 0.18576185405254364, 
      "sent": "As the marines and their advisers moved into Los Cabos, they tried not to attract attention."
    }, 
    {
      "index": 36, 
      "score": 0.18562977015972137, 
      "sent": "One narcocorrido captured the predicament: \"Only he knows who he is / So go looking for someone / Who looks just like him / Because the real Chapo / You'll never see again.\""
    }, 
    {
      "index": 221, 
      "score": 0.18535798788070679, 
      "sent": "The marines readied their weapons and produced a battering ram, but when they moved to breach the front door it didn't budge."
    }, 
    {
      "index": 162, 
      "score": 0.18530930578708649, 
      "sent": "\"He changed it up after Los Cabos,\" one U.S. law-enforcement official told me, adding a line worthy of a narcocorrido: \"He's an illiterate son of a bitch, but he's a street-smart motherfucker.\""
    }, 
    {
      "index": 190, 
      "score": 0.18526755273342133, 
      "sent": "They now made a fetish of secrecy."
    }, 
    {
      "index": 415, 
      "score": 0.18511134386062622, 
      "sent": "Had either one refused to cooperate, Guzman would likely remain free today."
    }, 
    {
      "index": 140, 
      "score": 0.18431605398654938, 
      "sent": "Chapo and his entourage would come in and feast on shrimp and steak, then thank the other diners for their forbearance, return the telephones, pick up the tab for everyone, and head off into the night."
    }, 
    {
      "index": 211, 
      "score": 0.18408410251140594, 
      "sent": "So maybe the whole personal-chef thing was more hedonism than paranoia.\""
    }, 
    {
      "index": 471, 
      "score": 0.18371634185314178, 
      "sent": "A norteno band, Los Alegres del Barranco, was playing at the festival."
    }, 
    {
      "index": 337, 
      "score": 0.18369339406490326, 
      "sent": "Then Chapo shouted, \"O.K., O.K., O.K., O.K.!\""
    }, 
    {
      "index": 187, 
      "score": 0.18344172835350037, 
      "sent": "He was buried with full military honors."
    }, 
    {
      "index": 425, 
      "score": 0.18224650621414185, 
      "sent": "However, two senior U.S. law-enforcement officials told me that, though they had no specific knowledge of the Mexican authorities using torture in the operation, they \"wouldn't be surprised.\""
    }, 
    {
      "index": 73, 
      "score": 0.181841179728508, 
      "sent": "They were in the bathroom when the shooting started, and fled without being harmed."
    }, 
    {
      "index": 413, 
      "score": 0.18165157735347748, 
      "sent": "His brother, Ivan, vowed revenge: \"Those dogs that dared to lay a hand on my father are going to pay.\""
    }, 
    {
      "index": 159, 
      "score": 0.1815037727355957, 
      "sent": "Someone involved in the operation said of Guzman, \"He took us for a ride.\""
    }, 
    {
      "index": 366, 
      "score": 0.18103218078613281, 
      "sent": "Fingerprints and a DNA swab confirmed that the man captured at the Miramar was indeed Guzman."
    }, 
    {
      "index": 132, 
      "score": 0.18064719438552856, 
      "sent": "Another law-enforcement official speculated that, though Guzman was accustomed to a rustic life, Emma Coronel was not."
    }, 
    {
      "index": 374, 
      "score": 0.18061469495296478, 
      "sent": "\"He was a non-executive chairman,\" Ambassador Mora told me."
    }, 
    {
      "index": 354, 
      "score": 0.18038435280323029, 
      "sent": "Guzman was gruff but respectful with his captors."
    }, 
    {
      "index": 223, 
      "score": 0.17998962104320526, 
      "sent": "For all the noise that their efforts made, the door seemed indestructible."
    }, 
    {
      "index": 139, 
      "score": 0.17981158196926117, 
      "sent": "Diners would be startled by a team of gunmen, who would politely but firmly demand their telephones, promising that they would be returned at the end of the evening."
    }, 
    {
      "index": 27, 
      "score": 0.17947724461555481, 
      "sent": "Was Guzman being tipped off by an insider?"
    }, 
    {
      "index": 273, 
      "score": 0.17884090542793274, 
      "sent": "\"Corpse messages\"--piles of dismembered bodies--were left on major street corners."
    }, 
    {
      "index": 75, 
      "score": 0.17812976241111755, 
      "sent": "As gunfire erupted, Guzman scrambled out of his vehicle and crawled to safety."
    }, 
    {
      "index": 64, 
      "score": 0.17752794921398163, 
      "sent": "Guzman had always been a master of escape."
    }, 
    {
      "index": 235, 
      "score": 0.17686863243579865, 
      "sent": "Guzman invented the border tunnel."
    }, 
    {
      "index": 302, 
      "score": 0.17682422697544098, 
      "sent": "They had also been monitoring his BlackBerry communications, but the device appeared to be turned off."
    }, 
    {
      "index": 458, 
      "score": 0.17651060223579407, 
      "sent": "He maintained his innocence, his rote replies taking on a smug absurdity: Q: May the deponent say to which organization he belongs."
    }, 
    {
      "index": 38, 
      "score": 0.17627719044685364, 
      "sent": "Narcotics smuggling necessitates regular phone communication between farmers and packers, truckers and pilots, accountants and enforcers, street dealers and suppliers."
    }, 
    {
      "index": 218, 
      "score": 0.17595849931240082, 
      "sent": "\"He flipped right away,\" an American law-enforcement official told me."
    }, 
    {
      "index": 409, 
      "score": 0.17583061754703522, 
      "sent": "\"The Government is going to pay for this betrayal--it shouldn't have bitten the hand that feeds it,\" he wrote."
    }, 
    {
      "index": 152, 
      "score": 0.17564943432807922, 
      "sent": "\"It was like 'Peyton Place,' \" a former law-enforcement official who kept track of the communications told me."
    }, 
    {
      "index": 314, 
      "score": 0.17553713917732239, 
      "sent": "Marshals, and the Department of Homeland Security."
    }, 
    {
      "index": 323, 
      "score": 0.17544583976268768, 
      "sent": "He raised his weapon only for a moment, since it was obvious that he was outnumbered."
    }, 
    {
      "index": 356, 
      "score": 0.17543649673461914, 
      "sent": "If the marines had arrived just a few hours later, he would have been gone."
    }, 
    {
      "index": 369, 
      "score": 0.17529813945293427, 
      "sent": "\"If you kill the C.E.O."
    }, 
    {
      "index": 114, 
      "score": 0.1751122921705246, 
      "sent": "The challenge was taking him into custody."
    }, 
    {
      "index": 81, 
      "score": 0.17431814968585968, 
      "sent": "He bought off the prison staff and enjoyed a life of relative luxury: he conducted business by cell phone, orchestrated regular visits from prostitutes, and threw parties for favored inmates that featured alcohol, lobster bisque, and filet mignon."
    }, 
    {
      "index": 54, 
      "score": 0.17405405640602112, 
      "sent": "Its object was to capture Guzman."
    }, 
    {
      "index": 477, 
      "score": 0.17362037301063538, 
      "sent": "\"It won't be long before I return to La Tuna and become a fugitive again."
    }, 
    {
      "index": 210, 
      "score": 0.17346911132335663, 
      "sent": "agent said of the chef, \"She's absolutely a great cook."
    }, 
    {
      "index": 200, 
      "score": 0.173047736287117, 
      "sent": "began to focus on a trafficker named Mario Hidalgo Arguello."
    }, 
    {
      "index": 215, 
      "score": 0.17284373939037323, 
      "sent": "By the time Nariz left work, it was already past midnight."
    }, 
    {
      "index": 151, 
      "score": 0.17150583863258362, 
      "sent": "agents who monitored his e-mails and texts marvelled at the extent to which his communications seemed focussed not on managing his multinational empire but on juggling the competing demands of his wife, his ex-wives (with whom he remained cordial), his girlfriends, and his paid consorts."
    }, 
    {
      "index": 2, 
      "score": 0.1713891327381134, 
      "sent": "flight from Mexico City arrived at Amsterdam's Schiphol Airport."
    }, 
    {
      "index": 125, 
      "score": 0.17004776000976562, 
      "sent": "Until lately, Guzman had taken that approach."
    }, 
    {
      "index": 179, 
      "score": 0.16978517174720764, 
      "sent": "eventually grasped the nature of the arrangement."
    }, 
    {
      "index": 42, 
      "score": 0.16938707232475281, 
      "sent": "\"But I knew what he wanted us to do.\""
    }, 
    {
      "index": 188, 
      "score": 0.16732963919639587, 
      "sent": "Shortly after his funeral, gunmen charged into a home where his family had gathered to mourn, and murdered his mother, his brother, his sister, and his aunt."
    }, 
    {
      "index": 335, 
      "score": 0.16720394790172577, 
      "sent": "\"He's the father of my children!\""
    }, 
    {
      "index": 418, 
      "score": 0.16703230142593384, 
      "sent": "\"There's very little allegiance once they're taken into custody,\" he said."
    }, 
    {
      "index": 382, 
      "score": 0.16638030111789703, 
      "sent": "The head of the D.E.A."
    }, 
    {
      "index": 31, 
      "score": 0.16627046465873718, 
      "sent": "Yet Guzman himself remained maddeningly obscure."
    }, 
    {
      "index": 32, 
      "score": 0.16622412204742432, 
      "sent": "Only a few photographs of him circulated publicly."
    }, 
    {
      "index": 102, 
      "score": 0.16604301333427429, 
      "sent": "And everybody likes Santa Claus.\""
    }, 
    {
      "index": 100, 
      "score": 0.16577322781085968, 
      "sent": "If someone gets sick, you provide a little plane."
    }, 
    {
      "index": 326, 
      "score": 0.16562694311141968, 
      "sent": "They entered a two-bedroom apartment with potted plants, cheap furniture, and a white tile floor."
    }, 
    {
      "index": 158, 
      "score": 0.16557137668132782, 
      "sent": "He met up with a subordinate and gave him the BlackBerry."
    }, 
    {
      "index": 164, 
      "score": 0.16439427435398102, 
      "sent": "Like bin Laden, he might have chosen to rely on couriers."
    }, 
    {
      "index": 163, 
      "score": 0.16411338746547699, 
      "sent": "Rather than switch BlackBerrys, as he had done in the past, Guzman now appeared to have stopped communicating altogether."
    }, 
    {
      "index": 137, 
      "score": 0.16394205391407013, 
      "sent": "From time to time, he would be spotted at an elegant restaurant in Sinaloa or in a neighboring state."
    }, 
    {
      "index": 242, 
      "score": 0.16282342374324799, 
      "sent": "\"Corona made a fucking cool tunnel,\" he said."
    }, 
    {
      "index": 400, 
      "score": 0.16277389228343964, 
      "sent": "But he had already disappeared into the mountains."
    }, 
    {
      "index": 332, 
      "score": 0.16269490122795105, 
      "sent": "Guzman had scrambled out of bed in his underwear, grabbed an assault rifle, and darted into a small bathroom."
    }, 
    {
      "index": 230, 
      "score": 0.16238963603973389, 
      "sent": "A gaudy oil painting of a bucking bull, stuck full of swords but still defiant, hung on one wall."
    }, 
    {
      "index": 421, 
      "score": 0.1614823043346405, 
      "sent": "\"The marines tortured these guys,\" he told me, matter-of-factly."
    }, 
    {
      "index": 286, 
      "score": 0.16122294962406158, 
      "sent": "(This was a departure: Mexican armed forces had generally retreated to their bases following a failed attempt to apprehend him.)"
    }, 
    {
      "index": 53, 
      "score": 0.16100879013538361, 
      "sent": "Mexican authorities code-named the mission Operation Gargoyle."
    }, 
    {
      "index": 231, 
      "score": 0.16089741885662079, 
      "sent": "But there was nobody in the house."
    }, 
    {
      "index": 138, 
      "score": 0.15971846878528595, 
      "sent": "The choreography was always the same."
    }, 
    {
      "index": 478, 
      "score": 0.15959255397319794, 
      "sent": "That's what the people want.\""
    }, 
    {
      "index": 450, 
      "score": 0.15906767547130585, 
      "sent": "Guzman spent years as a \"fugitive,\" though everyone knew where he was, and the authorities were simply lying when they claimed that they \"could not catch him.\""
    }, 
    {
      "index": 480, 
      "score": 0.15885096788406372, 
      "sent": "Sign up for the daily newsletter: the best of The New Yorker every day."
    }, 
    {
      "index": 465, 
      "score": 0.15839096903800964, 
      "sent": "He made twenty thousand pesos a month, he continued, or about eighteen thousand dollars a year."
    }, 
    {
      "index": 454, 
      "score": 0.15808233618736267, 
      "sent": "\"If Chapo Guzman has been captured,\" she said."
    }, 
    {
      "index": 153, 
      "score": 0.1570708155632019, 
      "sent": "\"It was a non-stop deal.\""
    }, 
    {
      "index": 135, 
      "score": 0.1562051922082901, 
      "sent": "\"He loves the gourmet food,\" a D.E.A."
    }, 
    {
      "index": 419, 
      "score": 0.15615448355674744, 
      "sent": "But when I raised the subject with a former D.E.A."
    }, 
    {
      "index": 209, 
      "score": 0.15415729582309723, 
      "sent": "But one D.E.A."
    }, 
    {
      "index": 441, 
      "score": 0.15301771461963654, 
      "sent": "\"You can't legalize kidnapping,\" he said."
    }, 
    {
      "index": 255, 
      "score": 0.1522703617811203, 
      "sent": "But the marines did not hesitate."
    }, 
    {
      "index": 249, 
      "score": 0.15071316063404083, 
      "sent": "They scrambled down the steps into a narrow passage."
    }, 
    {
      "index": 455, 
      "score": 0.15038159489631653, 
      "sent": "\"If that is the real story.\""
    }, 
    {
      "index": 128, 
      "score": 0.15035098791122437, 
      "sent": "agent who worked in Mexico for many years, told me."
    }, 
    {
      "index": 346, 
      "score": 0.14865358173847198, 
      "sent": "His teeth were a little pearlier--he'd had them capped."
    }, 
    {
      "index": 375, 
      "score": 0.14804856479167938, 
      "sent": "\"An emblematic figure.\""
    }, 
    {
      "index": 262, 
      "score": 0.14790360629558563, 
      "sent": "Once again, he had vanished."
    }, 
    {
      "index": 357, 
      "score": 0.14781156182289124, 
      "sent": "\"I can't believe you got me,\" he said."
    }, 
    {
      "index": 134, 
      "score": 0.1472698301076889, 
      "sent": "Guzman had other weaknesses."
    }, 
    {
      "index": 422, 
      "score": 0.14663176238536835, 
      "sent": "\"They would never have given it up, if not for that.\""
    }, 
    {
      "index": 120, 
      "score": 0.14596772193908691, 
      "sent": "indicated that Guzman might be changing his habits."
    }, 
    {
      "index": 412, 
      "score": 0.1453210860490799, 
      "sent": "GUZMAN LOERA FOREVER.\""
    }, 
    {
      "index": 330, 
      "score": 0.14395329356193542, 
      "sent": "\"Don't kill him!\""
    }, 
    {
      "index": 464, 
      "score": 0.14207501709461212, 
      "sent": "His products were not cocaine, heroin, marijuana, and meth, Guzman insisted, but corn, sorghum, beans, and safflower."
    }, 
    {
      "index": 50, 
      "score": 0.14154908061027527, 
      "sent": "The D.E.A."
    }, 
    {
      "index": 333, 
      "score": 0.14140938222408295, 
      "sent": "\"Don't kill him!\""
    }, 
    {
      "index": 131, 
      "score": 0.14082445204257965, 
      "sent": "He likes to dance.\""
    }, 
    {
      "index": 338, 
      "score": 0.1404067724943161, 
      "sent": "and extended his empty hands through the bathroom doorway."
    }, 
    {
      "index": 229, 
      "score": 0.14021438360214233, 
      "sent": "They noticed surveillance cameras and monitors everywhere."
    }, 
    {
      "index": 321, 
      "score": 0.13965980708599091, 
      "sent": "The marines were perplexed when he produced, from his wallet, a California medical-marijuana card.)"
    }, 
    {
      "index": 129, 
      "score": 0.13964734971523285, 
      "sent": "\"He likes the fiestas."
    }, 
    {
      "index": 410, 
      "score": 0.13864330947399139, 
      "sent": "\"I just want to say that we are not beaten."
    }, 
    {
      "index": 348, 
      "score": 0.13845415413379669, 
      "sent": "(In the house on Rio Humaya Street, in Culiacan, the marines discovered a bottle of hair dye.)"
    }, 
    {
      "index": 445, 
      "score": 0.13670378923416138, 
      "sent": "(It was recently published in English, under the title \"Narcoland.\")"
    }, 
    {
      "index": 241, 
      "score": 0.13659077882766724, 
      "sent": "The result delighted him."
    }, 
    {
      "index": 459, 
      "score": 0.13601870834827423, 
      "sent": "A: I don't belong to any cartel."
    }, 
    {
      "index": 59, 
      "score": 0.13320235908031464, 
      "sent": "\"There was no window,\" he said.)"
    }, 
    {
      "index": 130, 
      "score": 0.13182434439659119, 
      "sent": "He likes the music."
    }, 
    {
      "index": 170, 
      "score": 0.13140371441841125, 
      "sent": "(Guzman had apparently learned to read and write well enough to communicate in the shorthand of instant messages.)"
    }, 
    {
      "index": 149, 
      "score": 0.12555813789367676, 
      "sent": "\"He ate it like candy,\" one said.)"
    }, 
    {
      "index": 110, 
      "score": 0.12436704337596893, 
      "sent": "He had been decapitated."
    }, 
    {
      "index": 423, 
      "score": 0.12322358042001724, 
      "sent": "The D.E.A."
    }, 
    {
      "index": 77, 
      "score": 0.12321483343839645, 
      "sent": "(The gunmen apparently mistook him for Guzman.)"
    }, 
    {
      "index": 479, 
      "score": 0.11929842829704285, 
      "sent": "Sign up for the daily newsletter."
    }, 
    {
      "index": 150, 
      "score": 0.11887991428375244, 
      "sent": "The D.E.A."
    }, 
    {
      "index": 301, 
      "score": 0.11778663843870163, 
      "sent": "It was empty."
    }, 
    {
      "index": 347, 
      "score": 0.11665581911802292, 
      "sent": "His hair and his mustache were still thick and jet black."
    }, 
    {
      "index": 1, 
      "score": 0.11093138158321381, 
      "sent": "Credit Clockwise from top left: Alfredo Estrella / AFP / Getty; Greg Mathieson / Mai / Mai / Time Life Pictures / Getty; Ronaldo Schemidt / AFP / Getty; Nikolai Golovanoff / Corbis; Artgraphixel / Shutterstock; Natrot / Shutterstock; Us DEA / Reuters; Chris Ratcliffe / Bloomberg / Getty; BSIP / UIG / Getty; Zimand / Shutterstock (AK-47); Ronaldo Schemidt / AFP / Getty (handgun)\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\tOne afternoon last December, an assassin on board a K.L.M."
    }, 
    {
      "index": 334, 
      "score": 0.1107189878821373, 
      "sent": "Coronel pleaded again."
    }, 
    {
      "index": 98, 
      "score": 0.10970759391784668, 
      "sent": "Baptisms."
    }, 
    {
      "index": 424, 
      "score": 0.10889702290296555, 
      "sent": "refused to comment on the torture allegation."
    }, 
    {
      "index": 365, 
      "score": 0.10746027529239655, 
      "sent": "agents now joke that El Mas Loco is the only Mexican kingpin to have died twice.)"
    }, 
    {
      "index": 463, 
      "score": 0.10528484731912613, 
      "sent": "I am a farmer."
    }, 
    {
      "index": 364, 
      "score": 0.10268944501876831, 
      "sent": "(D.E.A."
    }, 
    {
      "index": 449, 
      "score": 0.098647527396678925, 
      "sent": "(Fox has angrily denied this accusation.)"
    }, 
    {
      "index": 397, 
      "score": 0.097033053636550903, 
      "sent": "agent."
    }, 
    {
      "index": 99, 
      "score": 0.095224171876907349, 
      "sent": "Infrastructure."
    }, 
    {
      "index": 136, 
      "score": 0.088910713791847229, 
      "sent": "official told me."
    }, 
    {
      "index": 331, 
      "score": 0.088466167449951172, 
      "sent": "she shrieked."
    }, 
    {
      "index": 460, 
      "score": 0.058364979922771454, 
      "sent": "."
    }, 
    {
      "index": 462, 
      "score": 0.049737989902496338, 
      "sent": "."
    }, 
    {
      "index": 461, 
      "score": 0.048420000821352005, 
      "sent": "."
    }
  ], 
  "title": null
}