{
  "model": "c22a5bd", 
  "scored_article_sentences": [
    {
      "index": 491, 
      "score": 0.26644229888916016, 
      "sent": "He's thinking about Instagram--everybody said to get into Instagram, but he doesn't know how to do it--and he's been holding on to a commercial YouTube URL that he might start working on."
    }, 
    {
      "index": 55, 
      "score": 0.26561811566352844, 
      "sent": "Celebrating someone else's brilliance is part of the content you offer, giving exposure to both the creator and the reblogger."
    }, 
    {
      "index": 54, 
      "score": 0.26083853840827942, 
      "sent": "All of these likes, reblogs, and comments pile up in a log of \"notes\" appended to the original post as it travels through the network's feed."
    }, 
    {
      "index": 375, 
      "score": 0.25730934739112854, 
      "sent": "Exposely had a major selling point for kids in a similar position to So-Relatable: Its Google AdSense account would be a way for teens who'd been banned to still make money from ads."
    }, 
    {
      "index": 483, 
      "score": 0.24532885849475861, 
      "sent": "They joined an affiliate marketing program with ChaCha, which offers a service in which users can submit a question and a ChaCha human will answer in real time."
    }, 
    {
      "index": 7, 
      "score": 0.24291276931762695, 
      "sent": "In late 2010 she had signed up for Tumblr, the then-three-year-old social network, and secured the URL IWantMyFairyTaleEnding.tumblr.com."
    }, 
    {
      "index": 276, 
      "score": 0.24071404337882996, 
      "sent": "Lilley and Greenfield had agreed to split ad revenue 50-50 with Tom, but a few months later, they noticed the ads on the site had been replaced with images promoting Tom's YouTube channel JusstTom."
    }, 
    {
      "index": 255, 
      "score": 0.23830647766590118, 
      "sent": "In 2013, Yahoo bought Tumblr for $1 billion and began a new ad rollout, but after a year, Karp's wild profitability still hadn't materialized."
    }, 
    {
      "index": 269, 
      "score": 0.23703138530254364, 
      "sent": "An \"r4r\" in the Facebook group is offering an exchange of reblogs, so each blog is exposed to a wider set of followers."
    }, 
    {
      "index": 477, 
      "score": 0.23629434406757355, 
      "sent": "Exposely still exists, and Hegstad is listed as the founder on its web site, but the day I talked to him the site was down--its security certificate had expired."
    }, 
    {
      "index": 67, 
      "score": 0.23570205271244049, 
      "sent": "I was there to meet Danielle Strle, Tumblr's 34-year-old head of culture and trends, whose job it is to figure out what the teens are up to."
    }, 
    {
      "index": 256, 
      "score": 0.23555739223957062, 
      "sent": "A former Tumblr executive told The New York Times that Tumblr's anonymity was a hurdle: \"Real-world identities are valuable to advertisers."
    }, 
    {
      "index": 150, 
      "score": 0.23528806865215302, 
      "sent": "It was an enormous reach for two teenagers from a Rust Belt town of 88,000 people, and they did it by tapping into the essence of what makes content shareable: Here Is A Feeling You Thought Only You Felt But Is Actually Universal.I spent the day with them in Greenfield's parents' basement this fall."
    }, 
    {
      "index": 396, 
      "score": 0.23496811091899872, 
      "sent": "A Tumblr user explained to me that So-Relatable had an advantage by posting these ads, because their blog had a theme of relatable quotes and life hacks."
    }, 
    {
      "index": 111, 
      "score": 0.23438753187656403, 
      "sent": "A study by Priceonomics found that Tumblr is the top source for BuzzFeed's viral content."
    }, 
    {
      "index": 254, 
      "score": 0.23398773372173309, 
      "sent": "Tumblr was, at that time, still a unicorn; the possibility of making money was just as powerful an asset as the actual making of it."
    }, 
    {
      "index": 481, 
      "score": 0.23173800110816956, 
      "sent": "According to their tax returns, the pair made only $72,000 in 2014, a third of the previous year's revenue."
    }, 
    {
      "index": 191, 
      "score": 0.23052918910980225, 
      "sent": "The worst hacks brought in thousands of followers, and that's how Lifehackable built the bulk of its audience."
    }, 
    {
      "index": 382, 
      "score": 0.22992558777332306, 
      "sent": "The idea was to create an advertisement mimicking a Tumblr post, and the ad would include a link to a diet pill site."
    }, 
    {
      "index": 58, 
      "score": 0.22899627685546875, 
      "sent": "The most common was the Tumblr-to-book phenomenon: The creator of Hipster Puppies closed a five-figure book deal in 2010."
    }, 
    {
      "index": 259, 
      "score": 0.22861479222774506, 
      "sent": "Yahoo is experiencing declining revenue in display ads and the company is trying to make up for it with native advertising--ads that look like human-created content but were actually made for brands."
    }, 
    {
      "index": 324, 
      "score": 0.22783872485160828, 
      "sent": "Lilley discovered Hegstad had a talent for networking, a lot of people did in L.A."
    }, 
    {
      "index": 482, 
      "score": 0.22604218125343323, 
      "sent": "With neither AdSense nor Exposely to turn clicks into cash, there wasn't enough money to afford life in L.A.Back in Pennsylvania, Lilley and Greenfield worked to rebuild but kept hitting more walls."
    }, 
    {
      "index": 53, 
      "score": 0.2259017676115036, 
      "sent": "But the defining feature of Tumblr culture is reblogging: Any user can repost content from any other Tumblr and add their own comments."
    }, 
    {
      "index": 400, 
      "score": 0.22489261627197266, 
      "sent": "He began by reading up on David Ogilvy, \"the father of advertising,\" and he learned the best ad is often the one that doesn't seem like an ad."
    }, 
    {
      "index": 42, 
      "score": 0.22476494312286377, 
      "sent": "Tumblr is the social network that, based on my reporting, is seen by teens as the most uncool."
    }, 
    {
      "index": 270, 
      "score": 0.22412656247615814, 
      "sent": "An \"r4c\" means a user will reblog a post for someone who promises to visit their blog, refresh it several times, click on the ad, and then refresh it several times--but only if you're from a \"premium country,\" because Google pays more for clicks from Ireland, for example, than from the Philippines."
    }, 
    {
      "index": 56, 
      "score": 0.22389921545982361, 
      "sent": "To grow a following on Tumblr beyond people you know, you have to post more than updates on your personal life--you need stuff that will resonate with strangers."
    }, 
    {
      "index": 4, 
      "score": 0.22344984114170074, 
      "sent": "An anonymous user was unimpressed: \"you only have 100k because of ur url.\""
    }, 
    {
      "index": 469, 
      "score": 0.2234061062335968, 
      "sent": "Two months after the termination of the Tumblr teens, Fast Company ran a puff piece on Dennis Hegstad and his empire."
    }, 
    {
      "index": 260, 
      "score": 0.22294384241104126, 
      "sent": "Likewise, some Tumblr users have tried their own kind of native ads--posts endorsing products that link to the stores where you can buy them."
    }, 
    {
      "index": 452, 
      "score": 0.22272193431854248, 
      "sent": "Lilley and Greenfield had unwittingly spread the poison that would kill a huge section of the teen Tumblr world."
    }, 
    {
      "index": 344, 
      "score": 0.22224755585193634, 
      "sent": "They'd call the company Exposely.But at the end of 2013, disaster: AdSense banned Lilley and Greenfield just as they were due a large check--Greenfield estimated it was $50,000."
    }, 
    {
      "index": 308, 
      "score": 0.2222154438495636, 
      "sent": "Lilley made of all of the arrangements with Hegstad, who agreed to be their roommate."
    }, 
    {
      "index": 507, 
      "score": 0.22143879532814026, 
      "sent": "Greenfield and Lilley quit college as freshmen to make a career out of their Tumblrs--it's the only way they know how to make money."
    }, 
    {
      "index": 388, 
      "score": 0.22093397378921509, 
      "sent": "In 2013, a 24-year-old woman fatally overdosed on a version made by Forza--the pills also have a ton of caffeine."
    }, 
    {
      "index": 343, 
      "score": 0.22090135514736176, 
      "sent": "It would be a platform on which social media accounts could find advertising campaigns to post on their site, and they would charge a portion of the revenue for the convenience."
    }, 
    {
      "index": 453, 
      "score": 0.22036834061145782, 
      "sent": "Lilley had told his friends they were safe (\"I fucked up telling you guys that\"), but he lost his accounts, too, and wouldn't have used the ads if he knew it'd get them banned."
    }, 
    {
      "index": 74, 
      "score": 0.2203281968832016, 
      "sent": "Strle put me in touch with Jason Wong, a college freshman who's been on the site since he was 15."
    }, 
    {
      "index": 476, 
      "score": 0.22026680409908295, 
      "sent": "Lilley and Greenfield said Hegstad had promised them equity in Exposely, and Hegstad confirmed they'd discussed both equity and becoming partners, but the company's future was uncertain."
    }, 
    {
      "index": 307, 
      "score": 0.21978609263896942, 
      "sent": "It took a few months, but Lilley and Greenfield decided to move to the West Coast."
    }, 
    {
      "index": 292, 
      "score": 0.21856307983398438, 
      "sent": "\"That fall, Hegstad gave Lilley and Greenfield some valuable tips: The end of the year is the most profitable time for banner ads, and he taught them how to tweak the layout of their site and the display of their banner ads."
    }, 
    {
      "index": 112, 
      "score": 0.21850104629993439, 
      "sent": "The site's biggest story in 2015--a photo of a dress that looked blue-and-black or white-and-gold--was found on Tumblr."
    }, 
    {
      "index": 241, 
      "score": 0.21838699281215668, 
      "sent": "He had connections in the music industry, and in October 2013 he would create Songsly, a platform where musicians could pay viral video creators to use their songs."
    }, 
    {
      "index": 458, 
      "score": 0.21806013584136963, 
      "sent": "She acknowledged this is partly because it's harder to monetize fame on Tumblr than on other social networks."
    }, 
    {
      "index": 268, 
      "score": 0.21769583225250244, 
      "sent": "There they organize to trade favors, like agreeing to   promote each other's posts."
    }, 
    {
      "index": 345, 
      "score": 0.2176937609910965, 
      "sent": "Months later, an anonymous person claiming to be a Google employee would post a supposed tell-all on Pastebin, a text-sharing site used primarily by coders, claiming that AdSense intentionally bans people just before big checks are due."
    }, 
    {
      "index": 6, 
      "score": 0.2174680233001709, 
      "sent": "It had taken Pizza more than two years to reach this milestone."
    }, 
    {
      "index": 242, 
      "score": 0.21715965867042542, 
      "sent": "When he reached out to So-Relatable, Hegstad had a big Twitter audience, millions of followers across a dozen accounts."
    }, 
    {
      "index": 12, 
      "score": 0.21710076928138733, 
      "sent": "By the end of 2012, she had amassed 90,000 followers, a respectable number for a Tumblr, a sign she'd earned a certain amount of fame in her circle--the teens who reblogged her jokes."
    }, 
    {
      "index": 274, 
      "score": 0.21697196364402771, 
      "sent": "Lilley and Greenfield felt the sting of a bad exchange a few times, but the biggest lesson came with Lifehackable."
    }, 
    {
      "index": 438, 
      "score": 0.21696652472019196, 
      "sent": "Tumblr had just dissolved the sites of some of its most popular teenage users, an estimated 30 million follows gone."
    }, 
    {
      "index": 484, 
      "score": 0.21621549129486084, 
      "sent": "In June, ChaCha canceled So-Relatable's accounts while a large payment was due."
    }, 
    {
      "index": 455, 
      "score": 0.21525871753692627, 
      "sent": "(A Tumblr spokesperson acknowledged the ad \"appears to be a violation of our ad policies,\" and was possibly part of an ad network that is \"no longer in effect on Tumblr."
    }, 
    {
      "index": 5, 
      "score": 0.21489621698856354, 
      "sent": "But Pizza shot that down: \"uh no i had 93k before i got this url so excuse u.\""
    }, 
    {
      "index": 83, 
      "score": 0.21446333825588226, 
      "sent": "Wong told me if he's up at 4 a.m. after a bad day, he can go online and talk to his Australian friends; Tumblr users know their audience is active in multiple time zones."
    }, 
    {
      "index": 247, 
      "score": 0.21416774392127991, 
      "sent": "Tumblr users are allowed to put banner ads on their sites, but most users access Tumblr through the dashboard feed, where only Tumblr's sponsored posts can go."
    }, 
    {
      "index": 387, 
      "score": 0.21393132209777832, 
      "sent": "One study indicated mice fed a super high dosage while on a high-fat diet did not gain as much fat in the liver, but there's no evidence it makes humans thin."
    }, 
    {
      "index": 478, 
      "score": 0.21372349560260773, 
      "sent": "Hegstad agreed Exposely was the apparent reason several blogs were terminated and that users associated with the site were still at risk."
    }, 
    {
      "index": 389, 
      "score": 0.21348951756954193, 
      "sent": "Hegstad figured out a way to make a landing page for the diet pills by looking at what his competitors did."
    }, 
    {
      "index": 395, 
      "score": 0.21225611865520477, 
      "sent": "So in between Tumblr posts about life's daily tragedies, like someone stepping on the back of your shoe, there appeared these diet pill posts."
    }, 
    {
      "index": 406, 
      "score": 0.21201610565185547, 
      "sent": "Lilley crafted his testimonials from a girl's perspective, honing the copy, making sure the line breaks were just right."
    }, 
    {
      "index": 374, 
      "score": 0.21080632507801056, 
      "sent": "In April 2014, Lilley messaged Miller about a new way to make money: \"I'm signing up people, would love for you to be one of our first publishers on exposely!\""
    }, 
    {
      "index": 245, 
      "score": 0.20941843092441559, 
      "sent": "Tumblr teens need to be sophisticated about making money, and they have clever tactics to increase traffic and followers and revenue, often helping each other to game Google AdSense."
    }, 
    {
      "index": 508, 
      "score": 0.20918276906013489, 
      "sent": "While reporting this story, I went to a dinner party with a group of people who make their living writing on the internet."
    }, 
    {
      "index": 348, 
      "score": 0.20909424126148224, 
      "sent": "The class action case was dismissed in early 2015, as was a similar suit, in which Google canceled a site's account when it allegedly owed $535,000, then later reinstated it, but didn't pay the money."
    }, 
    {
      "index": 233, 
      "score": 0.20894408226013184, 
      "sent": "theres obviously no excuse for me using that word, and despite the fact that it would be difficult for a 13 year old australian to understand american racial politics, everyone, including me, knows that it is not appropriate and i'm so frustrated and disgusted at my 13 year old self for thinking that it was acceptable, especially now after I have taken history and we had a whole semester on civil rights and slavery in america and to have a better understanding of the racial issues which were and are still present in america make me even more ashamed of my actions There are still (false) rumors floating around that Pizza was terminated by Tumblr for being racist."
    }, 
    {
      "index": 28, 
      "score": 0.20857085287570953, 
      "sent": "In June 2014, Pizza had more than 1 million followers and was the biggest star of the Tumblr teen comedy world."
    }, 
    {
      "index": 490, 
      "score": 0.2071307897567749, 
      "sent": "Facebook's algorithms make it hard to get their content in front of much more than 10 percent of the people who like their pages."
    }, 
    {
      "index": 36, 
      "score": 0.20712514221668243, 
      "sent": "A fake conspiracy blog joked she quit after leaving the illuminati because of a fight with Beyonce over \"how to wittily answer anonymous hate mail.\""
    }, 
    {
      "index": 341, 
      "score": 0.20651824772357941, 
      "sent": "The three of them started to think about building a company that would connect brands to Tumblr blogs and cut out the middleman--or better yet, become the middleman and take a cut."
    }, 
    {
      "index": 16, 
      "score": 0.20594874024391174, 
      "sent": "Once, when a user wrote \"so is tumblr user pizza god or beyonce,\" she dug up the post and reblogged it with the comment \"I'd like to confirm that i am both.\""
    }, 
    {
      "index": 391, 
      "score": 0.20593774318695068, 
      "sent": "It resulted in a huge conversion rate--as high as 10 percent--by featuring before-and-after photos claiming people had lost weight with the pills, and a video of Dr. Oz claiming they burn fat."
    }, 
    {
      "index": 355, 
      "score": 0.20559245347976685, 
      "sent": "Lilley would eventually recruit a few hundred kids, mostly teen humor blogs, whose combined Tumblrs would total an estimated 35 million followers."
    }, 
    {
      "index": 383, 
      "score": 0.20558822154998779, 
      "sent": "If a person clicked on the ad, went to the site, and bought a bottle of pills containing synthetic raspberry ketone, the Tumblr user who reblogged the ad would get $18--after Exposely took a $20 cut."
    }, 
    {
      "index": 178, 
      "score": 0.2049778550863266, 
      "sent": "They found text converted into an image performed better when the second sentence was the longest; a post with a high ratio of notes to comments was a sign a community cared deeply about a subject; typos weren't always bad, because you have to share a Facebook post to comment on it, and people shared typo-marred posts to make fun of the mistake."
    }, 
    {
      "index": 379, 
      "score": 0.20411652326583862, 
      "sent": "The ads tracked which Tumblr sent the traffic, and the teens were paid 75 percent of the ad revenue for each click."
    }, 
    {
      "index": 244, 
      "score": 0.20407773554325104, 
      "sent": "So-Relatable was trying to build its Twitter presence, so they agreed to exchange promotional posts with Hegstad."
    }, 
    {
      "index": 287, 
      "score": 0.20296531915664673, 
      "sent": "Wong's mom couldn't pay his college tuition, so he's using Tumblr to pay for it himself."
    }, 
    {
      "index": 146, 
      "score": 0.20288428664207458, 
      "sent": "Lilley and Greenfield graduated high school in the summer of 2012; by the fall So-Relatable had more than 200,000 followers and was making a couple thousand dollars a month."
    }, 
    {
      "index": 385, 
      "score": 0.20267811417579651, 
      "sent": "In its natural form it is very expensive, and is often used by the perfume industry."
    }, 
    {
      "index": 299, 
      "score": 0.20252241194248199, 
      "sent": "Lilley had wanted to get out of his hometown for years and proposed moving in with Hegstad in L.A."
    }, 
    {
      "index": 15, 
      "score": 0.20228523015975952, 
      "sent": "Pizza's strategy was brilliant: When a random Tumblr would write about \"pizza\"--either the food or herself--she'd reblog the post to her huge audience."
    }, 
    {
      "index": 38, 
      "score": 0.20219063758850098, 
      "sent": "A Reddit user called her blog's death \"one of the biggest scandals to have ever happened on Tumblr.\""
    }, 
    {
      "index": 300, 
      "score": 0.20211826264858246, 
      "sent": "I was skeptical about these numbers, so I asked Lilley and Greenfield to drive me to their bank and print out their records."
    }, 
    {
      "index": 465, 
      "score": 0.20206210017204285, 
      "sent": "Lilley argued that Twitter never bans people for tweeting diet pill ads, but his many, many emails to Tumblr have led nowhere."
    }, 
    {
      "index": 428, 
      "score": 0.20118603110313416, 
      "sent": "\"That same month, Lilley wrote another Tumblr user, \"in a few months I bet we'll be doing milli's."
    }, 
    {
      "index": 367, 
      "score": 0.20103722810745239, 
      "sent": "When Miller had started making money off of her Tumblr, her mother had to create the PayPal account for her because she was under 18, but the bank account was solely Miller's."
    }, 
    {
      "index": 413, 
      "score": 0.20097196102142334, 
      "sent": "Trending.ly got almost 7 million views that month, and with the diet pill ads, they sometimes achieved a conversion rate near 10 percent."
    }, 
    {
      "index": 380, 
      "score": 0.20041467249393463, 
      "sent": "The pay-per-conversion program could make more money, but it cost its users something else entirely."
    }, 
    {
      "index": 125, 
      "score": 0.2002023458480835, 
      "sent": "Lilley's first YouTube hit was posting the audio of President Obama calling Kanye West a jackass for interrupting Taylor Swift at the 2009 Video Music Awards."
    }, 
    {
      "index": 377, 
      "score": 0.20018988847732544, 
      "sent": "The pay-per-click scheme worked like this: Exposely set up three garbage content sites with mindless slide shows--14 Celebrities That Look Like Mattresses--called Trending.ly, Styles.ly, and Eats.ly."
    }, 
    {
      "index": 49, 
      "score": 0.19961678981781006, 
      "sent": "You can start as many Tumblrs as you like, one for each slice of your personality, whether that's gymnastics fandom (how I got into Tumblr) or Barack Obama-Harry Styles slashfic (it exists) or akoisexual identity (when your feelings of sexual attraction fade once they're reciprocated)."
    }, 
    {
      "index": 353, 
      "score": 0.19911116361618042, 
      "sent": "Hegstad hired a developer, Greenfield worked on support, while Lilley recruited bloggers from Tumblr, focusing on users with the biggest accounts."
    }, 
    {
      "index": 48, 
      "score": 0.19864241778850555, 
      "sent": "On Tumblr, you can revel in anonymity, say whatever you want without fear of it going on your permanent record."
    }, 
    {
      "index": 275, 
      "score": 0.19855049252510071, 
      "sent": "Though they'd exploited Tom's failures, he got the better of them in the end."
    }, 
    {
      "index": 414, 
      "score": 0.1984974592924118, 
      "sent": "Once, across all their blogs, Exposely made $24,000 in a single day."
    }, 
    {
      "index": 492, 
      "score": 0.19823025166988373, 
      "sent": "When I visited Lilley and Greenfield last September, they were earning around $8,000 a month posting ads for surveys on their remaining blogs, which was OK, but they wanted more."
    }, 
    {
      "index": 323, 
      "score": 0.19807715713977814, 
      "sent": "There were parties at the loft, on the rooftop, but the guest list was selective--either people they worked with or could possibly work with, because Hegstad, Greenfield recalled, didn't \"associate with the plebes.\""
    }, 
    {
      "index": 364, 
      "score": 0.19796949625015259, 
      "sent": "Even before Exposely, they'd had a business relationship: Lilley and Greenfield paid her $10 to reblog three posts to her huge audience."
    }, 
    {
      "index": 86, 
      "score": 0.19778063893318176, 
      "sent": "This brand of Tumblr humor often focuses on what I think of as micro-humiliations, tiny moments of social awkwardness that can feel absolutely crushing for a teenager figuring out how to be a person in the world."
    }, 
    {
      "index": 61, 
      "score": 0.19772221148014069, 
      "sent": "In a joke that explains the dynamic, a user posted a screenshot showing he had 264 followers, writing: a darkened auditorium with 264 silent people in the seats."
    }, 
    {
      "index": 356, 
      "score": 0.1976679265499115, 
      "sent": "His recruits included the biggest teen comedy blog of all: Pizza.Jess Miller was 16 in the spring of 2014."
    }, 
    {
      "index": 513, 
      "score": 0.19743348658084869, 
      "sent": "Having spent several years among teens who have freely laid bare their inside jokes, their Facebook messages, and their deepest thoughts, I think there are three phases of understanding the teens."
    }, 
    {
      "index": 65, 
      "score": 0.19740843772888184, 
      "sent": "But I soon discovered a secret world hidden in plain sight, one in which teenagers, through wit and luck, had stumbled into a new kind of viral fame and fortune, by outsmarting internet ad networks and finding ways to earn thousands and even hundreds of thousands of dollars from their intentionally unambitious jokes."
    }, 
    {
      "index": 137, 
      "score": 0.19712285697460175, 
      "sent": "\"Relatable\" has a slightly different meaning on the teen internet than in the adult world, and even its purveyors struggle to describe it."
    }, 
    {
      "index": 75, 
      "score": 0.19706785678863525, 
      "sent": "He became my Tumblr oracle, giving me in-depth analysis of the Tumblr economy and its emotional core."
    }, 
    {
      "index": 454, 
      "score": 0.19673335552215576, 
      "sent": "After all, Tumblr ran ads for diet pills too, Lilley sent me a screenshot of one--among several bottles was one containing raspberry ketones."
    }, 
    {
      "index": 386, 
      "score": 0.19642883539199829, 
      "sent": "Synthetic raspberry ketone, however, is cheaper to produce, and when Dr. Oz hailed the substance as a miracle fat-burner in 2012, he began a raspberry ketone media frenzy."
    }, 
    {
      "index": 264, 
      "score": 0.19594331085681915, 
      "sent": "However, Google forbids \"click fraud\"--you can't just click on an ad on your own blog all day and watch the money come in."
    }, 
    {
      "index": 429, 
      "score": 0.19592595100402832, 
      "sent": "We got our biggest check ever from Adsense coming for Exposely, 160k coming."
    }, 
    {
      "index": 407, 
      "score": 0.19477228820323944, 
      "sent": "The posts showed the familiar diptych of a woman looking self-conscious and curvy on the left and happy and thin on the right, and underneath, a testimony about pounds melting off without pain and suffering."
    }, 
    {
      "index": 113, 
      "score": 0.19455944001674652, 
      "sent": "The Washington Post has written, \"Tumblr might just be the new ground zero of the viral internet.\""
    }, 
    {
      "index": 116, 
      "score": 0.19449932873249054, 
      "sent": "Of course have seen that meme, and all 5000 of it's variants, 3 and a half months ago."
    }, 
    {
      "index": 512, 
      "score": 0.19433476030826569, 
      "sent": "That we would soon depart for a thirtieth birthday party was no coincidence--you don't have to fear the teens if you can live in denial about your own looming obsolescence."
    }, 
    {
      "index": 463, 
      "score": 0.19391998648643494, 
      "sent": "\"Where it crosses the line is if they're abusing the viral mechanisms of Tumblr."
    }, 
    {
      "index": 474, 
      "score": 0.19363017380237579, 
      "sent": "By then, many of Exposely's sources of revenue had disappeared."
    }, 
    {
      "index": 57, 
      "score": 0.19357219338417053, 
      "sent": "Viral fame on Tumblr in the early 2010s was an uncertain path to fortune."
    }, 
    {
      "index": 121, 
      "score": 0.19349443912506104, 
      "sent": "This is partially due to the success of Zach Lilley and Jeremy Greenfield, middle school friends who wanted to get into internet comedy when they were high school juniors."
    }, 
    {
      "index": 339, 
      "score": 0.19347456097602844, 
      "sent": "With traffic on the rise, Hegstad suggested they move to DoubleClick, Google's premium ad network, and the move made October their biggest monthly payout to date: $54,269.33."
    }, 
    {
      "index": 19, 
      "score": 0.19320715963840485, 
      "sent": "After Ellen DeGeneres ordered 20 large pies at the 2014 Academy Awards, Pizza dashed off the line \"did u guys see me at the Oscars.\""
    }, 
    {
      "index": 52, 
      "score": 0.19318372011184692, 
      "sent": "Tumblr's templates were more customizable than Facebook, making it a good place to put your portfolio, perhaps some journal entries."
    }, 
    {
      "index": 437, 
      "score": 0.19298720359802246, 
      "sent": "They'd been terminated, their blogs revoked by Tumblr for violating its terms of service."
    }, 
    {
      "index": 378, 
      "score": 0.19266092777252197, 
      "sent": "There were ads on each page of the slide show, and the kids would post a couple slides from the site on their Tumblrs, with the right headline and text along the lines of omg this is so funny."
    }, 
    {
      "index": 279, 
      "score": 0.19248682260513306, 
      "sent": "Though Tom is handsome, he lacks an easy charisma and JusstTom is not very popular."
    }, 
    {
      "index": 13, 
      "score": 0.19229678809642792, 
      "sent": "She then changed her domain to pizza.tumblr.com, her followers started to call her Pizza, and her numbers began to climb."
    }, 
    {
      "index": 480, 
      "score": 0.19200074672698975, 
      "sent": "In February 2015, Lilley and Greenfield left the loft in downtown L.A. and returned to Reading."
    }, 
    {
      "index": 381, 
      "score": 0.19164858758449554, 
      "sent": "Hegstad got an account at a health affiliate network--a snake-oil sales depot."
    }, 
    {
      "index": 20, 
      "score": 0.19157058000564575, 
      "sent": "The post received almost 500,000 notes and was reblogged by John Green, author of The Fault in Our Stars, with the comment \"You looked great, pizza."
    }, 
    {
      "index": 368, 
      "score": 0.19134394824504852, 
      "sent": "Her mother told me at her peak her daughter was making $2,800 to $8,400 a week in U.S. dollars--more than she herself earned as a Melbourne-area real estate agent."
    }, 
    {
      "index": 411, 
      "score": 0.19131411612033844, 
      "sent": "But \" 'Here's how I did it: with this organic supplement my best friend recommended'--just seemed to me more real-sounding and ... just makes it seem like in the back of someone's mind they could think, well, my best friend could have recommended this to me.\""
    }, 
    {
      "index": 471, 
      "score": 0.19088280200958252, 
      "sent": "\"In Hegstad's model, clients are charged a fee for services that include affiliate marketing, lead generation, and content distribution."
    }, 
    {
      "index": 516, 
      "score": 0.19064584374427795, 
      "sent": "Finally, you recognize the shape of the adults they'll become, corrupted by money and vanity and hubris just like everyone else."
    }, 
    {
      "index": 412, 
      "score": 0.19040839374065399, 
      "sent": "Exposely's diet pill scheme got going in April 2014, and it worked--it worked like crazy."
    }, 
    {
      "index": 393, 
      "score": 0.19032639265060425, 
      "sent": "\"The whole point of the video was to reinforce that this is a real thing, this has been on television even,\" Lilley said."
    }, 
    {
      "index": 394, 
      "score": 0.19025874137878418, 
      "sent": "\"It was just crazy how much it worked,\" he said, not of the pills, but of the landing page."
    }, 
    {
      "index": 180, 
      "score": 0.19022691249847412, 
      "sent": "When they posted a recipe for a snack on another of their blogs, Lifehackable, readers would comment with photos of their version, and Lifehackable would reblog them."
    }, 
    {
      "index": 284, 
      "score": 0.18967197835445404, 
      "sent": "The two had chosen to build their empire by not focusing on their own personalities."
    }, 
    {
      "index": 267, 
      "score": 0.18959642946720123, 
      "sent": "There are a handful of secret Facebook groups and multi-member chats for Tumblr users with high follower counts--between 10,000 and 100,000 or even more--with names like Wallflowers 2.0 and GOATS."
    }, 
    {
      "index": 66, 
      "score": 0.1894211620092392, 
      "sent": "Tumblr headquarters in New York is brightly lit and slightly too warm, outfitted with huge screens displaying viral teen content and yellow T-shirts commemorating the time Taylor Swift wore a Tumblr joke shirt."
    }, 
    {
      "index": 258, 
      "score": 0.1889444887638092, 
      "sent": "\"In a sense, Yahoo faces the same problem as Tumblr users: There isn't a lot of money in banner ads."
    }, 
    {
      "index": 217, 
      "score": 0.18883994221687317, 
      "sent": "Almost her entire teenage life has been lived on Tumblr, and over the past five years, her fame spread offline."
    }, 
    {
      "index": 325, 
      "score": 0.18883885443210602, 
      "sent": "There were friendly people in the city, for sure, but when Lilley met other people in his business, like the people at the roof parties, they always seemed to want something."
    }, 
    {
      "index": 485, 
      "score": 0.18845981359481812, 
      "sent": "Lilley showed me emails he exchanged with ChaCha's financial controller."
    }, 
    {
      "index": 321, 
      "score": 0.18824993073940277, 
      "sent": "At 19, neither Lilley nor Greenfield were old enough to drink; they couldn't enjoy the free beer on tap at the WeWork office they rented, much less get into clubs."
    }, 
    {
      "index": 376, 
      "score": 0.18806999921798706, 
      "sent": "Exposely offered its publishers both pay per click and pay per conversion."
    }, 
    {
      "index": 122, 
      "score": 0.18798062205314636, 
      "sent": "In 2011, they bought ROFLnow.com and created social media accounts, including a Tumblr, to promote the site."
    }, 
    {
      "index": 132, 
      "score": 0.18788674473762512, 
      "sent": "When he posted the video he was 15, and it currently has more than 177,000 views."
    }, 
    {
      "index": 239, 
      "score": 0.187839075922966, 
      "sent": "Then 23, Hegstad had built an audience on MySpace by posting selfies; thin and sleek and handsome, with long, straight, light-brown ombre hair, he resembles a human Afghan hound."
    }, 
    {
      "index": 142, 
      "score": 0.18779323995113373, 
      "sent": "A Google Images search of \"relatable\" turns up hundreds of their posts, plus many by imitators, even though the blog So-Relatable has disappeared, like Pizza, from the internet."
    }, 
    {
      "index": 226, 
      "score": 0.18768484890460968, 
      "sent": "Arrowsmith is a realtor, and once, while showing a family a house, she mentioned her kids sat at home on the internet all day."
    }, 
    {
      "index": 354, 
      "score": 0.18685023486614227, 
      "sent": "Through So-Relatable they'd met many users with high follower counts--the same kids who were trading promotional links in the Facebook groups."
    }, 
    {
      "index": 459, 
      "score": 0.1867457777261734, 
      "sent": "\"It's easier to be tempted by stuff that promises you the most money or the most return for your reach."
    }, 
    {
      "index": 295, 
      "score": 0.18655242025852203, 
      "sent": "At first, Lilley and Greenfield just wanted to make enough money to pay their way to the annual YouTube-sponsored conference, VidCon, in Los Angeles, but their vision expanded as So Relatable Inc. took off."
    }, 
    {
      "index": 248, 
      "score": 0.18649929761886597, 
      "sent": "So that means most eyes, and the most dedicated fans, rarely if ever see those banner ads."
    }, 
    {
      "index": 134, 
      "score": 0.18648186326026917, 
      "sent": "But the first time it made more than $50 in a day with a banner ad from Google AdSense, they realized Tumblr could be a thing."
    }, 
    {
      "index": 278, 
      "score": 0.186284139752388, 
      "sent": "Now Lifehackable.com--which once made $1,963 in a single day--redirects to the YouTube channel."
    }, 
    {
      "index": 401, 
      "score": 0.18610380589962006, 
      "sent": "\"The idea was to make an ad that looks like word of mouth from a fellow user,\" he said."
    }, 
    {
      "index": 310, 
      "score": 0.1860528439283371, 
      "sent": "\"In the summer of 2013, Lilley and Greenfield moved into a historic bank building converted into lofts with original art deco details in downtown Los Angeles; scenes from The Dark Knight Rises and Spiderman 2 had been filmed in the lobby."
    }, 
    {
      "index": 457, 
      "score": 0.18599863350391388, 
      "sent": "\"Even the most savvy online teens can sometimes fall victim to the modern spammer,\" Danielle Strle said when I asked about the Great Termination."
    }, 
    {
      "index": 418, 
      "score": 0.18589305877685547, 
      "sent": "Lilley had to explain to Miller she had to fill out a tax form--\"we need to have everyone fill one out like to run our business legitimately and stuff.\""
    }, 
    {
      "index": 456, 
      "score": 0.18572744727134705, 
      "sent": "\")This has not changed Tumblr's mind about the banned users."
    }, 
    {
      "index": 147, 
      "score": 0.18570473790168762, 
      "sent": "In October, they filed as an S-corporation, So Relatable Inc., and split the shares 50-50."
    }, 
    {
      "index": 59, 
      "score": 0.18554536998271942, 
      "sent": "While other social networks like Facebook, Twitter, and LinkedIn generated billions upon billions of dollars, Tumblr gradually evolved into a fast-moving conversation focused on jokes, art, and sex."
    }, 
    {
      "index": 37, 
      "score": 0.18541125953197479, 
      "sent": "A rumor spread her blog was terminated for being racist."
    }, 
    {
      "index": 446, 
      "score": 0.1851026862859726, 
      "sent": "One user heard of another user who got her blog back by claiming she had cancer; another said they were related to a lawyer; and slowly the messages revealed the cruel social dynamics of high school:its just sad because all the friends ive made and stuffyeah i feel that ... but most of my real tumblr friends have left nowand the fact that like half our friends wrote us off like we literally got kicked out of the high fc humor blog club lmao i just don't understand how the hell people could be so two facedI hate most of the new people Especially the new people that think they're top shit theres always like waves of new people on tumblr that rise up and make it shittieri remember hitting 25k on my blog at the end of 2k12 and being so happy Miller was invited to the chat, but as was often the case, she was talked about far more than she actually talked."
    }, 
    {
      "index": 440, 
      "score": 0.18510086834430695, 
      "sent": "Blogs that had brought relief from unremitting high school agony and then miraculously made their teen creators more money than they could have ever imagined, were erased from the internet, except for fragments reblogged on other sites."
    }, 
    {
      "index": 124, 
      "score": 0.18498189747333527, 
      "sent": "Lilley and Greenfield grew up with the internet as a toy, competing with friends to make the most viral video, pranking adults at a strip mall within walking distance of their homes in Reading, Pennsylvania, when they weren't old enough to drive."
    }, 
    {
      "index": 169, 
      "score": 0.18494886159896851, 
      "sent": "But if an unfamiliar feeling was mentioned often enough online, Greenfield would write about it."
    }, 
    {
      "index": 486, 
      "score": 0.18488995730876923, 
      "sent": "\"Unfortunately, the program has not been profitable for us, so now we must make some difficult changes."
    }, 
    {
      "index": 479, 
      "score": 0.18488386273384094, 
      "sent": "\"A lot of the Tumblr bloggers who were using Exposely a year ago that haven't used it in almost a year have lost their blogs.\""
    }, 
    {
      "index": 432, 
      "score": 0.18472814559936523, 
      "sent": "In July 2014, Exposely was banned from AdSense too."
    }, 
    {
      "index": 192, 
      "score": 0.18463335931301117, 
      "sent": "\"Tom knew what was happening, and so then he was more incentivized to actually not do his job right,\" Lilley said."
    }, 
    {
      "index": 50, 
      "score": 0.18453723192214966, 
      "sent": "A Tumblr staffer pointed me to a blog called Dolph Lundgren & His Action Nips, which is just shirtless photos of the actor with his nipples turned into blinking GIFs."
    }, 
    {
      "index": 34, 
      "score": 0.18453550338745117, 
      "sent": "Tumblr users began to piece together the mystery of her disappearance."
    }, 
    {
      "index": 280, 
      "score": 0.18433001637458801, 
      "sent": "His videos are about dating advice, and together we watched him explain what to do when a guy won't text you back."
    }, 
    {
      "index": 9, 
      "score": 0.18369542062282562, 
      "sent": "They were the kind of images you might find under the \"summery\" Tumblr tag: poolside drinks, sunsets, sundresses, palm trees, tiny succulents; a shopping list of the things she wanted to buy, if only she had the money."
    }, 
    {
      "index": 41, 
      "score": 0.18362739682197571, 
      "sent": "On Facebook, every link you share and photo you post is a statement of your identity."
    }, 
    {
      "index": 359, 
      "score": 0.18360921740531921, 
      "sent": "Her boyfriend started a Tumblr with the user name Moistbottom, and while they didn't really write about their relationship, they were the subject of intense fan interest."
    }, 
    {
      "index": 263, 
      "score": 0.18299293518066406, 
      "sent": "With AdSense banners, users get paid when a reader clicks or views an ad."
    }, 
    {
      "index": 416, 
      "score": 0.18287406861782074, 
      "sent": "Lilley showed me messages asking when they'd get their money--pay-for-click was monthly, pay-for-conversion was weekly--often doing the math to make sure they were paid for all conversions."
    }, 
    {
      "index": 509, 
      "score": 0.1827780157327652, 
      "sent": "The conversation turned to teens; the consensus was that modern kids are dumb and boring."
    }, 
    {
      "index": 64, 
      "score": 0.182546466588974, 
      "sent": "When I began reporting on the world of Tumblr teens, I first wanted to explain the absurdist comedy of Pizza and dozens of other Tumblrs like hers."
    }, 
    {
      "index": 161, 
      "score": 0.18254521489143372, 
      "sent": "After studying their mannerisms and hearing Lilley's repeated allusions to Greenfield's math skills and superior memory--he was briefly a mechatronics engineering major--I determined they were nerds."
    }, 
    {
      "index": 172, 
      "score": 0.18252302706241608, 
      "sent": "At one point, Lilley and Greenfield noticed, 65 percent of the So-Relatable readership was female."
    }, 
    {
      "index": 306, 
      "score": 0.18228821456432343, 
      "sent": "The unpredictable waves of virality made the Google payments go up and down based on how many people visited their site--$9,113.04 in May 2013, $18,805.09 in June."
    }, 
    {
      "index": 253, 
      "score": 0.18213324248790741, 
      "sent": "In April 2012 sponsored content began appearing in users' streams."
    }, 
    {
      "index": 347, 
      "score": 0.18159826099872589, 
      "sent": "A class action lawsuit was filed against Google in 2014, and Business Insider noted, \"Google often behaves so mysteriously that many advertisers and publishers will actually welcome the suit: It may finally shed some light on exactly how and why Google kicks web sites out of its vast, $60 billion-a-year advertising system.\""
    }, 
    {
      "index": 231, 
      "score": 0.18159025907516479, 
      "sent": "At one point, according to Miller, she had 9,500 concurrent visitors on her blog and she received over 2,000 angry messages, some of them telling her to kill herself."
    }, 
    {
      "index": 384, 
      "score": 0.18144808709621429, 
      "sent": "Raspberry ketone is a compound that gives raspberries their distinctive smell and taste."
    }, 
    {
      "index": 277, 
      "score": 0.18118931353092194, 
      "sent": "\"As if we'd never notice that all the ads changed to be about Tom and put his face on them,\" Greenfield said."
    }, 
    {
      "index": 243, 
      "score": 0.18118323385715485, 
      "sent": "He had figured out how to monetize it, but he wanted to get into Tumblr."
    }, 
    {
      "index": 88, 
      "score": 0.18070873618125916, 
      "sent": "Sometimes those one-liners spread across continents, tweaked by thousands of other teens who add their own jokes as they reblog the original."
    }, 
    {
      "index": 283, 
      "score": 0.18044979870319366, 
      "sent": "Lilley was disgusted by the thought of \"trying to build a personal brand by sacrificing your content.\""
    }, 
    {
      "index": 164, 
      "score": 0.18006370961666107, 
      "sent": "So I gently asked Greenfield how he was able to make these minute social observations that hinge on complex emotions being expressed in subtle facial expressions when, perhaps, this was not his strong suit in real life."
    }, 
    {
      "index": 232, 
      "score": 0.17990860342979431, 
      "sent": "When I asked Miller about the posts, she sent me a long apologetic message:i now completely understand how horrible and ignorant they were and take full responsibility for them."
    }, 
    {
      "index": 470, 
      "score": 0.17973214387893677, 
      "sent": "\"He's not just tweeting for fun; he's tweeting for big money--and he's winning,\" the magazine wrote."
    }, 
    {
      "index": 340, 
      "score": 0.17972485721111298, 
      "sent": "Lilley and Greenfield's tax returns showed they made $249,000 that year."
    }, 
    {
      "index": 298, 
      "score": 0.17938420176506042, 
      "sent": "It was lot of money for internet jokes, a lot of money for two 18-year-olds from Reading, Pennsylvania."
    }, 
    {
      "index": 76, 
      "score": 0.17911987006664276, 
      "sent": "Wong started asian.tumblr.com to deal with being bullied at his Florida high school."
    }, 
    {
      "index": 497, 
      "score": 0.17885084450244904, 
      "sent": "WordPress gives them more freedom, but the sites haven't gotten much traction."
    }, 
    {
      "index": 357, 
      "score": 0.17854362726211548, 
      "sent": "She had just weathered the racism controversy and now had more than half a million followers."
    }, 
    {
      "index": 227, 
      "score": 0.17802579700946808, 
      "sent": "The clients' daughter was about 13, and said she had a Tumblr."
    }, 
    {
      "index": 60, 
      "score": 0.17794319987297058, 
      "sent": "The culture of Tumblr began to be dominated by teens--weird teens."
    }, 
    {
      "index": 262, 
      "score": 0.17793886363506317, 
      "sent": "It considers these posts \"spam,\" and will terminate an account for posting  too many affiliate advertising links, or anything the company deems \"non-genuine social gestures.\""
    }, 
    {
      "index": 238, 
      "score": 0.17786175012588501, 
      "sent": "In November 2012, Lilley and Greenfield were contacted by Dennis Hegstad."
    }, 
    {
      "index": 221, 
      "score": 0.17751620709896088, 
      "sent": "Miller's mom, Jodie Arrowsmith, didn't know she was on Tumblr for the first few years."
    }, 
    {
      "index": 26, 
      "score": 0.17718255519866943, 
      "sent": "@RelatableQuotes's version gathered 2,958 retweets and 4,425 favorites."
    }, 
    {
      "index": 17, 
      "score": 0.17704020440578461, 
      "sent": "Users marveled at how quickly she responded, how you could \"summon Pizza.\""
    }, 
    {
      "index": 273, 
      "score": 0.17681489884853363, 
      "sent": "The blog must be refreshed until a better-paying ad shows up, like one from a bank."
    }, 
    {
      "index": 82, 
      "score": 0.17665910720825195, 
      "sent": "\"In the dark ages--the 1980s, '90s, or even the early 2000s--kids had to wait for nerd camp to be among their own kind."
    }, 
    {
      "index": 25, 
      "score": 0.17646810412406921, 
      "sent": "The joke was copied like crazy by humor accounts on Facebook, Pinterest, and Twitter."
    }, 
    {
      "index": 40, 
      "score": 0.17638593912124634, 
      "sent": "\"Each social media network creates a particular kind of teenage star: Those blessed with early-onset hotness are drawn to YouTube, the fashionable and seemingly wealthy post to Instagram, the most charismatic actors, dancers, and comedians thrive on Vine."
    }, 
    {
      "index": 90, 
      "score": 0.1762528270483017, 
      "sent": "Some posts get more than a million notes--imagine a joke whispered in biology class getting a laugh from a city the size of San Francisco."
    }, 
    {
      "index": 68, 
      "score": 0.17611101269721985, 
      "sent": "At one point she opened her laptop to scan for some examples and got lost in the content."
    }, 
    {
      "index": 441, 
      "score": 0.17610794305801392, 
      "sent": "The day before, if they'd had a funny thought, they could share it with half a million people."
    }, 
    {
      "index": 73, 
      "score": 0.17601829767227173, 
      "sent": "\"These teens are better marketers than anyone else in the game right now\"Tumblr teens have an advantage that makes them good at digital strategy: an advanced emotional intelligence."
    }, 
    {
      "index": 430, 
      "score": 0.17592212557792664, 
      "sent": "That's for everyone that posted rev-share including us but still.\""
    }, 
    {
      "index": 314, 
      "score": 0.17549504339694977, 
      "sent": "Hegstad had the room at the top of the stairs, \"like he was king of the jungle.\""
    }, 
    {
      "index": 35, 
      "score": 0.17529936134815216, 
      "sent": "They wrote mournful posts: \"i miss tumblr user pizza *insert titanic 'come back' gif*.\""
    }, 
    {
      "index": 365, 
      "score": 0.17527416348457336, 
      "sent": "Miller was \"very fair with her prices,\" Lilley said."
    }, 
    {
      "index": 23, 
      "score": 0.17512081563472748, 
      "sent": "\"One of Pizza's most successful posts was \"josh hutcherson's parents are probably called josh hutcherdad and josh hutchermom.\""
    }, 
    {
      "index": 402, 
      "score": 0.17510412633419037, 
      "sent": "It's easy to ignore a TV spot by a stranger, \"but if it's presented to you in a way that she's your peer, she's a similar person to you, you don't even know her in the same way, but it feels different."
    }, 
    {
      "index": 91, 
      "score": 0.17502397298812866, 
      "sent": "\"Increasingly, the lingua franca is absurdist dada,\" explained Strle, usually rendered in the uncapitalized and unpunctuated casualness of instant messages."
    }, 
    {
      "index": 215, 
      "score": 0.17467072606086731, 
      "sent": "Jess Miller is a 18-year-old recent high school graduate who lives in Melbourne, Australia."
    }, 
    {
      "index": 194, 
      "score": 0.17438660562038422, 
      "sent": "At Tumblr headquarters, I found myself in a contest of name-dropping teenagers' URLs, much the same way people dropped indie rock bands in college."
    }, 
    {
      "index": 77, 
      "score": 0.17435543239116669, 
      "sent": "Wong explained that teens perform joy on Instagram but confess sadness on Tumblr."
    }, 
    {
      "index": 326, 
      "score": 0.17433565855026245, 
      "sent": "One guest was a British YouTube star who Lilley and Greenfield found repellent."
    }, 
    {
      "index": 417, 
      "score": 0.1742146909236908, 
      "sent": "One kid messaged Lilley, \"i'm so proud of you and all your hard work.\""
    }, 
    {
      "index": 408, 
      "score": 0.17380434274673462, 
      "sent": "\"'My best friend recommended it' was one of my more major contributions,\" Lilley said."
    }, 
    {
      "index": 464, 
      "score": 0.17365889251232147, 
      "sent": "\"In addition to \"non-genuine social gestures,\" Tumblr terminates blogs for \"spam or affiliate marketing\" and \"deceptive means to generate traffic/revenue.\""
    }, 
    {
      "index": 500, 
      "score": 0.17350426316261292, 
      "sent": "He still feels responsible for the end of Pizza, and he still can't believe she's gone."
    }, 
    {
      "index": 131, 
      "score": 0.17329154908657074, 
      "sent": "I thought he meant \"meta\" as in self-referential, but he meant meta like metadata, as in search engine optimization."
    }, 
    {
      "index": 103, 
      "score": 0.17281548678874969, 
      "sent": "Heartbreak is a recurring theme on these Tumblrs, so is skewering the chipper but futile commands of self-help."
    }, 
    {
      "index": 143, 
      "score": 0.17240509390830994, 
      "sent": "After launching, they landed 20,000 followers in their first month with a simple formula: a relatable one-liner--\"When the internet stops working for 5 seconds, so does my heart\"--framed by a pastel or white rectangle."
    }, 
    {
      "index": 449, 
      "score": 0.17230218648910522, 
      "sent": "In the group chat, kids were puzzled by the intensity of the emotion Miller inspired."
    }, 
    {
      "index": 141, 
      "score": 0.17186528444290161, 
      "sent": "I saw this in the quiet rage at how your social status can be determined by patently stupid actions, like the grave consequences for the tiniest infractions in high school:\"ur bra strap is showing\" u say children begin to scream tears r streaming down my face my parents disown me and sell me to a shady, moustached man for three goats no one can ever kno i wear a bra Lilley and Greenfield didn't coin the term \"relatable,\" but they made it popular, helping to solidify its internet meaning."
    }, 
    {
      "index": 249, 
      "score": 0.17140713334083557, 
      "sent": "Tumblr has always had a complicated relationship with money."
    }, 
    {
      "index": 51, 
      "score": 0.17108410596847534, 
      "sent": "When Tumblr launched in 2007, the simple layout--text, photo, quote, link, chat, audio, video--was its primary appeal: less bloggy than Blogger, less puzzling than WordPress."
    }, 
    {
      "index": 179, 
      "score": 0.1708376407623291, 
      "sent": "Lilley and Greenfield interacted with followers as well."
    }, 
    {
      "index": 240, 
      "score": 0.1707397997379303, 
      "sent": "He had built his online brand though his looks and taste, later producing a popular T-shirt that said, \"Blow kisses not coke.\""
    }, 
    {
      "index": 338, 
      "score": 0.17064052820205688, 
      "sent": "So-Relatable and its associated blogs had a good summer, and in September they made $24,296.26 with Google AdSense."
    }, 
    {
      "index": 369, 
      "score": 0.16980567574501038, 
      "sent": "In Facebook messages, Lilley congratulated Miller on reaching new milestones."
    }, 
    {
      "index": 309, 
      "score": 0.16980551183223724, 
      "sent": "Greenfield later admitted, \"I actually didn't meet him or ever have a single conversation with him online until the day before we signed the lease."
    }, 
    {
      "index": 47, 
      "score": 0.1693563312292099, 
      "sent": "You don't tell people your Tumblr URL, you aren't logging the banalities of your day--you aren't even you."
    }, 
    {
      "index": 123, 
      "score": 0.16917470097541809, 
      "sent": "They soon realized their Tumblr was performing better than the web site it was supposed to promote."
    }, 
    {
      "index": 332, 
      "score": 0.16881747543811798, 
      "sent": "Because if you're on our roof, there's at any given time hundreds of people that can see you."
    }, 
    {
      "index": 282, 
      "score": 0.16828131675720215, 
      "sent": "Greenfield added, \"He had a great revenue source and just threw it in the trash.\""
    }, 
    {
      "index": 18, 
      "score": 0.16807281970977783, 
      "sent": "It made her seem all-knowing, but not superior."
    }, 
    {
      "index": 399, 
      "score": 0.16803111135959625, 
      "sent": "\"Lilley wrote the diet pill ads, and as with all his work on Tumblr, he did it very well."
    }, 
    {
      "index": 108, 
      "score": 0.16778145730495453, 
      "sent": "The best social commentary on American culture's obsession with women's pubic hair was written by some kid on Tumblr: \"Just so you know, the carpet matches the drapes,\" Medusa said with a wink so sexual that it made me feel like I had to pee."
    }, 
    {
      "index": 250, 
      "score": 0.1677011251449585, 
      "sent": "In 2010, its founder, David Karp, said, \"We're pretty opposed to advertising."
    }, 
    {
      "index": 252, 
      "score": 0.16738441586494446, 
      "sent": "Then in 2011: \"Making money off of Tumblr would be incredibly easy\"--he'd throw up an AdSense ad on every user's dashboard and make the site \"wildly profitable.\""
    }, 
    {
      "index": 177, 
      "score": 0.16725027561187744, 
      "sent": "\"Lilley and Greenfield had figured out an array of tricks both obvious and not, some technical, some thematic."
    }, 
    {
      "index": 435, 
      "score": 0.16707664728164673, 
      "sent": "Greenfield checked the site, which redirected to an error page: \"There's nothing here."
    }, 
    {
      "index": 80, 
      "score": 0.16706071794033051, 
      "sent": "They share things that they normally wouldn't share with their local friends because of the fear of judgment."
    }, 
    {
      "index": 515, 
      "score": 0.16685222089290619, 
      "sent": "Then you love the teens because you figure out they are smarter than you, and you make peace with the death of your cultural relevance, because you know you'll be in good hands."
    }, 
    {
      "index": 78, 
      "score": 0.16637186706066132, 
      "sent": "The site, he said, is a \"safe haven from their local friends."
    }, 
    {
      "index": 499, 
      "score": 0.16630519926548004, 
      "sent": "He never planned to do them in the first place."
    }, 
    {
      "index": 148, 
      "score": 0.16611091792583466, 
      "sent": "Soon, Lilley and Greenfield told me, they were getting 15 million page views a month."
    }, 
    {
      "index": 495, 
      "score": 0.16608141362667084, 
      "sent": "Now they're building WordPress sites instead of Tumblrs: MightyFacts.com and RelatableCards.com."
    }, 
    {
      "index": 184, 
      "score": 0.16600409150123596, 
      "sent": "Lilley and Greenfield had partnered with a guy they'd known for years, Tom, to run Lifehackable."
    }, 
    {
      "index": 0, 
      "score": 0.16595232486724854, 
      "sent": "When Pizza reached 100,000 followers on Tumblr, she posted a picture of a pizza box, takeout chicken wings, and an orange soda spread out on her bed: \"pizza and chicken wings 2 celebrate.\""
    }, 
    {
      "index": 493, 
      "score": 0.16574572026729584, 
      "sent": "Hours after I drove away from the Greenfield family home, Tumblr terminated another one of their sites, NowYouKno, so they turned their focus to Movie, which had 185,000 followers--it was soon terminated, too."
    }, 
    {
      "index": 8, 
      "score": 0.16570740938186646, 
      "sent": "At first, she mostly posted photos of party outfits--hipster photos, she thought."
    }, 
    {
      "index": 133, 
      "score": 0.16559292376041412, 
      "sent": "Some kids found out about the YouTube channel at school and not everyone was nice about it, so they kept their Tumblr project secret."
    }, 
    {
      "index": 514, 
      "score": 0.16542120277881622, 
      "sent": "At first you loathe the teens, because you know nothing about them and think they're idiots, beneath you."
    }, 
    {
      "index": 220, 
      "score": 0.16530461609363556, 
      "sent": "Lilley would eventually recruit a few hundred kids whose combined Tumblrs would total an estimated 35 million follows."
    }, 
    {
      "index": 189, 
      "score": 0.16522790491580963, 
      "sent": "\"The outrage clicks were so powerful, Lilley and Greenfield decided to experiment with \"negative attention.\""
    }, 
    {
      "index": 140, 
      "score": 0.16521449387073517, 
      "sent": "\"Tumblr is a really safe space to make these observations out in the public where everyone can see but no one knows it's you,\" Strle told me when I visited Tumblr."
    }, 
    {
      "index": 126, 
      "score": 0.16495205461978912, 
      "sent": "Lilley read me the video's YouTube description out loud--\"Obama Calls Kanye West a Jackass [ACTUAL AUDIO]."
    }, 
    {
      "index": 187, 
      "score": 0.16458681225776672, 
      "sent": "In one notorious post, he suggested that you could make a \"personal ice cream bowl\" by cutting a pint container in half vertically."
    }, 
    {
      "index": 297, 
      "score": 0.16455729305744171, 
      "sent": "According to their bank records, in March 2013, Google paid them $25,350.45."
    }, 
    {
      "index": 313, 
      "score": 0.16448843479156494, 
      "sent": "\"The loft was multilevel, with stairs next to the living room going up to the bedrooms above."
    }, 
    {
      "index": 85, 
      "score": 0.16430032253265381, 
      "sent": "\"Tumblr culture has developed over the past five years as the smart weird kid in school connected with all the other smart weird kids from all the other schools all over the world,\" said Strle."
    }, 
    {
      "index": 468, 
      "score": 0.16426162421703339, 
      "sent": "All they saw was money, not the safety of their blog, which was potentially worth more than whatever they made.\""
    }, 
    {
      "index": 145, 
      "score": 0.1641542911529541, 
      "sent": "After a few weeks, Greenfield suggested adding GIFs (\"That moment every Sunday when you realize there's school tomorrow\" above Kanye West's face changing from a broad smile to melancholy) and the posts started blowing up, \"20,000 or 30,000 notes, and back then that was a lot.\""
    }, 
    {
      "index": 96, 
      "score": 0.16407471895217896, 
      "sent": "Being a social outcast can make you a better social observer of the gap between our real selves and our public image:two types of chatsgroup chat: lol look at this meme you pieces of shitprivate chat: i don't know anymore."
    }, 
    {
      "index": 171, 
      "score": 0.16396468877792358, 
      "sent": "As of last fall, only 10 percent of internet users use Tumblr, according to the Pew Research Center, but 23 percent of teen girls do, compared with 5 percent of teen boys."
    }, 
    {
      "index": 173, 
      "score": 0.16387784481048584, 
      "sent": "Greenfield confessed he'd written many posts from a girl's point of view, posts he didn't relate to, and, when he got flustered as I repeatedly demanded specifics, Lilley interrupted: \"We've never had a period.\""
    }, 
    {
      "index": 24, 
      "score": 0.16327093541622162, 
      "sent": "It received over 419,000 notes."
    }, 
    {
      "index": 466, 
      "score": 0.16327039897441864, 
      "sent": "\"They never thought it was a violation in the first place,\" one blogger told me."
    }, 
    {
      "index": 498, 
      "score": 0.16317881643772125, 
      "sent": "Lilley is done with diet pills."
    }, 
    {
      "index": 349, 
      "score": 0.16316840052604675, 
      "sent": "\"It was a huge wake-up call,\" Lilley said."
    }, 
    {
      "index": 362, 
      "score": 0.16305200755596161, 
      "sent": "\")Lilley and Greenfield were unabashed fans of Miller; they respected her social strategy and were quick to recall her best posts."
    }, 
    {
      "index": 30, 
      "score": 0.16297675669193268, 
      "sent": "Type in pizza.tumblr.com today and you'll get a simple, haunting message: \"There's nothing here.\""
    }, 
    {
      "index": 190, 
      "score": 0.16286097466945648, 
      "sent": "Haters are more loyal than fans, so they promoted the bad hacks."
    }, 
    {
      "index": 11, 
      "score": 0.16256469488143921, 
      "sent": "She tried out new names, new personas, changing her URL a few times; after a couple of years, she went all-joke."
    }, 
    {
      "index": 119, 
      "score": 0.16248266398906708, 
      "sent": "Do not insult me with these rank, stale puddles, that sit at the very base of the meme trickle down economy."
    }, 
    {
      "index": 89, 
      "score": 0.16205613315105438, 
      "sent": "The very best tweaks spread further, reblogged again and again, reappearing periodically in the feed, disconnected from time."
    }, 
    {
      "index": 288, 
      "score": 0.16203300654888153, 
      "sent": "He also pays some of his mom's bills."
    }, 
    {
      "index": 301, 
      "score": 0.16180761158466339, 
      "sent": "The teller knew them, and asked if they missed Los Angeles."
    }, 
    {
      "index": 487, 
      "score": 0.16144610941410065, 
      "sent": "This means we will be deferring indefinitely the payment scheduled for June 7,\" he wrote on June 5."
    }, 
    {
      "index": 234, 
      "score": 0.16126629710197449, 
      "sent": "It's clear the episode affected Miller deeply."
    }, 
    {
      "index": 472, 
      "score": 0.16093428432941437, 
      "sent": "In other words, getting the goods in front of the right kind of eyeballs."
    }, 
    {
      "index": 445, 
      "score": 0.1608365923166275, 
      "sent": "Over the next week, the terminated teens created a huge Facebook group chat; its thousands of messages are filled with anguish and denial and regret: \"They took away our lives,\" and \"The worst part is that everything was just ripped out from under us.\""
    }, 
    {
      "index": 363, 
      "score": 0.16049797832965851, 
      "sent": "Lilley sent her a Facebook message the day he arrived on the West Coast: \"i'm in LA!\""
    }, 
    {
      "index": 149, 
      "score": 0.1604650467634201, 
      "sent": "They had more than 450,000 followers on So-Relatable and were growing several other blogs."
    }, 
    {
      "index": 434, 
      "score": 0.16039927303791046, 
      "sent": "On August 19, just days before his twentieth birthday, Lilley tried to log in to So-Relatable but couldn't."
    }, 
    {
      "index": 139, 
      "score": 0.16019786894321442, 
      "sent": "Based on my years of immersion, I'd say it's more about revealing vulnerabilities."
    }, 
    {
      "index": 315, 
      "score": 0.16012178361415863, 
      "sent": "Lilley decorated his room with a wall decal of Notorious B.I.G."
    }, 
    {
      "index": 27, 
      "score": 0.16000074148178101, 
      "sent": "@SoDamnTrue tweeted it for 1,630 retweets and 2,879 favorites."
    }, 
    {
      "index": 43, 
      "score": 0.1599850207567215, 
      "sent": "A telling post from 2014: \"I picked joining Tumblr and staying active on here because: 1."
    }, 
    {
      "index": 224, 
      "score": 0.15994958579540253, 
      "sent": "Her Tumblr was her little secret place where she could go and blog and say what she wanted.\""
    }, 
    {
      "index": 216, 
      "score": 0.1598627120256424, 
      "sent": "Her colleagues and admirers call her Jess, but I can't help but think of her as Pizza."
    }, 
    {
      "index": 294, 
      "score": 0.15961456298828125, 
      "sent": "\"He did a lot of things that helped us, and he was never getting a piece of it,\" Lilley said."
    }, 
    {
      "index": 10, 
      "score": 0.15960656106472015, 
      "sent": "Pizza also wrote some funny one-liners, but otherwise she reblogged jokes, switching back and forth between fashion and comedy."
    }, 
    {
      "index": 84, 
      "score": 0.15929883718490601, 
      "sent": "Powerful users send a joke ricocheting around the globe."
    }, 
    {
      "index": 431, 
      "score": 0.15895688533782959, 
      "sent": "For Lilley, the \"milli's\" didn't come."
    }, 
    {
      "index": 436, 
      "score": 0.15875466167926788, 
      "sent": "Whatever you were looking for doesn't currently exist at this address.\""
    }, 
    {
      "index": 460, 
      "score": 0.15873323380947113, 
      "sent": "I think they were perhaps underwhelmed by maybe more professional options that promise less payment.\""
    }, 
    {
      "index": 475, 
      "score": 0.15850423276424408, 
      "sent": "A remaining campaign peddled sunglasses whose lenses supposedly worked like an Instagram filter."
    }, 
    {
      "index": 135, 
      "score": 0.15824446082115173, 
      "sent": "ROFLnow.com never made more than $20 in a day; Lilley made about $80 a week working at a diner."
    }, 
    {
      "index": 285, 
      "score": 0.15790869295597076, 
      "sent": "\"Tumblr's different because no one really cares what you look like, they only care about what you post,\" Jess Miller told me."
    }, 
    {
      "index": 163, 
      "score": 0.15760082006454468, 
      "sent": "It surprised me, because nerds are often defined by an inability to read social interactions and respond in a way that makes them cool, confident--relatable."
    }, 
    {
      "index": 115, 
      "score": 0.15758629143238068, 
      "sent": "I am plugged into the mainframe, wired to the primary source."
    }, 
    {
      "index": 110, 
      "score": 0.15627069771289825, 
      "sent": "Teens are free to express their low self-esteem on Tumblr, but they have confidence in one thing: Everyone will steal their jokes."
    }, 
    {
      "index": 181, 
      "score": 0.15612977743148804, 
      "sent": "I'd seen a few Lifehackable posts years ago and assumed they were satire."
    }, 
    {
      "index": 209, 
      "score": 0.1558421403169632, 
      "sent": "Tumblr's public relations team reached out to them for me, too, but no response."
    }, 
    {
      "index": 31, 
      "score": 0.15559253096580505, 
      "sent": "The 1 million left behind began to buzz: Where was Pizza?"
    }, 
    {
      "index": 296, 
      "score": 0.15549786388874054, 
      "sent": "In January 2013, they quit college."
    }, 
    {
      "index": 419, 
      "score": 0.15511281788349152, 
      "sent": "But he had good news: \"check your balance tho :)\" She replied, \"YOURE THE BEST PERSON IN THE WHOLE WORLD TJANK YOU THANK YOU THANK YOU :))))))\"Then in June 2014, Pizza reached an unheard of milestone for a Tumblr teen: \"pizza hit 1 million followers today."
    }, 
    {
      "index": 289, 
      "score": 0.15465189516544342, 
      "sent": "When I asked him if his mom approved of his Tumblr career, Wong said he tells her, \"'Why is our bank account not in the negative anymore?"
    }, 
    {
      "index": 447, 
      "score": 0.1545710414648056, 
      "sent": "Other banned kids pasted Tumblr posts from Miller's haters--when one user wrote \"how did pizza get deleted?\""
    }, 
    {
      "index": 392, 
      "score": 0.15454040467739105, 
      "sent": "(The celebrity doctor was berated at a 2014 Senate hearing for misleading his audience about the efficacy of \"miracle\" weight-loss supplements.)"
    }, 
    {
      "index": 286, 
      "score": 0.15442489087581635, 
      "sent": "Its stars often have as far to climb, at least socioeconomically, as their fans."
    }, 
    {
      "index": 99, 
      "score": 0.15430781245231628, 
      "sent": "A friend in media with a Twitter following in the tens of thousands responded: \"That teen observation is PENETRATING.\""
    }, 
    {
      "index": 311, 
      "score": 0.15401239693164825, 
      "sent": "When he first saw the apartment, Lilley thought he'd finally made it."
    }, 
    {
      "index": 14, 
      "score": 0.15396702289581299, 
      "sent": "That same year, she turned 15."
    }, 
    {
      "index": 489, 
      "score": 0.15383115410804749, 
      "sent": "Lilley isn't sure what to do now."
    }, 
    {
      "index": 29, 
      "score": 0.15315143764019012, 
      "sent": "Two months later, her blog was gone."
    }, 
    {
      "index": 293, 
      "score": 0.15307843685150146, 
      "sent": "Fairly subtle stuff, but they made thousands more dollars the next month."
    }, 
    {
      "index": 450, 
      "score": 0.15235641598701477, 
      "sent": "\"I don't understand why so many people followed her if they hated her...\" Another replied, \"lmfao her blogs gone and ppl r still talking about her so famous.\""
    }, 
    {
      "index": 203, 
      "score": 0.15227217972278595, 
      "sent": "Based on a few posts about blogger meet-ups, I knew she was Australian, but nothing had been written about her in the Australian media."
    }, 
    {
      "index": 360, 
      "score": 0.15214714407920837, 
      "sent": "(When an anonymous user asked Moistbottom, \"how far have you and Jess gone?\""
    }, 
    {
      "index": 317, 
      "score": 0.15204891562461853, 
      "sent": "Lilley and Hegstad both loved rap, and they played it all day long, so loud it echoed through the walls."
    }, 
    {
      "index": 154, 
      "score": 0.15197239816188812, 
      "sent": "I set up my phone to record our conversation, resting it on top of a can of dog food belonging to Greenfield's fluffy Pomeranian, Pebbles."
    }, 
    {
      "index": 92, 
      "score": 0.15192227065563202, 
      "sent": "A decade of trend pieces has deemed millennials to be narcissists, but Tumblr humor for this generation is self-deprecating and anti-aspirational: \"how do fourteen year olds get pregnant, I can't even get a high five from a guy,\" \"how many eye contact until date,\" \"i just said hi to someone and they didn't hear me i'm never trying that again.\""
    }, 
    {
      "index": 44, 
      "score": 0.15175612270832062, 
      "sent": "I'm not attractive enough to be a Youtuber 2."
    }, 
    {
      "index": 451, 
      "score": 0.15174999833106995, 
      "sent": "Impersonators grabbed URLs like iwaspizza.tumblr.com; hundreds of people tweeted at her, asking where she'd gone."
    }, 
    {
      "index": 410, 
      "score": 0.15158095955848694, 
      "sent": "Here's how I did it: with this organic supplement'--that doesn't sound good.\""
    }, 
    {
      "index": 72, 
      "score": 0.15151433646678925, 
      "sent": "\"These teens are better marketers than anyone in the game right now.\""
    }, 
    {
      "index": 488, 
      "score": 0.15126979351043701, 
      "sent": "Greenfield grumbled, \"How can it not be profitable if they didn't pay anyone?\""
    }, 
    {
      "index": 420, 
      "score": 0.15067023038864136, 
      "sent": "I am small and weak,\" one Tumblr user wrote."
    }, 
    {
      "index": 312, 
      "score": 0.1503242552280426, 
      "sent": "\"It felt like something we could call ours, something we could show for everything we do, which is just on a screen."
    }, 
    {
      "index": 62, 
      "score": 0.15030987560749054, 
      "sent": "on the stage, me, sitting on a stool, lit by a spotlight, the only light in the theatre."
    }, 
    {
      "index": 271, 
      "score": 0.15025235712528229, 
      "sent": "An ad might specify \"please no car/dating/clothing web sites!\""
    }, 
    {
      "index": 517, 
      "score": 0.1502511203289032, 
      "sent": "And you'll see yourself in them because they're relatable: That moment you realize the teens are just like you."
    }, 
    {
      "index": 136, 
      "score": 0.1501871645450592, 
      "sent": "Lilley and Greenfield launched So-Relatable on Tumblr in late February 2012."
    }, 
    {
      "index": 69, 
      "score": 0.15002404153347015, 
      "sent": "\"These kids are so advanced--so, so advanced,\" she said softly to her screen."
    }, 
    {
      "index": 316, 
      "score": 0.14993739128112793, 
      "sent": "'s head and a Tupac Shakur lyric: \"You know my momma used to tell me / if you can't find something to live for / then you best find something to die for.\""
    }, 
    {
      "index": 204, 
      "score": 0.14910921454429626, 
      "sent": "I sent her \"fan mail\" on Tumblr, the only option at the time, but popular blogs got tons of such messages, and I got no response."
    }, 
    {
      "index": 188, 
      "score": 0.14872077107429504, 
      "sent": "The post went viral when another user commented \"OR YOU COULD JUST TAKE OFF THE FUCKING LID YOU INBRED."
    }, 
    {
      "index": 291, 
      "score": 0.14866439998149872, 
      "sent": "It's better not to argue but to just show results."
    }, 
    {
      "index": 304, 
      "score": 0.14851546287536621, 
      "sent": "I also asked them to show me three years of tax returns."
    }, 
    {
      "index": 266, 
      "score": 0.14841736853122711, 
      "sent": "So teens have schemes to evade the bots."
    }, 
    {
      "index": 71, 
      "score": 0.14841665327548981, 
      "sent": "\"They are the most brilliant digital strategists,\" she said."
    }, 
    {
      "index": 182, 
      "score": 0.14831821620464325, 
      "sent": "\"Life hacks\" are simple tips to make your life a bit better in the tiniest ways, the kind of tricks that are so obvious you can't believe you weren't already doing them--finding the best deals on eBay by searching for misspelled listings, keeping power cords neat with hair clips, making \"time bomb soda\" by freezing Mentos in ice cubes."
    }, 
    {
      "index": 218, 
      "score": 0.14821787178516388, 
      "sent": "\"I didn't really think I was 'popular' because the number of followers was there but it didn't really hit me how big the audience I had was until people recognized me in public,\" she said."
    }, 
    {
      "index": 366, 
      "score": 0.14808398485183716, 
      "sent": "\"It was like buying popularity, but it was real.\""
    }, 
    {
      "index": 117, 
      "score": 0.14694894850254059, 
      "sent": "I have seen the rise and fall of that meme, the boom and bust, the drama, the pain, the shitposting, oh god, the shitposting."
    }, 
    {
      "index": 433, 
      "score": 0.14692243933677673, 
      "sent": "It was the next month that it happened."
    }, 
    {
      "index": 138, 
      "score": 0.14674374461174011, 
      "sent": "Lilley called it \"a thought, feeling or idea that resonates with others.\""
    }, 
    {
      "index": 229, 
      "score": 0.14664985239505768, 
      "sent": "\"In early 2014, when she was 16, some Tumblr users dug up posts Miller had written when she was 13 in which she used the word \"nigga.\""
    }, 
    {
      "index": 211, 
      "score": 0.14661116898059845, 
      "sent": "And then, in August 2015, Jason Wong gave me a new email for Pizza."
    }, 
    {
      "index": 195, 
      "score": 0.14657202363014221, 
      "sent": "Danielle Strle told me about Cornputer; I had to tell her that Heckacute had gone password-protected."
    }, 
    {
      "index": 235, 
      "score": 0.14645817875862122, 
      "sent": "An anonymous user left a message on her new blog, Jess Cats."
    }, 
    {
      "index": 370, 
      "score": 0.14642469584941864, 
      "sent": "When she hit 800,000 followers, he wrote, \"i'm just waiting for you to hit a million, not if but when."
    }, 
    {
      "index": 118, 
      "score": 0.146418496966362, 
      "sent": "I have seen this meme in it's rawest, freshest, unpasturised, most primal state."
    }, 
    {
      "index": 358, 
      "score": 0.14629524946212769, 
      "sent": "David Karp had been following her for a year."
    }, 
    {
      "index": 228, 
      "score": 0.14599889516830444, 
      "sent": "\"I told her my daughter was Pizza,\" Arrowsmith said, \"and the girl almost started crying."
    }, 
    {
      "index": 39, 
      "score": 0.14597862958908081, 
      "sent": "Last fall, OfficialUnitedStates, another humor blog with a large following, wrote, \"i miss pizza.tumblr.com ... sometimes late at night i wonder what tumblr would be like if she hadnt disappeared into the night one year ago today."
    }, 
    {
      "index": 405, 
      "score": 0.14580506086349487, 
      "sent": "\"Hi I'm Brittany and this is my weight loss story!\""
    }, 
    {
      "index": 322, 
      "score": 0.14543798565864563, 
      "sent": "Instead they spent their off-hours playing video games and ordering Chinese food."
    }, 
    {
      "index": 427, 
      "score": 0.14534252882003784, 
      "sent": "J\" Lilley wrote back, \"YEAH THATS AMAZING ... HERES TO THE NEXT MILLION ... YOU DESERVE IT ALL ... Btw wanna get another reblog deal going?"
    }, 
    {
      "index": 170, 
      "score": 0.14498826861381531, 
      "sent": "Researching their way to relatable played out most interestingly in one demographic: girls."
    }, 
    {
      "index": 98, 
      "score": 0.14492151141166687, 
      "sent": "sorry for complaining and thanks for always listening to meWhen this post appeared in my feed, I sent it to several friends who use a group chat at work: \"How do they know?\""
    }, 
    {
      "index": 237, 
      "score": 0.14479945600032806, 
      "sent": "She replied, \"Yep formerly tumblr user pizza and currently a piece of trash xx.\""
    }, 
    {
      "index": 506, 
      "score": 0.14470712840557098, 
      "sent": "She graduated high school last November and was accepted to a college program to study commerce and arts."
    }, 
    {
      "index": 281, 
      "score": 0.14446349442005157, 
      "sent": "\"He would have been so much better off if he didn't screw us over,\" Lilley said."
    }, 
    {
      "index": 373, 
      "score": 0.14412209391593933, 
      "sent": "hahaha i rly hope i get 1 mill cos that'd be crazy wow.\""
    }, 
    {
      "index": 105, 
      "score": 0.1440393477678299, 
      "sent": "If someone breaks your heart, then they have to deal with the bees.\""
    }, 
    {
      "index": 158, 
      "score": 0.14399707317352295, 
      "sent": "Greenfield is shorter, with glasses and honey-brown hair."
    }, 
    {
      "index": 403, 
      "score": 0.14364911615848541, 
      "sent": "It's like it seems more genuine.\""
    }, 
    {
      "index": 102, 
      "score": 0.14348827302455902, 
      "sent": "\"But in private we're all really nice and anxious\"--the essential divide between Twitter users and Tumblr users."
    }, 
    {
      "index": 222, 
      "score": 0.14322890341281891, 
      "sent": "\"She actually didn't tell any of her friends at school,\" Arrowsmith said."
    }, 
    {
      "index": 462, 
      "score": 0.14311252534389496, 
      "sent": "Users can still put whatever banner ads they want on their page, she said."
    }, 
    {
      "index": 331, 
      "score": 0.14304903149604797, 
      "sent": "\"Greenfield: And then someone was like, \"But all those neighbors can see you.\""
    }, 
    {
      "index": 505, 
      "score": 0.14297294616699219, 
      "sent": "\"In a way, Miller is better off; she's younger, after all, a Tumblr tween turned Tumblr teen."
    }, 
    {
      "index": 397, 
      "score": 0.1425192803144455, 
      "sent": "The fit was natural."
    }, 
    {
      "index": 70, 
      "score": 0.14178416132926941, 
      "sent": "Not just in their comedy, but in their business savvy."
    }, 
    {
      "index": 114, 
      "score": 0.14125582575798035, 
      "sent": "Recent commentary on this phenomenon from within Tumblr received 275,000 notes in a week:My friends (don't have tumblr): have u seen this meme lol, it was on the 'best of tumblr' facebook page, tumblr is so funnyMe, a tumblr gremlin: haha yeah lol, think i've seen that one before lolMe (what I really mean): you fools."
    }, 
    {
      "index": 265, 
      "score": 0.14039045572280884, 
      "sent": "Google has bots looking for that."
    }, 
    {
      "index": 21, 
      "score": 0.14038874208927155, 
      "sent": "Congrats on everything."
    }, 
    {
      "index": 473, 
      "score": 0.13953104615211487, 
      "sent": "Campaigns run as high as six figures.\""
    }, 
    {
      "index": 390, 
      "score": 0.13934135437011719, 
      "sent": "(\"I would hate to say clone and modify,\" he said, \"but that's kind of a good place to start.\")"
    }, 
    {
      "index": 409, 
      "score": 0.13918747007846832, 
      "sent": "He read from the post: \"'I lost 24 pounds in four weeks with minor exercise and no change in diet."
    }, 
    {
      "index": 87, 
      "score": 0.13900898396968842, 
      "sent": "Anonymous kids with witty user names like Larsvontired or Baracknobama post incisive one-liners confessing their most vulnerable moments of social mortification."
    }, 
    {
      "index": 3, 
      "score": 0.13891340792179108, 
      "sent": "Another: \"MOTHER OF GOD 100K?!?!\""
    }, 
    {
      "index": 230, 
      "score": 0.13891296088695526, 
      "sent": "Screenshots of the old posts went viral."
    }, 
    {
      "index": 186, 
      "score": 0.13830907642841339, 
      "sent": "His life hacks were less hacks than poor life choices."
    }, 
    {
      "index": 351, 
      "score": 0.13784788548946381, 
      "sent": "\"Still, they continued with Exposely, sometimes working 60 hours a week."
    }, 
    {
      "index": 336, 
      "score": 0.13736948370933533, 
      "sent": "That's a crime."
    }, 
    {
      "index": 318, 
      "score": 0.13701719045639038, 
      "sent": "\"They were like my little brother's age,\" Hegstad later told me."
    }, 
    {
      "index": 350, 
      "score": 0.13698150217533112, 
      "sent": "\"It felt like working somewhere, putting in a lot of work, and you show up one day and they throw all your shit in a box and they're like 'get the fuck out' and they won't even say why you were fired."
    }, 
    {
      "index": 156, 
      "score": 0.13671277463436127, 
      "sent": "Instead, they gave me the secrets to virality."
    }, 
    {
      "index": 461, 
      "score": 0.13631375133991241, 
      "sent": "(In January 2015, Tumblr launched Creatrs Network, where the company pays Tumblr artists to create ads for brands like Converse and Tresemme.)"
    }, 
    {
      "index": 494, 
      "score": 0.13612315058708191, 
      "sent": "So were VinesNow, So-True, and ListHacks."
    }, 
    {
      "index": 371, 
      "score": 0.13595513999462128, 
      "sent": "just keep doing your thing you obvi don't need me to say that to you I just am sometimes blown away like woah so yeah.\""
    }, 
    {
      "index": 404, 
      "score": 0.13553386926651001, 
      "sent": "You know, more relatable."
    }, 
    {
      "index": 130, 
      "score": 0.13550397753715515, 
      "sent": "--and muttered, \"Wow, I was already so meta.\""
    }, 
    {
      "index": 63, 
      "score": 0.13510043919086456, 
      "sent": "i hold up a photo of my cat, 10 people applaud, two or three hold up photocopies of the same photo, the rest do nothing, watching, waiting."
    }, 
    {
      "index": 251, 
      "score": 0.1348952054977417, 
      "sent": "It really turns our stomachs.\""
    }, 
    {
      "index": 398, 
      "score": 0.13477514684200287, 
      "sent": "\"Life Hack: You can lose 20 pounds per month with this magic pill."
    }, 
    {
      "index": 327, 
      "score": 0.13474562764167786, 
      "sent": "Greenfield: He was like, \"Wow, this is such a great view."
    }, 
    {
      "index": 166, 
      "score": 0.13452783226966858, 
      "sent": "\"I didn't relate to a lot of the things I was posting about, but like, you read online that a lot of people were going through that, so I was like 'Oh I guess that's a relatable thing,' \" Greenfield said."
    }, 
    {
      "index": 93, 
      "score": 0.13451308012008667, 
      "sent": "There is more self-loathing than self-love (\"*looks in a mirror* you again\") as well as pleas for clemency from social prison (\"you like attention?"
    }, 
    {
      "index": 175, 
      "score": 0.13431315124034882, 
      "sent": "Lilley showed me a post about a girl asking a friend to check her pants in the bathroom."
    }, 
    {
      "index": 81, 
      "score": 0.13423797488212585, 
      "sent": "That has held true for every person that I've met."
    }, 
    {
      "index": 193, 
      "score": 0.13388456404209137, 
      "sent": "\"And in sucking, he succeeded.\""
    }, 
    {
      "index": 107, 
      "score": 0.13382986187934875, 
      "sent": "its that cursed egyptian amulet why do u even have that.\""
    }, 
    {
      "index": 329, 
      "score": 0.13355982303619385, 
      "sent": "I want to set up a screen."
    }, 
    {
      "index": 421, 
      "score": 0.13354742527008057, 
      "sent": "\"everyone buy pizza today to celebrate jess pizza hitting 1 million followers!\""
    }, 
    {
      "index": 415, 
      "score": 0.13337798416614532, 
      "sent": "The Tumblr teens loved it."
    }, 
    {
      "index": 168, 
      "score": 0.13111953437328339, 
      "sent": "He didn't understand complaints about substitute teachers--those were \"jokes that I blatantly wouldn't get.\""
    }, 
    {
      "index": 424, 
      "score": 0.13086117804050446, 
      "sent": "I KNEW YOU'D DO IT J OMG A MILLION HOW'S IT FEEL,\" Lilley told her."
    }, 
    {
      "index": 202, 
      "score": 0.13069622218608856, 
      "sent": "It took almost two years to get her to talk to me."
    }, 
    {
      "index": 101, 
      "score": 0.13062618672847748, 
      "sent": "\"People think other people are impressed by voicey cynicism in the public square,\" he added."
    }, 
    {
      "index": 106, 
      "score": 0.13055764138698578, 
      "sent": "Or: \"before blaming others, think: whats the 1 constant in all your failed relationships?"
    }, 
    {
      "index": 213, 
      "score": 0.13028624653816223, 
      "sent": "She replied, \"Thank you so much for contacting me and for being interested with my blog!\""
    }, 
    {
      "index": 510, 
      "score": 0.12994576990604401, 
      "sent": "\"Girls these days don't keep diaries,\" one woman said."
    }, 
    {
      "index": 162, 
      "score": 0.12989793717861176, 
      "sent": "They were witty and warm and very smart, and I liked them immediately, but they were total nerds."
    }, 
    {
      "index": 448, 
      "score": 0.12926933169364929, 
      "sent": "another replied \"don't question blessings.\""
    }, 
    {
      "index": 223, 
      "score": 0.12923702597618103, 
      "sent": "\"It was her own special thing."
    }, 
    {
      "index": 167, 
      "score": 0.12921391427516937, 
      "sent": "He didn't understand why someone might be nervous in front of the police for no reason."
    }, 
    {
      "index": 151, 
      "score": 0.12913808226585388, 
      "sent": "The walls were bright red, and we lounged on an overstuffed wraparound couch."
    }, 
    {
      "index": 219, 
      "score": 0.12903031706809998, 
      "sent": "\"One day I was in the library and some girls walked into the room I was in, yelled out 'Hey Pizza,' and then ran away.\""
    }, 
    {
      "index": 152, 
      "score": 0.1290019303560257, 
      "sent": "I'd expected to watch them work, but they had enough posts queued up to last the day, so instead we just hung out, which, just like so many hangouts when I was their age, eventually devolved into watching videos online."
    }, 
    {
      "index": 352, 
      "score": 0.12846146523952484, 
      "sent": "The pair hardly ventured outside the loft."
    }, 
    {
      "index": 225, 
      "score": 0.12830245494842529, 
      "sent": "But people started finding out."
    }, 
    {
      "index": 109, 
      "score": 0.12792894244194031, 
      "sent": "She leaned in really close to my sweating face and continued, \"I am completely covered in little snakes down there.\""
    }, 
    {
      "index": 2, 
      "score": 0.12786130607128143, 
      "sent": "YOU DESERVE IT!\""
    }, 
    {
      "index": 503, 
      "score": 0.12749044597148895, 
      "sent": "\"She liked something of mine on Instagram the other day, and I was just like, Damn."
    }, 
    {
      "index": 200, 
      "score": 0.12747953832149506, 
      "sent": "Strle leaned in: \"She's kind of controversial."
    }, 
    {
      "index": 330, 
      "score": 0.12746831774711609, 
      "sent": "\"Lilley: He was like, \"I'd smash every night on this roof."
    }, 
    {
      "index": 335, 
      "score": 0.12746678292751312, 
      "sent": "\"Lilley: And not to mention the police in their helicopters."
    }, 
    {
      "index": 201, 
      "score": 0.12732788920402527, 
      "sent": "\"I had been trying to interview Pizza for a year before her blog disappeared in August 2014."
    }, 
    {
      "index": 120, 
      "score": 0.12722998857498169, 
      "sent": "Tumblr teens call many of these jokes \"relatable.\""
    }, 
    {
      "index": 97, 
      "score": 0.12695252895355225, 
      "sent": "im hoping that someday i'll just know what to do."
    }, 
    {
      "index": 236, 
      "score": 0.126723513007164, 
      "sent": "\"Are you former tumblr user pizza?\""
    }, 
    {
      "index": 303, 
      "score": 0.12624582648277283, 
      "sent": "They later told me she always asks them that, even though they'd been home for months."
    }, 
    {
      "index": 79, 
      "score": 0.12584105134010315, 
      "sent": "... On Tumblr they tell their most personal stories."
    }, 
    {
      "index": 257, 
      "score": 0.12553353607654572, 
      "sent": "Tumblr doesn't have that."
    }, 
    {
      "index": 272, 
      "score": 0.12535169720649719, 
      "sent": "because those ads pay less per click."
    }, 
    {
      "index": 205, 
      "score": 0.12521035969257355, 
      "sent": "I sent her a direct message on Twitter, to which she responded with interest, giving me her email, but after an exchange, she went silent."
    }, 
    {
      "index": 342, 
      "score": 0.12502485513687134, 
      "sent": "(\"Everyone who's been a publisher has had that thought,\" said Lilley.)"
    }, 
    {
      "index": 144, 
      "score": 0.12450356036424637, 
      "sent": "Convert into an image and post."
    }, 
    {
      "index": 261, 
      "score": 0.12405534088611603, 
      "sent": "Tumblr does not like this."
    }, 
    {
      "index": 361, 
      "score": 0.12379879504442215, 
      "sent": "he responded, \"TO THE BEACH."
    }, 
    {
      "index": 176, 
      "score": 0.12375693023204803, 
      "sent": "\"That's obviously something we've never said to each other."
    }, 
    {
      "index": 246, 
      "score": 0.12329483777284622, 
      "sent": "Why game AdSense?"
    }, 
    {
      "index": 333, 
      "score": 0.1212509498000145, 
      "sent": "And he's like, \"I don't care."
    }, 
    {
      "index": 155, 
      "score": 0.12096897512674332, 
      "sent": "\"Give me all the gossip,\" I commanded."
    }, 
    {
      "index": 443, 
      "score": 0.12020851671695709, 
      "sent": "For three days, Jess Miller stayed in bed, shocked."
    }, 
    {
      "index": 208, 
      "score": 0.12009668350219727, 
      "sent": "I tried contacting other kids on Tumblr instead, but they didn't respond to me either."
    }, 
    {
      "index": 334, 
      "score": 0.11996347457170486, 
      "sent": "I'd set up a screen and broadcast it."
    }, 
    {
      "index": 206, 
      "score": 0.11977729946374893, 
      "sent": "I asked Tumblr to try contacting Pizza for me."
    }, 
    {
      "index": 511, 
      "score": 0.11886288970708847, 
      "sent": "\"I think that means they don't have inner lives.\""
    }, 
    {
      "index": 502, 
      "score": 0.11809296160936356, 
      "sent": "I still can't wrap my head around it, ever,\" he said."
    }, 
    {
      "index": 214, 
      "score": 0.11768683046102524, 
      "sent": "and agreed to talk."
    }, 
    {
      "index": 467, 
      "score": 0.11714749783277512, 
      "sent": "\"No one tried to be sneaky."
    }, 
    {
      "index": 212, 
      "score": 0.11669325828552246, 
      "sent": "(\"She was like a god in people's eyes,\" he said.)"
    }, 
    {
      "index": 320, 
      "score": 0.11649305373430252, 
      "sent": "Semi-introverted, but fun.\""
    }, 
    {
      "index": 100, 
      "score": 0.11618050187826157, 
      "sent": "We spent several minutes analyzing the joke."
    }, 
    {
      "index": 153, 
      "score": 0.11560706794261932, 
      "sent": "Except these videos were ones they made as kids."
    }, 
    {
      "index": 157, 
      "score": 0.11520390212535858, 
      "sent": "Lilley is tall and lanky, with dark brown curly hair."
    }, 
    {
      "index": 496, 
      "score": 0.11519571393728256, 
      "sent": "(Tagline: \"Cards that make you nod.\")"
    }, 
    {
      "index": 444, 
      "score": 0.11480291932821274, 
      "sent": "My blog is gone."
    }, 
    {
      "index": 185, 
      "score": 0.11466066539287567, 
      "sent": "Tom was not good at it."
    }, 
    {
      "index": 328, 
      "score": 0.11445661634206772, 
      "sent": "I want to come and fuck a girl up here."
    }, 
    {
      "index": 160, 
      "score": 0.11433266848325729, 
      "sent": "Summer had just ended, and there was a pool in the backyard, but they were quite pale."
    }, 
    {
      "index": 32, 
      "score": 0.11418155580759048, 
      "sent": "Why did Pizza go?"
    }, 
    {
      "index": 210, 
      "score": 0.11289358884096146, 
      "sent": "I started to lose hope."
    }, 
    {
      "index": 127, 
      "score": 0.11269499361515045, 
      "sent": "Obama: Kanye West Is a Jackass!"
    }, 
    {
      "index": 129, 
      "score": 0.11264435946941376, 
      "sent": "Obama: Kanye West is a JACKASS!\""
    }, 
    {
      "index": 196, 
      "score": 0.11240652948617935, 
      "sent": "\"Oh my God, you know Pizza?\""
    }, 
    {
      "index": 346, 
      "score": 0.1118159294128418, 
      "sent": "(Many tech blogs suspect the confession is a fake.)"
    }, 
    {
      "index": 290, 
      "score": 0.11164439469575882, 
      "sent": "Why do I have money to go to college?'"
    }, 
    {
      "index": 45, 
      "score": 0.10868345201015472, 
      "sent": "Not popular enough for twitter 3."
    }, 
    {
      "index": 183, 
      "score": 0.10757638514041901, 
      "sent": "(Applicability of the life hack often depends on one's lifestyle.)"
    }, 
    {
      "index": 104, 
      "score": 0.10741504281759262, 
      "sent": "\"Fill your heart with bees."
    }, 
    {
      "index": 199, 
      "score": 0.10640937834978104, 
      "sent": "Oh my God, I love Pizza,\" I said, \"Tell me about Pizza.\""
    }, 
    {
      "index": 174, 
      "score": 0.10564275085926056, 
      "sent": "Period posts do really well."
    }, 
    {
      "index": 442, 
      "score": 0.10431388765573502, 
      "sent": "And now, nothing."
    }, 
    {
      "index": 46, 
      "score": 0.10387647897005081, 
      "sent": "Facebook is dumb.\""
    }, 
    {
      "index": 33, 
      "score": 0.10378798097372055, 
      "sent": "Who killed Pizza?"
    }, 
    {
      "index": 165, 
      "score": 0.10373958945274353, 
      "sent": "His answer: internet research."
    }, 
    {
      "index": 439, 
      "score": 0.10226022452116013, 
      "sent": "Including Pizza."
    }, 
    {
      "index": 305, 
      "score": 0.10212499648332596, 
      "sent": "They did that too."
    }, 
    {
      "index": 504, 
      "score": 0.10093621909618378, 
      "sent": "She lost all of it."
    }, 
    {
      "index": 22, 
      "score": 0.10026194155216217, 
      "sent": "I love you."
    }, 
    {
      "index": 1, 
      "score": 0.097270853817462921, 
      "sent": "One fan replied, \"CONGRATULATIONS GIRL!"
    }, 
    {
      "index": 302, 
      "score": 0.095777951180934906, 
      "sent": "They said it never rained."
    }, 
    {
      "index": 95, 
      "score": 0.093124367296695709, 
      "sent": "how dare anyone like being loved\")."
    }, 
    {
      "index": 422, 
      "score": 0.091943450272083282, 
      "sent": "another said."
    }, 
    {
      "index": 94, 
      "score": 0.089377306401729584, 
      "sent": "how dare you."
    }, 
    {
      "index": 198, 
      "score": 0.087229140102863312, 
      "sent": "\"Yes."
    }, 
    {
      "index": 319, 
      "score": 0.085947774350643158, 
      "sent": "\"They were cool."
    }, 
    {
      "index": 337, 
      "score": 0.085685774683952332, 
      "sent": "Exposure."
    }, 
    {
      "index": 197, 
      "score": 0.084484949707984924, 
      "sent": "Strle said."
    }, 
    {
      "index": 159, 
      "score": 0.082533292472362518, 
      "sent": "They both wore plain polo shirts."
    }, 
    {
      "index": 207, 
      "score": 0.078312948346138, 
      "sent": "No response."
    }, 
    {
      "index": 501, 
      "score": 0.078282982110977173, 
      "sent": "\"Jess."
    }, 
    {
      "index": 128, 
      "score": 0.074032731354236603, 
      "sent": "A JACKASS!"
    }, 
    {
      "index": 426, 
      "score": 0.069366239011287689, 
      "sent": "AND IT FEELS SO GOOD LIKE WOW 1 MILLION PEOPLE?!?!"
    }, 
    {
      "index": 372, 
      "score": 0.068721041083335876, 
      "sent": "Miller was always gracious: \"thank you!!"
    }, 
    {
      "index": 425, 
      "score": 0.06567305326461792, 
      "sent": "Miller replied: \"THANKS!!"
    }, 
    {
      "index": 423, 
      "score": 0.053366009145975113, 
      "sent": "\"HEY BIG CONGRATS!!"
    }
  ], 
  "title": null
}