{
  "model": "c22a5bd", 
  "scored_article_sentences": [
    {
      "index": 185, 
      "score": 0.2594178318977356, 
      "sent": "And yet in their act of defiance, these 48 black letter writers had observed a truth that the fact of Morrison's awards cannot alter: that they were working within a culture that fundamentally wasn't interested in them and they therefore had recognized what the establishment at large had refused to; that, now and then, writers of color must struggle to merely tread water in a sea of what another Pulitzer Prize-winning novelist, Junot Diaz, described to me as \"the unbearable whiteness\" of American literature."
    }, 
    {
      "index": 101, 
      "score": 0.25883987545967102, 
      "sent": "It has allowed Morrison to play with language, to take chances with how stories unravel and to consistently resist the demand to create an empirical understanding of black life in America."
    }, 
    {
      "index": 212, 
      "score": 0.25443762540817261, 
      "sent": "Over the last decade or so, a righteous assault on the hegemony that exists in American literature has come to the fore."
    }, 
    {
      "index": 213, 
      "score": 0.25138053297996521, 
      "sent": "Suddenly, the old guard's oft-repeated line that people of color don't read, that they don't submit, that their work isn't up to snuff was being widely and publicly debunked by workshops run by programs like Kimbilio, Voices of Our Nation Arts Foundation and the Asian-American Writers' Workshop."
    }, 
    {
      "index": 228, 
      "score": 0.2482822984457016, 
      "sent": "For decades Morrison has reflected back to us what it's meant to be on the other side of this country's approved history."
    }, 
    {
      "index": 10, 
      "score": 0.24330975115299225, 
      "sent": "Not because she required it, but because the unspoken consensus was that the person who produced the 11 novels that Morrison has written, the person those books came out of, was deserving of the fuss."
    }, 
    {
      "index": 173, 
      "score": 0.2431253045797348, 
      "sent": "The French literary theorist Pascale Casanova suggests in her book \"The World Republic of Letters\" that all literature is a kind of a cultural battleground where dominant forces routinely crush the stories of those who are the underdog."
    }, 
    {
      "index": 8, 
      "score": 0.24262477457523346, 
      "sent": "What was evident that day in Katonah was that had she so much as lifted a finger, every person in the room -- the studio's director and his engineer, her P.R."
    }, 
    {
      "index": 125, 
      "score": 0.24244941771030426, 
      "sent": "We will never know the thoughts of this particular merry man, but his appearance in Dicken's travelogue almost presages the novels of Morrison, novels that have ensured that lives like his are no longer merely passing mentions in another man's notes."
    }, 
    {
      "index": 304, 
      "score": 0.23954617977142334, 
      "sent": "Jens Mortensen for The New York Times                           The novel is an expression of all the ways that Morrison remains skeptical of quick fixes and easy answers."
    }, 
    {
      "index": 172, 
      "score": 0.2325453907251358, 
      "sent": "The perplexing but wonderful thing about Morrison's career is just how much her prominence was created not by the mainstream publishing world, but by Morrison herself, on her own terms, in spite of it."
    }, 
    {
      "index": 9, 
      "score": 0.23159298300743103, 
      "sent": "person from Knopf, her publisher and two young women from the audiobooks division of Random House -- would have stopped what they were doing to ask if they could assist."
    }, 
    {
      "index": 178, 
      "score": 0.23075060546398163, 
      "sent": "\"Beloved,\" they said, was Morrison's most recent gift to our community, our country and our national conscience."
    }, 
    {
      "index": 252, 
      "score": 0.22775444388389587, 
      "sent": "It's a sort of way of witnessing black life, but, again, it does feel like it's coming from the perspective within the black community."
    }, 
    {
      "index": 184, 
      "score": 0.22707514464855194, 
      "sent": "The last time one was awarded to an American-born writer was in 1962 to John Steinbeck."
    }, 
    {
      "index": 240, 
      "score": 0.2266579270362854, 
      "sent": "Among all the books that Morrison championed and shepherded at Random House, \"The Black Book\" stands out as a strange and singular creation and one that vividly captures her notion of writing and publishing from within the black experience, without the white gaze."
    }, 
    {
      "index": 211, 
      "score": 0.22516314685344696, 
      "sent": "What we know now is that the inclusive, empowered revolution that Morrison raised a battle cry for has failed to come to pass."
    }, 
    {
      "index": 82, 
      "score": 0.22508455812931061, 
      "sent": "She also reviewed a biography of Angela Davis for The New York Times in 1972, slamming the author for being \"another simpatico white girl who felt she was privy to the secret of how black revolutionaries got that way."
    }, 
    {
      "index": 261, 
      "score": 0.22387944161891937, 
      "sent": "I think there's always been a lot of surprising and enduring lack of full respect in certain quarters about the fact that Toni Morrison, with 'Beloved,' wrote the best American novel published probably in my lifetime, and it was written about a subject that Americans don't like to talk about or are incapable of talking about in a lot of ways."
    }, 
    {
      "index": 177, 
      "score": 0.22353436052799225, 
      "sent": "\"It is a fact that James Baldwin, celebrated worldwide and posthumously designated as 'immortal' and as 'the conscience of his generation,' never received the honor of these keystones to the canon of American literature.\""
    }, 
    {
      "index": 217, 
      "score": 0.22338680922985077, 
      "sent": "It is not just that her writing is singular; her efforts to change the lay of the land have also been singular."
    }, 
    {
      "index": 230, 
      "score": 0.22295086085796356, 
      "sent": "When we still have to assert that we matter, when African-Americans represent an estimated 1 percent of those working at the big publishing houses, when women and writers of color have to track how seldom they are given chances to tell their stories and when the publishing industry fails to support or encourage this generation's writers of color in any real or meaningful way, a dangerous reality is possible."
    }, 
    {
      "index": 205, 
      "score": 0.2218780517578125, 
      "sent": "Morrison wanted to not only broaden the tastes of the industry, she also wanted to change the fate of a literary culture that had to either diversify or die."
    }, 
    {
      "index": 81, 
      "score": 0.22083257138729095, 
      "sent": "It was Morrison who helped promote Ali's book and who once hired members of the Fruit of Islam to work security for him."
    }, 
    {
      "index": 189, 
      "score": 0.22070255875587463, 
      "sent": "It is also true that a sizable portion of her audience simply looks like her, in a world where black Americans, and people of color in general, are still perceived to be nonreaders."
    }, 
    {
      "index": 229, 
      "score": 0.22064995765686035, 
      "sent": "When young white men again sing songs about lynching black men without being able recall who taught them those songs, and the hateful origins of the N-word are erased by a convenient amnesia to allow its constant use by outsiders, who will tell the stories we don't tell ourselves?"
    }, 
    {
      "index": 6, 
      "score": 0.21992428600788116, 
      "sent": "Morrison wears her age like an Elizabethan regent or a descendant of Othello via Lorain, Ohio."
    }, 
    {
      "index": 218, 
      "score": 0.21944320201873779, 
      "sent": "Junot Diaz recalled to me that seeing Toni Morrison on the cover of Time was revelatory for him as a young writer for this exact reason."
    }, 
    {
      "index": 300, 
      "score": 0.21916444599628448, 
      "sent": "In it, Morrison asks the reader to consider what happens to children who can't forget the torment of an excruciatingly painful childhood."
    }, 
    {
      "index": 299, 
      "score": 0.21905528008937836, 
      "sent": "The new book is a fable-like novel about a well-to-do beauty executive, Bride, who lives in a modern-day California."
    }, 
    {
      "index": 207, 
      "score": 0.21888157725334167, 
      "sent": "By publishing black geniuses, she was also forcing the ranks of the big publishing houses and the industry to become more hospitable to her point of view, to the idea that a black writer could write for a black audience first and still write literature."
    }, 
    {
      "index": 105, 
      "score": 0.21885235607624054, 
      "sent": "Bernard Gotfryd/Getty Images                           Often, in black literature, it seems as though the author is performing two roles: that of the explorer and the explainer."
    }, 
    {
      "index": 95, 
      "score": 0.21842341125011444, 
      "sent": "On one level, Morrison's project is obvious: It is a history that stretches across 11 novels and just as many geographies and eras to tell a story that is hardly chronological but is thematically chained and somewhat continuous."
    }, 
    {
      "index": 154, 
      "score": 0.21826101839542389, 
      "sent": "At Howard, she wanted to write a term paper on the role of black people in Shakespeare, but her professor thought it was \"low-class\" to read and research black life."
    }, 
    {
      "index": 76, 
      "score": 0.21732519567012787, 
      "sent": "Some of these black writers had no formal affiliations, but many others organized themselves under efforts like Baraka's Black Arts Movement, where they could share the duty of not only making art but also writing themselves into the world."
    }, 
    {
      "index": 89, 
      "score": 0.21552139520645142, 
      "sent": "And yet the story of Pecola Breedlove, a broken black girl who wants blue eyes, was a novel that no one saw coming."
    }, 
    {
      "index": 4, 
      "score": 0.21549977362155914, 
      "sent": "A young woman from Random House kept mentioning her sunglasses, how it was bright enough to wear them inside."
    }, 
    {
      "index": 5, 
      "score": 0.21544460952281952, 
      "sent": "Everyone giggled at her nervous chatter, but they seemed to be mostly laughing at her brave attempt to make small talk in the presence of Toni Morrison.The only person not bothered by the glare and the room's awkward giddiness was Morrison herself, who sat at the head of the table, in a thin, black linen caftan, a wool beret and with a sizable diamond ring on one hand."
    }, 
    {
      "index": 74, 
      "score": 0.21461397409439087, 
      "sent": "The black novel was important because it could \"suggest what the conflicts are, what the problems are,\" not necessarily as a means of solving them but as a way of recording and reflecting them."
    }, 
    {
      "index": 301, 
      "score": 0.213933065533638, 
      "sent": "Bride has to connect to others and see past the ways she has busied herself pointlessly with other people's baggage in lieu of becoming something of her own making."
    }, 
    {
      "index": 302, 
      "score": 0.21305699646472931, 
      "sent": "Even though Bride has capitalized off her blackness and her beauty, to become complete, she has to go much deeper and lose all of the symbols and the trappings."
    }, 
    {
      "index": 0, 
      "score": 0.21183212101459503, 
      "sent": "Not too long ago, Toni Morrison sat in the small kitchen attached to the studio where she was recording the audiobook for her newest novel, \"God Help the Child,\" telling a roomful of strangers stories that I will never forget."
    }, 
    {
      "index": 214, 
      "score": 0.21069759130477905, 
      "sent": "But what has remained more elusive is the part that Morrison figured out as an editor: What happens after the workshop and the head count?"
    }, 
    {
      "index": 289, 
      "score": 0.21066474914550781, 
      "sent": "I bummed a cigarette, and the three of us sat over coffee, our smoke spinning in the air, up toward the view of Lower Manhattan.Because Morrison is read the world over, she is perceived to be a known quantity."
    }, 
    {
      "index": 259, 
      "score": 0.20933879911899567, 
      "sent": "\"In some ways, it's less representative of the racial diversity of America than almost any industry I know."
    }, 
    {
      "index": 92, 
      "score": 0.20831333100795746, 
      "sent": "We thought, at the time, that it was because Pecola was having her father's baby that the marigolds did not grow."
    }, 
    {
      "index": 310, 
      "score": 0.20795395970344543, 
      "sent": "It is the story of an old female writer who is accosted by an angry mob of young people."
    }, 
    {
      "index": 239, 
      "score": 0.20791448652744293, 
      "sent": "Above his desk, I spied two copies of \"The Black Book,\" an anthology edited by Morrison and published in 1974 that was an iconoclastic, archival look at black life in America."
    }, 
    {
      "index": 91, 
      "score": 0.20745471119880676, 
      "sent": "The first edition of \"The Bluest Eye\" starts Pecola's story on the cover: \"Quiet as it's kept, there were no marigolds in the fall of 1941."
    }, 
    {
      "index": 100, 
      "score": 0.2062513530254364, 
      "sent": "It is a project that, although ignored by many critics, evidences itself on the page."
    }, 
    {
      "index": 325, 
      "score": 0.20609833300113678, 
      "sent": "\"Michelle,\" she said with a smile that extended to places more important than just her face, \"is one of the biggest brains in this country."
    }, 
    {
      "index": 305, 
      "score": 0.20583613216876984, 
      "sent": "\"Having been eliminated from the lists of urgent national priorities, from TV documentaries and the platitudes of editorials, black people have chosen, or been forced to seek, safety from the white man's promise,\" she wrote in the 1976 Times essay."
    }, 
    {
      "index": 219, 
      "score": 0.20553995668888092, 
      "sent": "\"At that moment,\" he said, \"you could feel the demographic shift, you could feel in the '90s what the future was going to be and when you look at the literary world now, and it's almost like that future was never realized."
    }, 
    {
      "index": 315, 
      "score": 0.20473280549049377, 
      "sent": "There was some part of me that wanted Morrison to play Moses and descend down the mountaintop and tell me what my generation should do next, how we might change these circumstances that we face."
    }, 
    {
      "index": 241, 
      "score": 0.20454679429531097, 
      "sent": "It is a book that works almost like a scrapbook of black life in America: a collection of photographs, illustrations, and essays."
    }, 
    {
      "index": 350, 
      "score": 0.20419721305370331, 
      "sent": "How silly of me to think that she should provide me with an answer to the old woman's riddle, to not see all the ways Morrison has given of herself."
    }, 
    {
      "index": 176, 
      "score": 0.20387686789035797, 
      "sent": "\"Despite the international stature of Toni Morrison, she has yet to receive the national recognition that her five major works of fiction entirely deserve: She has yet to receive the keystone honors of the National Book Award or the Pulitzer Prize,\" they wrote."
    }, 
    {
      "index": 256, 
      "score": 0.20374581217765808, 
      "sent": "Jackson is a diplomatic person, and I could see him thinking when I asked him about the biases of the industry."
    }, 
    {
      "index": 97, 
      "score": 0.20369784533977509, 
      "sent": "But then there is the other mission, the less obvious one, the one in which Morrison often does the unthinkable as a minority, as a woman, as a former member of the working class: She democratically opens the door to all of her books only to say, \"You can come in and you can sit, and you can tell me what you think, and I'm glad you are here, but you should know that this house isn't built for you or by you.\""
    }, 
    {
      "index": 26, 
      "score": 0.20265690982341766, 
      "sent": "But Morrison was in absolute calm, as if this dark space and her own words were a nest of language and she was perfectly at home."
    }, 
    {
      "index": 11, 
      "score": 0.20250572264194489, 
      "sent": "It takes a long time to record a book."
    }, 
    {
      "index": 70, 
      "score": 0.20241248607635498, 
      "sent": "She had recently stopped working as an editor at Random House and published the essay \"Rootedness: The Ancestor as Foundation\" in an anthology."
    }, 
    {
      "index": 153, 
      "score": 0.20224176347255707, 
      "sent": "Morrison was raised to compete on broader stages, with people from all walks of life, and she wasn't used to thinking of white people as the estranged other."
    }, 
    {
      "index": 308, 
      "score": 0.20149199664592743, 
      "sent": "She sees that my generation is ready to push back again, but she knows well that slogans don't create change; she has written often about the emptiness of superficial reform and has said that \"the killing of young black men has never changed all that much, with or without hoodies.\""
    }, 
    {
      "index": 47, 
      "score": 0.20125074684619904, 
      "sent": "\"Morrison is a woman of guardrails and many boundaries; she keeps them up in order to do the work."
    }, 
    {
      "index": 115, 
      "score": 0.2012278139591217, 
      "sent": "While waiting for the boat in Sandusky, Ohio, he lamented that he wanted to be getting along with his trip and was apparently uninterested in passing through the next town, Vermilion, or seeing the small curve of land that would one day be Morrison's birthplace, Lorain."
    }, 
    {
      "index": 103, 
      "score": 0.20094838738441467, 
      "sent": "It is both aphorism and beyond aphorism, and a result has been pure possibility."
    }, 
    {
      "index": 169, 
      "score": 0.20057672262191772, 
      "sent": "In the back pages of The New York Review of Books, she saw an editing position at the textbook division of Random House."
    }, 
    {
      "index": 188, 
      "score": 0.19987374544143677, 
      "sent": "It is this audience that her critics dismiss derisively, suggesting that Morrison panders to them, with long, poetic sentences and stories about broken black women."
    }, 
    {
      "index": 98, 
      "score": 0.19889131188392639, 
      "sent": "Here, blackness isn't a commodity; it isn't inherently political; it is the race of a people who are varied and complicated."
    }, 
    {
      "index": 183, 
      "score": 0.19827218353748322, 
      "sent": "She is still, 20 years later, the only living American laureate for literature."
    }, 
    {
      "index": 135, 
      "score": 0.19822095334529877, 
      "sent": "When Morrison's father was 14 or 15, two black businessmen who lived on his street were lynched in succession, and afterward, he left the South and by a circuitous route headed to Ohio."
    }, 
    {
      "index": 234, 
      "score": 0.19785729050636292, 
      "sent": "I had come to see Chris Jackson, the executive editor at Spiegel & Grau, an imprint of Random House, and one of the roughly five or six black senior editors in America with a position at a major publishing company."
    }, 
    {
      "index": 134, 
      "score": 0.19755613803863525, 
      "sent": "After sending a message to her husband that they could no longer stay put, Morrison's grandmother took her children in the dead of the night and got on the first train they could find that would take them away."
    }, 
    {
      "index": 13, 
      "score": 0.19720847904682159, 
      "sent": "But that's not how Morrison hears her own sentences, so she does these tedious sessions herself."
    }, 
    {
      "index": 356, 
      "score": 0.196958988904953, 
      "sent": "Instead, she mined what came before so it could be applied to the present, applied, perhaps, to the person who feels diminished or the readers who need to be reminded that they cannot easily turn their back on this country's inherited history, and those who are not like them."
    }, 
    {
      "index": 24, 
      "score": 0.19626963138580322, 
      "sent": "Some people can't do it, can't sit in that dimly lit sarcophagus-like space and read."
    }, 
    {
      "index": 191, 
      "score": 0.196144700050354, 
      "sent": "In an interview for The Paris Review, she said: \"I would like to write novels that were unmistakably mine but nevertheless fit first into African-American traditions and, second of all, this whole thing called literature.\""
    }, 
    {
      "index": 35, 
      "score": 0.19593439996242523, 
      "sent": "My mention of New Orleans prompted her to tell a tale that she heard from a friend that must be passed along."
    }, 
    {
      "index": 124, 
      "score": 0.19455903768539429, 
      "sent": "Was it even possible for Dickens to imagine that within a leap of a hundred years a girl would be born there who would become one the few people who could relate to his lofty position as one of the greatest writers ever to live?"
    }, 
    {
      "index": 303, 
      "score": 0.19434750080108643, 
      "sent": "A compilation of black culture, edited by Morrison and published in 1974."
    }, 
    {
      "index": 257, 
      "score": 0.19421996176242828, 
      "sent": "For example, how when Morrison became the first black woman to be awarded the Nobel Prize for Literature in 1993, there were those who asked if she deserved the award."
    }, 
    {
      "index": 150, 
      "score": 0.19419461488723755, 
      "sent": "I didn't tell her that when I once drove through Lorain, with the big sky looking, as she once wrote, \"carnival\" over the flat, Midwestern expanse, it seemed like a place perfect for an imaginative child -- a keen observer, a relentless reader whose mind was full of her mother's ghost stories, visions of Russian dachas from Tolstoy, and Moorish princes from Shakespeare and poor-orphan fairy tales from Dickens -- to come up with characters of her own."
    }, 
    {
      "index": 171, 
      "score": 0.19379931688308716, 
      "sent": "With two young sons, Morrison moved to Syracuse and started to work in the completely foreign industry of editors, agents and writers."
    }, 
    {
      "index": 242, 
      "score": 0.19273804128170013, 
      "sent": "It contains quotes from the poet Henry Dumas and cartoons of sambos carrying watermelons, along with pictures of pretty black centerfolds and stories about runaways who made their break for freedom and found it."
    }, 
    {
      "index": 152, 
      "score": 0.19239388406276703, 
      "sent": "The first was that she never would be the sort of person who would be roped in by self-satisfied, self-segregating celebrations of blackness as something unimpeachable."
    }, 
    {
      "index": 309, 
      "score": 0.19228750467300415, 
      "sent": "In 1993, when Morrison received the Nobel, she told a folk tale that she has since told often."
    }, 
    {
      "index": 362, 
      "score": 0.19226935505867004, 
      "sent": "She has written for The Paris Review, Bookforum, Transition, Rolling Stone and The Believer, in which she published a profile of the comedian Dave Chappelle that was a finalist for a National Magazine Award last year."
    }, 
    {
      "index": 355, 
      "score": 0.19224303960800171, 
      "sent": "In it, Morrison cemented the fact that her interest in history and looking back has hardly been a vain, nostalgic project."
    }, 
    {
      "index": 165, 
      "score": 0.19211597740650177, 
      "sent": "Katy Grannan for The New York Times                           After college and graduate school at Cornell, Morrison eventually returned to Howard to teach."
    }, 
    {
      "index": 179, 
      "score": 0.19199551641941071, 
      "sent": "They refused to stand by as it was snubbed by the National Book Awards."
    }, 
    {
      "index": 123, 
      "score": 0.19145667552947998, 
      "sent": "At the time of Dickens's visit, 19 years before the Civil War, there were laws that prohibited black enslaved people from being taught to read or write."
    }, 
    {
      "index": 15, 
      "score": 0.19032983481884003, 
      "sent": "We followed along in the control room, listening to her barely-a-whisper voice read from a chapter called \"Sweetness\": \"It's not my fault."
    }, 
    {
      "index": 36, 
      "score": 0.19031961262226105, 
      "sent": "It goes like this: There was once a man who lived in New Orleans."
    }, 
    {
      "index": 243, 
      "score": 0.18970252573490143, 
      "sent": "I asked Jackson if he thought that \"The Black Book\" opened the parameters of people's perception of what black literature would look like at Random House."
    }, 
    {
      "index": 25, 
      "score": 0.18963037431240082, 
      "sent": "Others who have recorded there have kept the door open because the booth was too confining."
    }, 
    {
      "index": 38, 
      "score": 0.18906497955322266, 
      "sent": "Now, this man's name was Big Lunch, and folks called him that because he was known for always coming around midday and asking for whatever food people had to spare."
    }, 
    {
      "index": 206, 
      "score": 0.18894530832767487, 
      "sent": "She told me that the books she edited and wrote were her contribution to the civil rights movement."
    }, 
    {
      "index": 248, 
      "score": 0.18869638442993164, 
      "sent": "He added, \"I think white editors at that time, and even today, are mostly looking for black writers working in whatever mode happens to be selling at the time; either that, or writers who were writing out of protest,\" he said."
    }, 
    {
      "index": 208, 
      "score": 0.18852077424526215, 
      "sent": "She was more humanist than nationalistic, more visionary than didactic, but to some extent her editorial work was political."
    }, 
    {
      "index": 88, 
      "score": 0.18819613754749298, 
      "sent": "In many ways, she had prepared the world for her voice and heralded her arrival with her own editorial work."
    }, 
    {
      "index": 190, 
      "score": 0.18796592950820923, 
      "sent": "But of course Morrison, rather than feeling marginalized or slighted by that criticism, takes delight in it."
    }, 
    {
      "index": 151, 
      "score": 0.18738764524459839, 
      "sent": "Life in Lorain taught Morrison a few things that were to set her apart when she went off to Washington, D.C., to study literature at Howard University."
    }, 
    {
      "index": 108, 
      "score": 0.18715278804302216, 
      "sent": "Most important, she is an author who writes to tease and complicate her world, not to convince others it is valid."
    }, 
    {
      "index": 1, 
      "score": 0.18654948472976685, 
      "sent": "The studio, a small, refurbished barn in Katonah, N.Y., was more than a hundred years old, but only a few rustic touches remained, like a sliding barn door and knotty pine floors."
    }, 
    {
      "index": 352, 
      "score": 0.18642866611480713, 
      "sent": "And even though I later sent her clips of Kendrick Lamar through her assistant, because she got excited when I told her that his work reminded me of Joyce's \"Dubliners\" but set in Compton, I never spoke to Morrison again."
    }, 
    {
      "index": 175, 
      "score": 0.1860392838716507, 
      "sent": "\"In 1988, a collective of 48 black writers and intellectuals published and signed a statement in The New York Times, upbraiding the publishing industry for its \"oversight and harmful whimsy\" toward Morrison and James Baldwin."
    }, 
    {
      "index": 14, 
      "score": 0.18600267171859741, 
      "sent": "That day, she would go into a narrow, low-lit booth, carrying a small pillow for her back, sit down and read from her new book for hours."
    }, 
    {
      "index": 231, 
      "score": 0.18449607491493225, 
      "sent": "What will happen to the next generation of authors who are writing from the margins?The lobby of Random House is full of old books displayed inside towering glass cases."
    }, 
    {
      "index": 187, 
      "score": 0.18447118997573853, 
      "sent": "She is often discussed in terms of her audience, the older black women who fan themselves with her book covers at her readings, the teenage girls who sigh on buses and trains while reading \"Sula\" for class, the young male rappers who have interpolated lines from \"The Bluest Eye\" into their songs."
    }, 
    {
      "index": 157, 
      "score": 0.1841299831867218, 
      "sent": "But in Washington, she also encountered for the first time lunch counters she could not sit at, fountains she could not drink from and stores where her money was simply no good."
    }, 
    {
      "index": 34, 
      "score": 0.18407844007015228, 
      "sent": "As a defense against our smothering neediness, she tried to preserve herself, the private person inside the author, by telling us stories."
    }, 
    {
      "index": 254, 
      "score": 0.18379096686840057, 
      "sent": "It's almost a family history in a way."
    }, 
    {
      "index": 258, 
      "score": 0.18369294703006744, 
      "sent": "\"The literary community is not free of the prejudices of larger society, to put it nicely,\" he said."
    }, 
    {
      "index": 96, 
      "score": 0.18330951035022736, 
      "sent": "This is the project most readily understood and accepted by even her least generous critics."
    }, 
    {
      "index": 340, 
      "score": 0.18298360705375671, 
      "sent": "She remembered a trip down South, when her host put her sheets out to dry on the jasmine bush -- or was it a frangipani tree -- and then ironed them."
    }, 
    {
      "index": 193, 
      "score": 0.18279352784156799, 
      "sent": "If it assimilates into a different or larger pool, so much the better."
    }, 
    {
      "index": 77, 
      "score": 0.1826578676700592, 
      "sent": "They were not just producing poems, plays and novels, they were also considering the obligations of their specific genre -- black literature -- and its defining aspects and distinct functions."
    }, 
    {
      "index": 78, 
      "score": 0.18265643715858459, 
      "sent": "We no longer connect Morrison to that earlier, loosely defined constellation of black writing, but she was there, and she was there long before she was a novelist."
    }, 
    {
      "index": 361, 
      "score": 0.18178845942020416, 
      "sent": "Rachel Kaadzi Ghansah is a contributing writer for the magazine."
    }, 
    {
      "index": 142, 
      "score": 0.18176242709159851, 
      "sent": "But Morrison didn't grow up, she said, \"with that particular kind of alarm or fear or distrust of white people, personally.\""
    }, 
    {
      "index": 174, 
      "score": 0.1817357987165451, 
      "sent": "\"Literary space is not an immutable structure, fixed once and for all in its hierarchies and power relations,\" Casanova writes, adding that \"even if the unequal distribution of literary resources assures that such forms of domination will endure, it is also a source of incessant struggle of challenges to authority and legitimacy, of rebellions, insubordination and, ultimately, revolutions that alter the balance of literary power and rearrange existing hierarchies."
    }, 
    {
      "index": 262, 
      "score": 0.18154120445251465, 
      "sent": "\"But I do think the resentment, part of it, is that the self-conscious literary establishment is a clubby kind of world where everyone is like, 'Well, this is not the person who's my person, who represents me,' and the literary world in America is filled with people who are represented by white men or white women."
    }, 
    {
      "index": 247, 
      "score": 0.18110136687755585, 
      "sent": "Editors were looking for black literature that felt like a commentary on black life, and she was doing books that were about the kind of internal experience of being black, just like the books she writes are.\""
    }, 
    {
      "index": 359, 
      "score": 0.18108050525188446, 
      "sent": "This is a question not just for her character but for anyone who has been listening to Morrison's entire unforgettable liturgy: Who told you?"
    }, 
    {
      "index": 313, 
      "score": 0.18085901439189911, 
      "sent": "To be set adrift from the one you knew, to live at the edge of towns that cannot bear your company."
    }, 
    {
      "index": 221, 
      "score": 0.18009401857852936, 
      "sent": "When I asked him to explain, he said: \"Well, if you think about what the colors and faces and the backgrounds of our young people are in all of our public schools, and then you look at the writers who this society valorizes, the disconnect is intergalactic."
    }, 
    {
      "index": 293, 
      "score": 0.17976172268390656, 
      "sent": "In 2008, the novelist Charles Johnson, author of \"Middle Passage,\" said, \"I don't want to say she's beating a dead horse, but she probably feels more comfortable writing about that period as opposed to something more contemporary.\""
    }, 
    {
      "index": 71, 
      "score": 0.17944918572902679, 
      "sent": "The essay in many ways articulated the terms that would define her writing."
    }, 
    {
      "index": 158, 
      "score": 0.1793128103017807, 
      "sent": "The confines of the campus acted as a space of blessed comfort."
    }, 
    {
      "index": 7, 
      "score": 0.17896661162376404, 
      "sent": "Long before we met, I read that she could be impervious at times, coquettish at others."
    }, 
    {
      "index": 93, 
      "score": 0.17894208431243896, 
      "sent": "\"Morrison's work, since she published that first novel, has always delivered a heavy load."
    }, 
    {
      "index": 80, 
      "score": 0.17893417179584503, 
      "sent": "Jones's manuscript was so impressive that when Morrison read it for the first time, uppermost in her mind, she once wrote, was \"that no novel about any black woman could ever be the same after this.\""
    }, 
    {
      "index": 306, 
      "score": 0.17814311385154724, 
      "sent": "\"In the shambles of closing admissions, falling quotas, widening salary gaps and merging black-studies departments, builders and healers are quietly working among us.\""
    }, 
    {
      "index": 250, 
      "score": 0.17812100052833557, 
      "sent": "He noticed my distraction and said: \" 'The Black Book' is not exactly a celebration of black life."
    }, 
    {
      "index": 307, 
      "score": 0.17729641497135162, 
      "sent": "That piece was written long ago, but Morrison still seems to be fighting for higher stakes, whether she admits it or not."
    }, 
    {
      "index": 253, 
      "score": 0.17707136273384094, 
      "sent": "It's not like an anthropological book at all."
    }, 
    {
      "index": 75, 
      "score": 0.17543515563011169, 
      "sent": "For years, dozens upon dozens of prominent black writers -- people like Amiri Baraka, Maya Angelou, Jayne Cortez, Nikki Giovanni and John Edgar Wideman -- were in orbit with one another."
    }, 
    {
      "index": 182, 
      "score": 0.17538309097290039, 
      "sent": "A few years after that, she won the Nobel Prize."
    }, 
    {
      "index": 272, 
      "score": 0.17470143735408783, 
      "sent": "It was one of those moments in which New York feels timeless."
    }, 
    {
      "index": 55, 
      "score": 0.17445768415927887, 
      "sent": "\"She wasn't too interested in her 84th birthday, she said, until President Obama's office called the other day to plan a lunch."
    }, 
    {
      "index": 37, 
      "score": 0.17442485690116882, 
      "sent": "A city that is like no other place in this country."
    }, 
    {
      "index": 49, 
      "score": 0.17430546879768372, 
      "sent": "\"It's a serious protection: emotionally, even intellectually, from the world.\""
    }, 
    {
      "index": 131, 
      "score": 0.17420363426208496, 
      "sent": "Morrison recalled that her grandmother, Ardelia Willis, realized as the months passed that the white boys in the area were \"circling,\" meaning her girls were getting toward that age."
    }, 
    {
      "index": 107, 
      "score": 0.17396056652069092, 
      "sent": "Morrison writes stories that are more aesthetic than overtly political, better expressed in accurate Tolstoyan detail than in generalizing sentiments blunted with anger."
    }, 
    {
      "index": 31, 
      "score": 0.1736835241317749, 
      "sent": "During her breaks, Morrison would take her place at the table, and within minutes she was surrounded."
    }, 
    {
      "index": 260, 
      "score": 0.17306965589523315, 
      "sent": "I feel like black literature, black art, has always been put in a separate category."
    }, 
    {
      "index": 238, 
      "score": 0.17268083989620209, 
      "sent": "His desk is cluttered with magazines like The New Yorker and The Atlantic, marked drafts and a picture of his young son."
    }, 
    {
      "index": 113, 
      "score": 0.17241846024990082, 
      "sent": "\"In 1842, Charles Dickens, at the time one of the greatest authors writing in English, took a steamboat trip across Lake Erie."
    }, 
    {
      "index": 186, 
      "score": 0.1719740629196167, 
      "sent": "This is a problem even for Morrison."
    }, 
    {
      "index": 72, 
      "score": 0.17187085747718811, 
      "sent": "She noted that the novel \"has always functioned for the class or the group that wrote it.\""
    }, 
    {
      "index": 268, 
      "score": 0.17138980329036713, 
      "sent": "It was still winter, but the day had spring undertones, a good deal of sun and now a pink evening sky that I could see through the slots of the skyscrapers."
    }, 
    {
      "index": 116, 
      "score": 0.1712452620267868, 
      "sent": "Dickens concluded that \"their demeanor in these country parts is invariably morose, sullen, clownish and repulsive."
    }, 
    {
      "index": 69, 
      "score": 0.17119164764881134, 
      "sent": "In 1984, Morrison was a single mother and a novelist with four books to her name, three of which -- \"The Bluest Eye,\" \"Sula\" and \"Song of Solomon\" -- are now considered classics."
    }, 
    {
      "index": 102, 
      "score": 0.17116436362266541, 
      "sent": "Instead, she makes black life -- regular, quotidian black life, the kind that doesn't sell out concert halls or sports stadiums -- complex, fantastic and heroic, despite its devaluation."
    }, 
    {
      "index": 99, 
      "score": 0.17096686363220215, 
      "sent": "This is where her works become less of a history and more of a liturgy, still stretching across geographies and time, but now more pointedly, to capture and historicize: This is how we pray, this is how we escape, this is how we hurt, this is how we repent, this is how we move on."
    }, 
    {
      "index": 249, 
      "score": 0.17077748477458954, 
      "sent": "As he spoke, I flipped through his first-edition copy of \"The Black Book,\" because I had never seen it before."
    }, 
    {
      "index": 297, 
      "score": 0.17039376497268677, 
      "sent": "That said, the criticism that she only writes about the distant past no longer flies."
    }, 
    {
      "index": 143, 
      "score": 0.16978372633457184, 
      "sent": "She described Lorain as a place where \"immigrants were everywhere, Italians and Polish people and Jewish people and black people."
    }, 
    {
      "index": 220, 
      "score": 0.16973823308944702, 
      "sent": "The literary world has tripled down on its whiteness.\""
    }, 
    {
      "index": 292, 
      "score": 0.16966699063777924, 
      "sent": "Many people cling to her for this, but just as many think she has written herself into a literary ghetto."
    }, 
    {
      "index": 364, 
      "score": 0.16939987242221832, 
      "sent": "A version of this article appears in print on April 12, 2015, on page MM38 of the Sunday Magazine with the headline: What Toni Morrison Saw."
    }, 
    {
      "index": 233, 
      "score": 0.16908113658428192, 
      "sent": "Prominently centered is an early edition of \"Song of Solomon,\" by Morrison."
    }, 
    {
      "index": 2, 
      "score": 0.16895371675491333, 
      "sent": "A solid kitchen table had been laid with fresh fruits, muffins and tins of jam."
    }, 
    {
      "index": 104, 
      "score": 0.16893035173416138, 
      "sent": "Morrison in 1970, during her time as an editor at Random House."
    }, 
    {
      "index": 141, 
      "score": 0.16891257464885712, 
      "sent": "She wrote about this incident in an essay for this magazine in 1976, and concluded that even though she was very small when she witnessed it, it taught her something key: \"that my father could win\" and \"that it was possible to win.\""
    }, 
    {
      "index": 3, 
      "score": 0.16869102418422699, 
      "sent": "Beams of sunlight reflected off the blindingly white snow outside the glass window."
    }, 
    {
      "index": 246, 
      "score": 0.1686742901802063, 
      "sent": "\"But I think that at that time there weren't, and today there aren't, a lot of black editors."
    }, 
    {
      "index": 130, 
      "score": 0.16811685264110565, 
      "sent": "She grew up hearing about how her mother's father, John Solomon Willis, a violinist, often had to leave his wife and family behind on a farm in Greenville, Ala., to go to Birmingham to make money."
    }, 
    {
      "index": 111, 
      "score": 0.16795985400676727, 
      "sent": "But what interested me was the African-American experience throughout whichever time I spoke of."
    }, 
    {
      "index": 283, 
      "score": 0.16782955825328827, 
      "sent": "It was one of the biggest apartments I have seen in the city."
    }, 
    {
      "index": 324, 
      "score": 0.16776108741760254, 
      "sent": "She told me about the unexpected thrills that can occur only late in one's life, like changes in power that you never expected: Pope Francis, for example, or Michelle Obama."
    }, 
    {
      "index": 19, 
      "score": 0.16752538084983826, 
      "sent": "\"Toni,\" the director said at one point through his microphone, \"can you do that sentence over?"
    }, 
    {
      "index": 83, 
      "score": 0.16739004850387573, 
      "sent": "\"And when the poet Henry Dumas went to his death, the way so many black boys and men do, it was Morrison, who never had a chance to meet him and published his work posthumously, who sent around a book-party announcement that was part invitation, part consolation, which read: \"In 1968, a young black man, Henry Dumas, went through a turnstile at a New York City subway station."
    }, 
    {
      "index": 50, 
      "score": 0.16718658804893494, 
      "sent": "Journalists from Europe and elsewhere call these days, one after the other, and they try to be coy, but she can tell what they really want to know."
    }, 
    {
      "index": 197, 
      "score": 0.16618111729621887, 
      "sent": "I mean, they can all be Russian, French, Irish or Catholic, they write out of where they come from, and I do too.\""
    }, 
    {
      "index": 251, 
      "score": 0.16613420844078064, 
      "sent": "It is a gathering together of artifacts."
    }, 
    {
      "index": 86, 
      "score": 0.16605308651924133, 
      "sent": "Before that happened, however, he had written some of the most beautiful, moving and profound poetry and fiction that I have ever in my life read."
    }, 
    {
      "index": 203, 
      "score": 0.16601797938346863, 
      "sent": "Morrison receiving the Presidential Medal of Freedom from Barack Obama in 2012."
    }, 
    {
      "index": 181, 
      "score": 0.1658877432346344, 
      "sent": "\"Two months later, Morrison was awarded the Pulitzer Prize."
    }, 
    {
      "index": 56, 
      "score": 0.16583786904811859, 
      "sent": "When she told us this, oohs and aahs went around the room."
    }, 
    {
      "index": 149, 
      "score": 0.16555055975914001, 
      "sent": "There was a railroad that ran through Lorain, and when she was little, her father used to take her and her sister, Lois, out to collect fallen bits of coal as the train trembled by."
    }, 
    {
      "index": 87, 
      "score": 0.16541217267513275, 
      "sent": "\"Two years after Dumas's death, Morrison published her first novel, at 39."
    }, 
    {
      "index": 46, 
      "score": 0.16512027382850647, 
      "sent": "\"Because,\" she said, looking intently at me with a smile that had nothing to do with anything funny, \"those people didn't know that all of that crust was what had been keeping him alive."
    }, 
    {
      "index": 192, 
      "score": 0.16401232779026031, 
      "sent": "She added: \"It's very important to me that my work be African-American."
    }, 
    {
      "index": 73, 
      "score": 0.16398055851459503, 
      "sent": "The novel that concerned itself with black Americans was remarkable and needed, she wrote, because it accomplished \"certain very strong functions,\" now that \"we don't live in places where we can hear those stories anymore\" and \"parents don't sit around and tell their children those classical, mythological archetypal stories that we heard years ago.\""
    }, 
    {
      "index": 129, 
      "score": 0.16343985497951508, 
      "sent": "Her parents, Ramah and George Wofford, were Southerners who came to Ohio at the beginning of the 20th century."
    }, 
    {
      "index": 155, 
      "score": 0.16343328356742859, 
      "sent": "It also made her uneasy and deeply disappointed that at Howard, skin color worked as a caste system."
    }, 
    {
      "index": 210, 
      "score": 0.1625162810087204, 
      "sent": "\"We need a heroic writer's movement: assertive, militant, pugnacious.\""
    }, 
    {
      "index": 291, 
      "score": 0.16249746084213257, 
      "sent": "She is a black woman who writes about black people."
    }, 
    {
      "index": 294, 
      "score": 0.16231729090213776, 
      "sent": "But he added, \"I do think clearly that slavery-era stories and segregation-era stories are stories about the past."
    }, 
    {
      "index": 271, 
      "score": 0.16149954497814178, 
      "sent": "The building directly adjacent to his office seemed to be a hotel, and someone was turning down the sheets."
    }, 
    {
      "index": 237, 
      "score": 0.16139960289001465, 
      "sent": "He has the contemplative look of a person who has spent most of his life reading."
    }, 
    {
      "index": 235, 
      "score": 0.16103488206863403, 
      "sent": "Jackson's office is full of books by the authors he has published: Victor LaValle's acclaimed novels, Mat Johnson's \"Pym,\" Eddie Huang's \"Fresh Off the Boat\" and Bryan Stevenson's \"Just Mercy.\""
    }, 
    {
      "index": 112, 
      "score": 0.16052918136119843, 
      "sent": "It was always about African-American culture and people -- good, bad, indifferent, whatever -- but that was, for me, the universe."
    }, 
    {
      "index": 358, 
      "score": 0.16027995944023132, 
      "sent": "the old women of Lotus, Ga., asks the protagonist in \"Home.\""
    }, 
    {
      "index": 204, 
      "score": 0.15976512432098389, 
      "sent": "Leigh Vogel/WireImage                           This was a radical idea."
    }, 
    {
      "index": 267, 
      "score": 0.15944303572177887, 
      "sent": "From Time Magazine, Jan. 19, 1998, Time Inc. Used under license."
    }, 
    {
      "index": 117, 
      "score": 0.15939028561115265, 
      "sent": "I should think there is not, on the face of the earth, a people so destitute of humor, vivacity or the capacity of enjoyment."
    }, 
    {
      "index": 290, 
      "score": 0.1585557758808136, 
      "sent": "She has an audience, she has awards."
    }, 
    {
      "index": 287, 
      "score": 0.1585402637720108, 
      "sent": "It was a steel-gray winter Monday morning, and through the windows, the bridges in the distance looked as if they were held up by land masses made of sleet and ice."
    }, 
    {
      "index": 27, 
      "score": 0.15825064480304718, 
      "sent": "Because of how she was positioned, I couldn't see her; I could hear only her voice."
    }, 
    {
      "index": 119, 
      "score": 0.15812228620052338, 
      "sent": "I am quite serious when I say that I have not heard a hearty laugh these six weeks, except my own; nor have I seen a merry face on any shoulders but a black man's."
    }, 
    {
      "index": 222, 
      "score": 0.15810337662696838, 
      "sent": "It's almost as if they saw the future in the Time cover and said, 'Well, we've got to make sure to get Franzen on the cover as a prayer against, or an attempt to exorcise, that imminent future.'"
    }, 
    {
      "index": 311, 
      "score": 0.15797881782054901, 
      "sent": "Doubting her wisdom, they demand that she tell them something relevant."
    }, 
    {
      "index": 329, 
      "score": 0.15741656720638275, 
      "sent": "She marveled at the ways of being that people have let go of, that mystify her."
    }, 
    {
      "index": 22, 
      "score": 0.15699423849582672, 
      "sent": "\"Toni,\" he would say, \"let's do that part over again.\""
    }, 
    {
      "index": 344, 
      "score": 0.15678001940250397, 
      "sent": "All she would tell me was that a good story is one that ends with what she called \"the acquisition of knowledge."
    }, 
    {
      "index": 209, 
      "score": 0.15677502751350403, 
      "sent": "\"We don't need any more writers as solitary heroes,\" Morrison said in her 1981 keynote address at the American Writers Congress."
    }, 
    {
      "index": 298, 
      "score": 0.15647211670875549, 
      "sent": "\"Love\" and \"God Help the Child\" are each set in the 20th century."
    }, 
    {
      "index": 216, 
      "score": 0.15632995963096619, 
      "sent": "How do people change an industry?Morrison serves as a totem for so much of this energy."
    }, 
    {
      "index": 109, 
      "score": 0.15589502453804016, 
      "sent": "\"What I'm interested in is writing without the gaze, without the white gaze,\" she told me."
    }, 
    {
      "index": 48, 
      "score": 0.15560851991176605, 
      "sent": "The work \"protects,\" she told me."
    }, 
    {
      "index": 198, 
      "score": 0.15494336187839508, 
      "sent": "It is a reply that stumps her interviewer."
    }, 
    {
      "index": 288, 
      "score": 0.15492098033428192, 
      "sent": "Morrison sat smoking with one of her closest friends, a petite white woman named Eileen."
    }, 
    {
      "index": 79, 
      "score": 0.15454213321208954, 
      "sent": "During the years that she worked at Random House, she published books by Muhammad Ali, Henry Dumas, Angela Davis, Huey P. Newton, Toni Cade Bambara and Gayl Jones, whom she discovered in the 1970s."
    }, 
    {
      "index": 345, 
      "score": 0.15394206345081329, 
      "sent": "\"When I finally left Morrison's apartment, she was about to get on the phone with Lois, to ask after her well being and her day in Lorain."
    }, 
    {
      "index": 274, 
      "score": 0.15331919491291046, 
      "sent": "It was the end of the workday, and the elevator stopped on almost every floor."
    }, 
    {
      "index": 346, 
      "score": 0.15305572748184204, 
      "sent": "Her sister had not been doing well, she was in the hospital, and I watched Morrison's hands tremble as she took the call."
    }, 
    {
      "index": 156, 
      "score": 0.15249274671077728, 
      "sent": "This was something she had only read about, and she found it off-putting and silly."
    }, 
    {
      "index": 195, 
      "score": 0.152370885014534, 
      "sent": "Joyce is not asked to do that."
    }, 
    {
      "index": 269, 
      "score": 0.15179258584976196, 
      "sent": "Across the way, I could see a dance class that was in session, a row of arms in flight."
    }, 
    {
      "index": 20, 
      "score": 0.15164455771446228, 
      "sent": "Can you pronounce 'tangerine' with more emphasis on the 'rine?'"
    }, 
    {
      "index": 120, 
      "score": 0.15110507607460022, 
      "sent": "\"When I first read this, I wondered for days who this merry black man was who was so remarkably different from the other Ohioans that Dickens encountered."
    }, 
    {
      "index": 42, 
      "score": 0.15104454755783081, 
      "sent": "Somehow or other, Big Lunch got into an accident, and when they got him to the hospital, they washed him."
    }, 
    {
      "index": 145, 
      "score": 0.15001104772090912, 
      "sent": "So I never lived in a black neighborhood, and the schools were mixed, and there was one high school."
    }, 
    {
      "index": 312, 
      "score": 0.14946871995925903, 
      "sent": "They ask her to tell them how to cope with being marginalized, while \"having no home in this place."
    }, 
    {
      "index": 17, 
      "score": 0.14934374392032623, 
      "sent": "I didn't do it and have no idea how it happened."
    }, 
    {
      "index": 140, 
      "score": 0.14930355548858643, 
      "sent": "Once I saw him throw a white man down the stairs, because he thought he was coming -- I think the guy was drunk -- but still he was coming up the stairs, and my father thought he was after his girls, so he picked him up and threw him down the stairs and threw our tricycle after him.\""
    }, 
    {
      "index": 133, 
      "score": 0.14923128485679626, 
      "sent": "This image and her grandmother's way of speech have stayed with her: \"I like the way she said 'circling,' \" Morrison told me."
    }, 
    {
      "index": 255, 
      "score": 0.14920102059841156, 
      "sent": "Again, I think that points to the difference in her perspective.\""
    }, 
    {
      "index": 318, 
      "score": 0.14840331673622131, 
      "sent": "She told me about the people she adores fiercely: her son, Harold Ford, and her granddaughters."
    }, 
    {
      "index": 45, 
      "score": 0.14818955957889557, 
      "sent": "But as days passed, instead of getting better, Big Lunch began to get sicker, sicker, until finally one day he took his last breath and died."
    }, 
    {
      "index": 284, 
      "score": 0.14729389548301697, 
      "sent": "Large, evocative, abstract paintings by her deceased son, Slade, hung on most of the walls."
    }, 
    {
      "index": 51, 
      "score": 0.14690360426902771, 
      "sent": "\"They are just calling to see when I'm going to die.\""
    }, 
    {
      "index": 114, 
      "score": 0.14658872783184052, 
      "sent": "He was most excited to see Niagara Falls."
    }, 
    {
      "index": 194, 
      "score": 0.14647798240184784, 
      "sent": "But I shouldn't be asked to do that."
    }, 
    {
      "index": 110, 
      "score": 0.14623822271823883, 
      "sent": "\"In so many earlier books by African-American writers, particularly the men, I felt that they were not writing to me."
    }, 
    {
      "index": 363, 
      "score": 0.14604134857654572, 
      "sent": "Sign up for our newsletter to get the best of The New York Times Magazine delivered to your inbox every week."
    }, 
    {
      "index": 139, 
      "score": 0.14575999975204468, 
      "sent": "\"One of the most important things she remembers about her father, she told me, is \"how much he hated white people."
    }, 
    {
      "index": 348, 
      "score": 0.14571227133274078, 
      "sent": "I had spent hours with Morrison, accosting her with questions, thinking about her, observing her, and yet for the first time I understood Morrison was a person with real human concerns."
    }, 
    {
      "index": 263, 
      "score": 0.14526976644992828, 
      "sent": "I mean, there are almost no people in literature represented by a black woman, right?\""
    }, 
    {
      "index": 354, 
      "score": 0.14477461576461792, 
      "sent": "Usually, what comes to mind during those moments is her last book, \"Home.\""
    }, 
    {
      "index": 170, 
      "score": 0.14458614587783813, 
      "sent": "She applied and got the job."
    }, 
    {
      "index": 285, 
      "score": 0.14448054134845734, 
      "sent": "There were built-in white bookcases that stretched up to the ceilings, and here and there were solid but elegantly carved pieces of antique furniture: a drafting table in the foyer, a long table for dining."
    }, 
    {
      "index": 282, 
      "score": 0.1439199298620224, 
      "sent": "The last afternoon I spent with Toni Morrison was at her loft in TriBeCa."
    }, 
    {
      "index": 278, 
      "score": 0.14304253458976746, 
      "sent": "Two younger women got on, holding tote bags full of books, as most young people in this scene do."
    }, 
    {
      "index": 41, 
      "score": 0.14303998649120331, 
      "sent": "And of course, over time all that food and dirt began to crust and that crust caked over his skin."
    }, 
    {
      "index": 245, 
      "score": 0.14299504458904266, 
      "sent": "\"It's hard to say, because I can't speak authoritatively on the publishing scene in the 1970s,\" he said."
    }, 
    {
      "index": 159, 
      "score": 0.14288380742073059, 
      "sent": "She simply could not take segregation seriously."
    }, 
    {
      "index": 314, 
      "score": 0.14280959963798523, 
      "sent": "\"Sitting in her apartment, I realized that every time we talked, I was just like one of those demanding young people."
    }, 
    {
      "index": 64, 
      "score": 0.14229726791381836, 
      "sent": "I've never worn jeans in my life, and I'm certainly not going to wear them to the White House."
    }, 
    {
      "index": 227, 
      "score": 0.14214271306991577, 
      "sent": "I was worried about what will happen to the stories."
    }, 
    {
      "index": 223, 
      "score": 0.1420367956161499, 
      "sent": "\"Later, at home, after having spent time with Morrison and rereading \"Beloved\" and \"God Help the Child\" back to back, an embarrassing thing happened to me: I felt a knot in my throat that then became heavy sadness."
    }, 
    {
      "index": 94, 
      "score": 0.14195162057876587, 
      "sent": "Her books are populated by both history and the people who are left out of history: a jealous, mentally ill hairdresser with a sharp knife (\"Jazz,\" 1992); a man who as a child suckled at his mother's breast until those in the community found it odd (\"Song of Solomon,\" 1977); an enslaved woman, who would rather slice her own daughter's neck than let captivity happen to her (\"Beloved,\" 1987); and a destitute little girl, belly swollen with her father's child, holding a Shirley Temple cup, desperate to have Temple's bright blue eyes (\"The Bluest Eye,\" 1970)."
    }, 
    {
      "index": 160, 
      "score": 0.1416981965303421, 
      "sent": "\"I think it's a theatrical thing,\" she told me."
    }, 
    {
      "index": 339, 
      "score": 0.14146676659584045, 
      "sent": "\"There is nothing in the world like ironed sheets.\""
    }, 
    {
      "index": 280, 
      "score": 0.14135991036891937, 
      "sent": "I did not feel any different from them or think twice about myself, until I got to the lobby, where I realized that the only black or Latino people I had seen that afternoon besides Jackson were the security guards in the lobby."
    }, 
    {
      "index": 39, 
      "score": 0.14104166626930237, 
      "sent": "He put that food in his pockets, in his coat, in his pants, and when that food went bad, he didn't mind."
    }, 
    {
      "index": 232, 
      "score": 0.14079843461513519, 
      "sent": "There is a worn cookbook by Escoffier; \"No Exit,\" by Sartre; \"Moby-Dick,\" by Melville; \"Invisible Man,\" by Ralph Ellison."
    }, 
    {
      "index": 351, 
      "score": 0.14053595066070557, 
      "sent": "On my way out, she graciously said that I should call her if I had any more questions."
    }, 
    {
      "index": 273, 
      "score": 0.14036917686462402, 
      "sent": "Jackson walked me out to the elevator and for some reason, as I passed the row of offices, I began to self-consciously whisper."
    }, 
    {
      "index": 281, 
      "score": 0.14000937342643738, 
      "sent": "Unless, that is, you counted Toni, Ralph and Maya peering down at me from those glass cases, immortalized in what seemed like a distant past."
    }, 
    {
      "index": 316, 
      "score": 0.1399916410446167, 
      "sent": "But for some reason Morrison would not to do this."
    }, 
    {
      "index": 295, 
      "score": 0.13989746570587158, 
      "sent": "\"Admittedly, the contemporary still scares her, Morrison told me, with a slight shudder."
    }, 
    {
      "index": 132, 
      "score": 0.13863860070705414, 
      "sent": "And when she saw white boys out in the yard, she knew what was up."
    }, 
    {
      "index": 16, 
      "score": 0.13849605619907379, 
      "sent": "So you can't blame me."
    }, 
    {
      "index": 23, 
      "score": 0.13849209249019623, 
      "sent": "It was a long day."
    }, 
    {
      "index": 215, 
      "score": 0.13706113398075104, 
      "sent": "How do people change an establishment?"
    }, 
    {
      "index": 180, 
      "score": 0.13660237193107605, 
      "sent": "\"Beloved,\" they felt, had finally given expression to \"a universe of complicated, sweetly desiring, fierce and deeply seductive human beings hitherto subsumed by, hitherto stifled by, that impenetrable nobody-noun: 'the slave.'"
    }, 
    {
      "index": 21, 
      "score": 0.13599270582199097, 
      "sent": "\" Sometimes her voice dipped down too low to be heard."
    }, 
    {
      "index": 337, 
      "score": 0.13478071987628937, 
      "sent": "I told her that my mother said there was nothing in the world like ironed sheets."
    }, 
    {
      "index": 57, 
      "score": 0.13412544131278992, 
      "sent": "Someone asked her where she was going to have it."
    }, 
    {
      "index": 199, 
      "score": 0.13402517139911652, 
      "sent": "First African-American, she asks her, as if Morrison had stuttered."
    }, 
    {
      "index": 18, 
      "score": 0.13375429809093475, 
      "sent": "\"The hours went by."
    }, 
    {
      "index": 236, 
      "score": 0.13242504000663757, 
      "sent": "Jackson is in his mid-40s, wears glasses with clear plastic frames and has a graying beard."
    }, 
    {
      "index": 40, 
      "score": 0.1321418285369873, 
      "sent": "You could smell this man coming around even when he was blocks away because he never bathed."
    }, 
    {
      "index": 296, 
      "score": 0.13199257850646973, 
      "sent": "It is a pace that she doesn't quite understand."
    }, 
    {
      "index": 167, 
      "score": 0.13198752701282501, 
      "sent": "She had a son, and then while she was months into her second pregnancy, her marriage fell apart."
    }, 
    {
      "index": 338, 
      "score": 0.13069075345993042, 
      "sent": "\"Your mother is right,\" she said."
    }, 
    {
      "index": 121, 
      "score": 0.12996573746204376, 
      "sent": "Did this merry man know his difference warranted a mention from Dickens himself?"
    }, 
    {
      "index": 335, 
      "score": 0.12969966232776642, 
      "sent": "\"I don't know, I just straighten the duvet and get sort of comfortable in the tangle and climb in.\""
    }, 
    {
      "index": 341, 
      "score": 0.12944111227989197, 
      "sent": "\"Oh,\" she said, inhaling deeply as if the sheets were still in her hands, \"it was a sleep like no other."
    }, 
    {
      "index": 126, 
      "score": 0.12939770519733429, 
      "sent": "She wasn't born Toni Morrison."
    }, 
    {
      "index": 330, 
      "score": 0.12924951314926147, 
      "sent": "When she found out that I had never slept on ironed sheets, her mouth hit the floor."
    }, 
    {
      "index": 320, 
      "score": 0.12873747944831848, 
      "sent": "(When I asked Morrison if she and Lois were close, I got an eye roll that was so sharp it chopped down the question and me."
    }, 
    {
      "index": 353, 
      "score": 0.12853002548217773, 
      "sent": "From time to time though, I still think about her."
    }, 
    {
      "index": 168, 
      "score": 0.12801933288574219, 
      "sent": "She decided to go back to Lorain to figure out what would come next."
    }, 
    {
      "index": 161, 
      "score": 0.1279144287109375, 
      "sent": "\"I always felt that everything else was the theater."
    }, 
    {
      "index": 138, 
      "score": 0.12740360200405121, 
      "sent": "And that was too traumatic, I think, for him."
    }, 
    {
      "index": 32, 
      "score": 0.12724661827087402, 
      "sent": "Did she want the heater closer?"
    }, 
    {
      "index": 85, 
      "score": 0.12656059861183167, 
      "sent": "Circumstances surrounding his death remain unclear."
    }, 
    {
      "index": 90, 
      "score": 0.126485675573349, 
      "sent": "Morrison relished unexpectedness."
    }, 
    {
      "index": 12, 
      "score": 0.126346156001091, 
      "sent": "Many authors use actors."
    }, 
    {
      "index": 144, 
      "score": 0.12523119151592255, 
      "sent": "Some of them came down from Canada."
    }, 
    {
      "index": 43, 
      "score": 0.12495557963848114, 
      "sent": "They washed all of his dirt and crust off."
    }, 
    {
      "index": 357, 
      "score": 0.12282712757587433, 
      "sent": "\"Who told you you was trash?\""
    }, 
    {
      "index": 277, 
      "score": 0.12219727039337158, 
      "sent": "They all looked like nice people, bookish people, people I might know in the city."
    }, 
    {
      "index": 67, 
      "score": 0.12197612226009369, 
      "sent": "As if she couldn't even explain it all to us, because we wouldn't get it."
    }, 
    {
      "index": 196, 
      "score": 0.12106693536043167, 
      "sent": "Tolstoy is not."
    }, 
    {
      "index": 266, 
      "score": 0.11972872167825699, 
      "sent": "On the cover of Time in 1998."
    }, 
    {
      "index": 147, 
      "score": 0.11867277324199677, 
      "sent": "\"The Woffords were not well off."
    }, 
    {
      "index": 319, 
      "score": 0.11865928769111633, 
      "sent": "And her sister, Lois, whose name she says like a prayer."
    }, 
    {
      "index": 349, 
      "score": 0.11860215663909912, 
      "sent": "Suddenly I felt greedy and excused myself in a hurry."
    }, 
    {
      "index": 84, 
      "score": 0.11818701773881912, 
      "sent": "A transit cop shot him in the chest and killed him."
    }, 
    {
      "index": 106, 
      "score": 0.11779651045799255, 
      "sent": "Morrison does not do this."
    }, 
    {
      "index": 30, 
      "score": 0.11747413128614426, 
      "sent": "A faint noise coming from within the darkness."
    }, 
    {
      "index": 202, 
      "score": 0.11659221351146698, 
      "sent": "\"Oh, yes,\" Morrison replies."
    }, 
    {
      "index": 128, 
      "score": 0.11655755341053009, 
      "sent": "She was born Chloe Wofford in 1931."
    }, 
    {
      "index": 58, 
      "score": 0.11570621281862259, 
      "sent": "\"Huh,\" she said, as if this were the silliest question ever posed."
    }, 
    {
      "index": 52, 
      "score": 0.11552812159061432, 
      "sent": "She laughed and said: \"So I'll play it up a bit and say, 'Oh, today my arms hurt, my chest is sore.'"
    }, 
    {
      "index": 136, 
      "score": 0.11550264805555344, 
      "sent": "Morrison said: \"He never told us that he'd seen bodies."
    }, 
    {
      "index": 60, 
      "score": 0.11524259299039841, 
      "sent": "At the White House!\""
    }, 
    {
      "index": 224, 
      "score": 0.1150570884346962, 
      "sent": "My tears disabled me, and I found them inscrutable."
    }, 
    {
      "index": 286, 
      "score": 0.11467158049345016, 
      "sent": "Set among the plush tan, white and cream sofas and chairs was an oak coffee table."
    }, 
    {
      "index": 276, 
      "score": 0.1144377589225769, 
      "sent": "A middle-aged man held the door for his co-worker."
    }, 
    {
      "index": 146, 
      "score": 0.11418496072292328, 
      "sent": "And also we played together."
    }, 
    {
      "index": 118, 
      "score": 0.11397141963243484, 
      "sent": "It is most remarkable."
    }, 
    {
      "index": 62, 
      "score": 0.11386080086231232, 
      "sent": "\"Well, actually, it isn't a lunch; it is a dinner, and they said, 'Now, Toni, this will be very informal, don't put yourself out, you can even wear jeans if you like.'"
    }, 
    {
      "index": 333, 
      "score": 0.11305414140224457, 
      "sent": "\"Well, how do you get in it?\""
    }, 
    {
      "index": 343, 
      "score": 0.11255066841840744, 
      "sent": "\"But when I asked her over and over what we could do to make sure our stories were not silenced, I didn't get much."
    }, 
    {
      "index": 360, 
      "score": 0.1116449162364006, 
      "sent": "And why did you believe?"
    }, 
    {
      "index": 201, 
      "score": 0.10833106189966202, 
      "sent": "Rather than the whole of literature she asks."
    }, 
    {
      "index": 331, 
      "score": 0.10817930847406387, 
      "sent": "\"Do you make your bed every morning?\""
    }, 
    {
      "index": 328, 
      "score": 0.10681383311748505, 
      "sent": "\"Oh, I know,\" she smiled, refusing to reveal a thing."
    }, 
    {
      "index": 275, 
      "score": 0.10638456791639328, 
      "sent": "A tired, older woman with frizzy gray hair got on and smiled."
    }, 
    {
      "index": 164, 
      "score": 0.10565979033708572, 
      "sent": "It was too stupid.\""
    }, 
    {
      "index": 326, 
      "score": 0.10563451051712036, 
      "sent": "\"\"You think?\""
    }, 
    {
      "index": 162, 
      "score": 0.10481829941272736, 
      "sent": "They didn't really mean that."
    }, 
    {
      "index": 347, 
      "score": 0.10390259325504303, 
      "sent": "Immediately I felt a deep shame."
    }, 
    {
      "index": 317, 
      "score": 0.10356125235557556, 
      "sent": "Which didn't mean she wouldn't speak her heart."
    }, 
    {
      "index": 127, 
      "score": 0.10354176908731461, 
      "sent": "She had to become that person."
    }, 
    {
      "index": 68, 
      "score": 0.10182205587625504, 
      "sent": "Like we wouldn't get how far she had come."
    }, 
    {
      "index": 342, 
      "score": 0.1015678271651268, 
      "sent": "I've never had anything like it since."
    }, 
    {
      "index": 54, 
      "score": 0.10071200132369995, 
      "sent": "I'm not going anywhere soon."
    }, 
    {
      "index": 65, 
      "score": 0.10054244101047516, 
      "sent": "I mean.\""
    }, 
    {
      "index": 33, 
      "score": 0.1003943607211113, 
      "sent": "Did she want tea?"
    }, 
    {
      "index": 148, 
      "score": 0.098329603672027588, 
      "sent": "They just worked hard."
    }, 
    {
      "index": 61, 
      "score": 0.097869403660297394, 
      "sent": "Of course."
    }, 
    {
      "index": 166, 
      "score": 0.094305120408535004, 
      "sent": "She married."
    }, 
    {
      "index": 200, 
      "score": 0.093922391533851624, 
      "sent": "Yes, Morrison replies."
    }, 
    {
      "index": 321, 
      "score": 0.093831434845924377, 
      "sent": "\"My sister?\""
    }, 
    {
      "index": 279, 
      "score": 0.093571886420249939, 
      "sent": "They smiled at me too."
    }, 
    {
      "index": 226, 
      "score": 0.093083366751670837, 
      "sent": "Slowly I recognized what was behind my crying: fear and worry."
    }, 
    {
      "index": 44, 
      "score": 0.092817850410938263, 
      "sent": "All of it."
    }, 
    {
      "index": 122, 
      "score": 0.09209335595369339, 
      "sent": "Did this merry man read?"
    }, 
    {
      "index": 270, 
      "score": 0.092083752155303955, 
      "sent": "Yellow taxis scuttled down below like beetles."
    }, 
    {
      "index": 66, 
      "score": 0.089261747896671295, 
      "sent": "Then she sighed."
    }, 
    {
      "index": 137, 
      "score": 0.088442765176296234, 
      "sent": "But he had seen them."
    }, 
    {
      "index": 244, 
      "score": 0.086881406605243683, 
      "sent": "He paused."
    }, 
    {
      "index": 59, 
      "score": 0.085841931402683258, 
      "sent": "\"At their house!"
    }, 
    {
      "index": 336, 
      "score": 0.08432459831237793, 
      "sent": "She groaned."
    }, 
    {
      "index": 327, 
      "score": 0.083645805716514587, 
      "sent": "I asked her, not doubting her assessment but merely wanting a bit more."
    }, 
    {
      "index": 28, 
      "score": 0.08354651927947998, 
      "sent": "Purring and soft."
    }, 
    {
      "index": 63, 
      "score": 0.083526559174060822, 
      "sent": "\" She paused and shook her head slightly, saying to no one in particular: \"Jeans!"
    }, 
    {
      "index": 53, 
      "score": 0.080669797956943512, 
      "sent": "Because, me?"
    }, 
    {
      "index": 334, 
      "score": 0.080358274281024933, 
      "sent": "she asked."
    }, 
    {
      "index": 323, 
      "score": 0.079911775887012482, 
      "sent": "\"I need her.\")"
    }, 
    {
      "index": 163, 
      "score": 0.078596286475658417, 
      "sent": "How could they?"
    }, 
    {
      "index": 332, 
      "score": 0.07611420750617981, 
      "sent": "Rarely, I said."
    }, 
    {
      "index": 225, 
      "score": 0.074415266513824463, 
      "sent": "Something hurt."
    }, 
    {
      "index": 29, 
      "score": 0.072083070874214172, 
      "sent": "Dulcet."
    }, 
    {
      "index": 264, 
      "score": 0.071357898414134979, 
      "sent": "Right, I said."
    }, 
    {
      "index": 322, 
      "score": 0.064300753176212311, 
      "sent": "she finally said."
    }, 
    {
      "index": 265, 
      "score": 0.055058985948562622, 
      "sent": "Right."
    }
  ], 
  "title": null
}