{
  "model": "c22a5bd", 
  "scored_article_sentences": [
    {
      "index": 161, 
      "score": 0.29626554250717163, 
      "sent": "Phelps believed that God had killed the soldiers to warn a doomed America, and that it was the church's job to make this fact explicit for the mourners."
    }, 
    {
      "index": 179, 
      "score": 0.29011547565460205, 
      "sent": "Phelps believed that Obama was the Antichrist, and that his Presidency signalled the beginning of the Apocalypse."
    }, 
    {
      "index": 178, 
      "score": 0.28821867704391479, 
      "sent": "Fred Phelps had preached for years that the end was near, but his sermons grew more dire after Barack Obama's election in 2008."
    }, 
    {
      "index": 18, 
      "score": 0.28665041923522949, 
      "sent": "Moreover, Megan was known for her mastery of the Bible and for her ability to spread Westboro's doctrine."
    }, 
    {
      "index": 674, 
      "score": 0.28611296415328979, 
      "sent": "Although Phelps-Roper no longer believes that the Bible is the word of God, she still reads it to try to find scriptural arguments that could encourage Westboro to take a more humane approach to the world."
    }, 
    {
      "index": 668, 
      "score": 0.2769891619682312, 
      "sent": "The Equality House, as it's known, is home to a group of young L.G.B.T."
    }, 
    {
      "index": 197, 
      "score": 0.27050784230232239, 
      "sent": "As the prophecies were developed, Westboro expanded the focus of its preaching to include the Jewish community."
    }, 
    {
      "index": 52, 
      "score": 0.26433813571929932, 
      "sent": "During the next few months, Phelps-Roper spearheaded Westboro's push into the social-media age, using Twitter to offer a window into life in the church and giving it an air of accessibility."
    }, 
    {
      "index": 25, 
      "score": 0.26180091500282288, 
      "sent": "So every time we find something else to picket, or have some new video or picture we want to post (or just something that we see on the news and want to comment about)--87 people get first-hand, gospel commentary from Megan Marie.\""
    }, 
    {
      "index": 8, 
      "score": 0.26081398129463196, 
      "sent": "She believed that all manner of other tragedies--war, natural disaster, mass shootings--were warnings from God to a doomed nation, and that it was her duty to spread the news of His righteous judgments."
    }, 
    {
      "index": 180, 
      "score": 0.25931599736213684, 
      "sent": "The sense of looming calamity was heightened by a multimillion-dollar judgment against the church that had been awarded, in 2007, to Albert Snyder, who sued Westboro after it picketed the funeral of his son Matt, a U.S. marine killed in Iraq."
    }, 
    {
      "index": 291, 
      "score": 0.25832754373550415, 
      "sent": "There was a Jewish marketing consultant in Brooklyn who abhorred Westboro's tactics but supported the church's right to express its views."
    }, 
    {
      "index": 390, 
      "score": 0.2574462890625, 
      "sent": "The Old Testament prophet Elisha, for example, weeps when he foresees disaster for Israel."
    }, 
    {
      "index": 71, 
      "score": 0.25526440143585205, 
      "sent": "Westboro had started as an offshoot of Topeka's East Side Baptist Church, but by the time Phelps-Roper was born its congregation was composed mostly of Fred Phelps's adult children and their families."
    }, 
    {
      "index": 196, 
      "score": 0.25474905967712402, 
      "sent": "She created an account under the pseudonym Marissa Cohen and followed many of the people on the list, hoping to learn if Westboro's prophecies were coming true."
    }, 
    {
      "index": 325, 
      "score": 0.25164389610290527, 
      "sent": "Abitbol knew that at least one member of Westboro had committed a sin that Leviticus also deems a capital crime."
    }, 
    {
      "index": 9, 
      "score": 0.24882994592189789, 
      "sent": "To protest the increasing acceptance of homosexuality in America, the Westboro Baptist Church picketed the funerals of gay men who died of AIDS and of soldiers killed in Iraq and Afghanistan."
    }, 
    {
      "index": 351, 
      "score": 0.24706797301769257, 
      "sent": "In April, 2011, the BBC aired one of Louis Theroux's documentaries about Westboro."
    }, 
    {
      "index": 12, 
      "score": 0.24545295536518097, 
      "sent": "In 1994, the church launched a Web site, www.godhatesfags.com, and early on it had a chat room where visitors could interact with members of Westboro."
    }, 
    {
      "index": 24, 
      "score": 0.2443234771490097, 
      "sent": "On September 1st, her sister Bekah e-mailed church members to explain the utility of Twitter: \"Now Megan has 87 followers and more are trickling in all the time."
    }, 
    {
      "index": 15, 
      "score": 0.2442985475063324, 
      "sent": "She opened an account but quickly lost interest--at the time, Twitter was still used mostly by early-adopting techies--until someone e-mailed Westboro's Web site, in the summer of 2009, and asked if the church used the service."
    }, 
    {
      "index": 177, 
      "score": 0.24414940178394318, 
      "sent": "In September, 2009, when Phelps-Roper began to use Twitter in earnest, Westboro was preparing for the end of the world."
    }, 
    {
      "index": 61, 
      "score": 0.24156807363033295, 
      "sent": "A literalist, Phelps believed that contemporary Christianity, with its emphasis on God's love, preached a perverted version of the Bible."
    }, 
    {
      "index": 184, 
      "score": 0.23889519274234772, 
      "sent": "Obama would be crowned king of the world, then lead every nation in war against Israel."
    }, 
    {
      "index": 507, 
      "score": 0.23719426989555359, 
      "sent": "He acknowledged that an all-male group of elders assumed preaching duties, but not that this led to a less open atmosphere in the church."
    }, 
    {
      "index": 7, 
      "score": 0.23660317063331604, 
      "sent": "As a member of the Westboro Baptist Church, in Topeka, Kansas, Phelps-Roper believed that AIDS was a curse sent by God."
    }, 
    {
      "index": 39, 
      "score": 0.2362348735332489, 
      "sent": "Phelps-Roper spent much of the morning responding to angry tweets, citing Bible passages."
    }, 
    {
      "index": 145, 
      "score": 0.2360260933637619, 
      "sent": "Phelps-Roper learned to hold two signs in each hand, a technique that Westboro members called the Butterfly."
    }, 
    {
      "index": 352, 
      "score": 0.23539638519287109, 
      "sent": "In one scene, Phelps-Roper explained how she used Twitter to keep up with a group of four Dutch filmmakers who had visited Westboro in 2010."
    }, 
    {
      "index": 127, 
      "score": 0.23425902426242828, 
      "sent": "Phelps claimed that he was inspired to launch the Great Gage Park Decency Drive, as he called it, after one of his young grandsons was propositioned while biking through the park."
    }, 
    {
      "index": 230, 
      "score": 0.23312376439571381, 
      "sent": "He had lived in Montreal in the nineties, and had become fascinated with the explosion of hate sites on the early Internet."
    }, 
    {
      "index": 240, 
      "score": 0.23244965076446533, 
      "sent": "He had read the Old Testament in its original Hebrew, and was conversant in the New Testament as well."
    }, 
    {
      "index": 315, 
      "score": 0.23139134049415588, 
      "sent": "In Phelps-Roper's effort to better understand Westboro's new prophecies, she had bought a copy of \"The Complete Idiot's Guide to Understanding Judaism,\" but she found it more profitable just to ask Abitbol her questions."
    }, 
    {
      "index": 273, 
      "score": 0.23132474720478058, 
      "sent": "For one thing, Twitter's hundred-and-forty-character limit made it hard to fit both a florid insult and a scriptural point."
    }, 
    {
      "index": 144, 
      "score": 0.23099488019943237, 
      "sent": "In New Orleans, they ran into Ehud Barak, the former Israeli Prime Minister, and serenaded him with an anti-Semitic parody of Israel's national anthem."
    }, 
    {
      "index": 305, 
      "score": 0.23069354891777039, 
      "sent": "They made some small talk--Abitbol was amused by a sign, held by one of Phelps-Roper's sisters, that said \"Your Rabbi Is a Whore\"--then began to debate her about Westboro's doctrine."
    }, 
    {
      "index": 338, 
      "score": 0.22994431853294373, 
      "sent": "Phelps-Roper found it easy to ignore her doubt amid the greater publicity that Westboro was receiving, much of it tied to her Twitter activity."
    }, 
    {
      "index": 133, 
      "score": 0.22969911992549896, 
      "sent": "He had been a committed civil-rights attorney in the nineteen-sixties and seventies, one of the few lawyers to represent black Kansans in discrimination suits, before the state disbarred him, in 1979, for harassing a court reporter who failed to have a transcript ready in time."
    }, 
    {
      "index": 354, 
      "score": 0.22928705811500549, 
      "sent": "The day after the documentary aired, Sam Phelps-Roper sent an e-mail to church members urging more discretion in their tweets."
    }, 
    {
      "index": 192, 
      "score": 0.22927266359329224, 
      "sent": "Still, she had a hard time believing in aspects of the future foretold by some church members, like the idea that they would soon be living in pink caves in Jordan."
    }, 
    {
      "index": 27, 
      "score": 0.22822895646095276, 
      "sent": "Her tweet had been discovered by the comedian Michael Ian Black, who had more than a million followers."
    }, 
    {
      "index": 268, 
      "score": 0.22803498804569244, 
      "sent": "Just a few months earlier, the Westboro Web site had received an e-mail arguing that the church's constant use of the word \"fag\" was needlessly offensive."
    }, 
    {
      "index": 88, 
      "score": 0.22783999145030975, 
      "sent": "The Phelps-Roper home was the biggest on the Block, and a room in the basement acted as a kind of community center for Westboro."
    }, 
    {
      "index": 183, 
      "score": 0.22765663266181946, 
      "sent": "The country would be so enraged by Westboro's victory that its members would be forced to flee to Israel."
    }, 
    {
      "index": 391, 
      "score": 0.22726407647132874, 
      "sent": "One day in July, 2011, Phelps-Roper was on Twitter when she came across a link to a series of photographs about a famine in Somalia."
    }, 
    {
      "index": 188, 
      "score": 0.22670428454875946, 
      "sent": "Phelps-Roper and her family members all got passports, so that they could travel to Israel."
    }, 
    {
      "index": 371, 
      "score": 0.22658666968345642, 
      "sent": "They began to talk about the church using the in-game chat function, free from Twitter's character limit."
    }, 
    {
      "index": 326, 
      "score": 0.22601953148841858, 
      "sent": "Phelps-Roper's oldest brother, Sam, was the product of a relationship that Shirley had had with a man she met while she was in law school, before she married Megan's father."
    }, 
    {
      "index": 28, 
      "score": 0.22590470314025879, 
      "sent": "He was surprised that a member of the Westboro Baptist Church was on Twitter at all."
    }, 
    {
      "index": 66, 
      "score": 0.22583211958408356, 
      "sent": "Phelps also believed that fighting the increasing tolerance of homosexuality was the key moral issue of our time."
    }, 
    {
      "index": 344, 
      "score": 0.22527557611465454, 
      "sent": "In March, Westboro members walked out of a screening of the film \"Red State,\" which spoofed the church."
    }, 
    {
      "index": 389, 
      "score": 0.22381877899169922, 
      "sent": "Phelps-Roper increasingly found herself turning to Bible passages where tragedy is not met with joy."
    }, 
    {
      "index": 26, 
      "score": 0.22372293472290039, 
      "sent": "A couple of hours after Phelps-Roper posted her tweet on World AIDS Day, she checked her e-mail and discovered numerous automated messages notifying her of new Twitter followers."
    }, 
    {
      "index": 111, 
      "score": 0.22329604625701904, 
      "sent": "Megan was taught that there would always be a tension between what she felt and thought as a human and what the Bible required of her."
    }, 
    {
      "index": 452, 
      "score": 0.22261582314968109, 
      "sent": "The smallest transgression could spark another round of punishment, until the member either shaped up or was kicked out of the church."
    }, 
    {
      "index": 245, 
      "score": 0.22248438000679016, 
      "sent": "He saw that Phelps-Roper had a lot of followers and was an influential person in the church, so he wanted to counter her message."
    }, 
    {
      "index": 628, 
      "score": 0.22215104103088379, 
      "sent": "The experience solidified Megan's increasing conviction that no person or group could claim a monopoly on moral truth."
    }, 
    {
      "index": 201, 
      "score": 0.22192198038101196, 
      "sent": "Phelps-Roper thought that this initiative was more explicitly supported by the Bible than other parts of the prophecies were, so she threw herself into the effort."
    }, 
    {
      "index": 676, 
      "score": 0.22130474448204041, 
      "sent": "After they left the church, Megan and Grace were blocked from Westboro's Twitter accounts, but they created a secret account to follow them."
    }, 
    {
      "index": 234, 
      "score": 0.22116026282310486, 
      "sent": "He and a friend eventually created a directory called Net Hate, which listed the sites along with mocking descriptions."
    }, 
    {
      "index": 181, 
      "score": 0.22096645832061768, 
      "sent": "Westboro members drew prophecies from the Book of Revelation about how the end might unfold."
    }, 
    {
      "index": 283, 
      "score": 0.22089956700801849, 
      "sent": "Other Twitter users were fascinated by the dissonance between Westboro's loathsome reputation and the goofy, pop-culture-obsessed millennial who Phelps-Roper seemed to be on Twitter."
    }, 
    {
      "index": 482, 
      "score": 0.22034794092178345, 
      "sent": "In April, she was shocked when Westboro expelled a cousin of hers without adhering to the process that the church had always followed, which was derived from the Book of Matthew."
    }, 
    {
      "index": 330, 
      "score": 0.22020576894283295, 
      "sent": "Phelps-Roper was struck by the double standard, and, as she did whenever she had a question about doctrine, she brought up the issue with her mother."
    }, 
    {
      "index": 506, 
      "score": 0.21991835534572601, 
      "sent": "Drain disputed many of Phelps-Roper's characterizations of the changes in the church."
    }, 
    {
      "index": 206, 
      "score": 0.21903400123119354, 
      "sent": "With more than four thousand followers and a habit of engaging with those who tweeted at him, he would be a prime target for Westboro's message of repentance, she figured."
    }, 
    {
      "index": 399, 
      "score": 0.21899326145648956, 
      "sent": "When Brittany Murphy died, Phelps-Roper had seen the disparity between her reaction and that of the rest of the church as a sign that something was wrong with her."
    }, 
    {
      "index": 19, 
      "score": 0.21883468329906464, 
      "sent": "\"She had a well-sharpened tongue, so to speak,\" Josh Phelps, one of Megan's cousins and a former member of Westboro, told me."
    }, 
    {
      "index": 331, 
      "score": 0.218624547123909, 
      "sent": "Shirley responded that Romans said gays were \"worthy of death,\" and that if it was good enough for God it was good enough for Westboro."
    }, 
    {
      "index": 163, 
      "score": 0.2184043824672699, 
      "sent": "One of Phelps-Roper's aunts checked the Department of Defense Web site every day for notifications of casualties."
    }, 
    {
      "index": 363, 
      "score": 0.21812736988067627, 
      "sent": "He had learned of Westboro after reading an article about the Anonymous hack."
    }, 
    {
      "index": 609, 
      "score": 0.21717619895935059, 
      "sent": "When David Abitbol learned that the sisters had left Westboro, he invited them to speak at the next Jewlicious festival in Long Beach."
    }, 
    {
      "index": 679, 
      "score": 0.21692603826522827, 
      "sent": "Former members of the church told me that Fred had had a softening of heart at the end of his life and had been excommunicated."
    }, 
    {
      "index": 681, 
      "score": 0.21685919165611267, 
      "sent": "Zach Phelps-Roper, Megan's younger brother, who left the church later that year, said that one of the precipitating events in Fred's exclusion had been expressing kindness toward the Equality House."
    }, 
    {
      "index": 487, 
      "score": 0.21670742332935333, 
      "sent": "One of the few Westboro members unrelated to Fred Phelps, Drain had visited Topeka in 2000 to film a skeptical documentary about the church, but he soon became convinced of its message."
    }, 
    {
      "index": 132, 
      "score": 0.21571235358715057, 
      "sent": "The pickets were met with an immediate backlash from the community, but Phelps was not deterred."
    }, 
    {
      "index": 299, 
      "score": 0.21541610360145569, 
      "sent": "The church set up its picket a block from the Jewish community center where the festival was taking place."
    }, 
    {
      "index": 322, 
      "score": 0.21534831821918488, 
      "sent": "In response, Abitbol kept pressing Phelps-Roper on Westboro's doctrine."
    }, 
    {
      "index": 346, 
      "score": 0.21502578258514404, 
      "sent": "Ten days earlier, the Supreme Court had overturned the judgment against Westboro in the Albert Snyder case."
    }, 
    {
      "index": 317, 
      "score": 0.21449869871139526, 
      "sent": "During their debates over Scripture, Phelps-Roper sometimes quoted passages from the Old Testament; Abitbol often countered that their meaning differed in the original Hebrew, so Phelps-Roper bought some language-learning software."
    }, 
    {
      "index": 494, 
      "score": 0.21387049555778503, 
      "sent": "It undermined her own proud claims on Twitter to be spreading God's truth--and lying violated Scripture."
    }, 
    {
      "index": 400, 
      "score": 0.2137814462184906, 
      "sent": "Now the contradiction of her mother's glee and her own sadness made her wonder if something was wrong with the church."
    }, 
    {
      "index": 345, 
      "score": 0.21376527845859528, 
      "sent": "They had been invited by the director, Kevin Smith, with whom Phelps-Roper had kept up a running feud on Twitter since World AIDS Day."
    }, 
    {
      "index": 16, 
      "score": 0.21308471262454987, 
      "sent": "Phelps-Roper, who is tall, with voluminous curly hair and pointed features, volunteered to tweet for the congregation."
    }, 
    {
      "index": 514, 
      "score": 0.21299389004707336, 
      "sent": "He pointed out that Shirley had recently spoken at a picket protesting Kim Davis, the Kentucky clerk who had refused to issue marriage licenses to gay couples--the church took issue with Davis's remarriages after divorce."
    }, 
    {
      "index": 13, 
      "score": 0.21279101073741913, 
      "sent": "As a child, Phelps-Roper spent hours there, sparring with strangers."
    }, 
    {
      "index": 10, 
      "score": 0.21267300844192505, 
      "sent": "Members held signs with slogans like \"God Hates Fags\" and \"Thank God for Dead soldiers,\" and the outrage that their efforts attracted had turned the small church, which had fewer than a hundred members, into a global symbol of hatred."
    }, 
    {
      "index": 489, 
      "score": 0.21247589588165283, 
      "sent": "He'd long pushed for a larger role in Westboro, and after the elders came to power his influence increased."
    }, 
    {
      "index": 33, 
      "score": 0.21240250766277313, 
      "sent": "The director Kevin Smith and \"The Office\" star Rainn Wilson mocked her, as did many of their followers."
    }, 
    {
      "index": 517, 
      "score": 0.21214720606803894, 
      "sent": "She and Grace were in the basement of another Westboro family's house, painting the walls."
    }, 
    {
      "index": 577, 
      "score": 0.21158322691917419, 
      "sent": "After the relationship ended, the wife learned about it, and sent a letter to Megan and Grace's parents revealing both the relationship and the sisters' plan to leave."
    }, 
    {
      "index": 321, 
      "score": 0.21149604022502899, 
      "sent": "\"I just wish you would obey God and use your considerable platform to warn your audience about the consequences of engaging in conduct that God calls abomination,\" she e-mailed Abitbol in October, 2010."
    }, 
    {
      "index": 465, 
      "score": 0.21119263768196106, 
      "sent": "The church became more secretive, as members were reluctant to discuss important issues for fear of appearing to go behind the elders' backs."
    }, 
    {
      "index": 50, 
      "score": 0.21092277765274048, 
      "sent": "She took the incident as an encouraging sign that Westboro's message was well suited to social media."
    }, 
    {
      "index": 463, 
      "score": 0.2106831967830658, 
      "sent": "Previously, decisions at Westboro had been hashed out in church meetings, where consensus was required before moving forward."
    }, 
    {
      "index": 20, 
      "score": 0.21060143411159515, 
      "sent": "In August, 2009, Phelps-Roper, under the handle @meganphelps, posted a celebratory tweet when Ted Kennedy died (\"He defied God at every turn, teaching rebellion against His laws."
    }, 
    {
      "index": 329, 
      "score": 0.21039941906929016, 
      "sent": "But Abitbol wrote that if gay people were killed they wouldn't have the opportunity to repent."
    }, 
    {
      "index": 34, 
      "score": 0.20992609858512878, 
      "sent": "Losing Religion Through TwitterMegan Phelps-Roper comments on tweets she once posted for the church."
    }, 
    {
      "index": 233, 
      "score": 0.20962625741958618, 
      "sent": "There were few widely available search engines at the time, so he spent hours tracking down the Web sites of Holocaust deniers, anti-Semites, and racists of all types."
    }, 
    {
      "index": 86, 
      "score": 0.20946075022220612, 
      "sent": "They called the Westboro compound the Block, and considered it a sanctuary in a world full of evil."
    }, 
    {
      "index": 328, 
      "score": 0.20930998027324677, 
      "sent": "Westboro always argued that the difference between Shirley and gay people was that Shirley had repented of her sin, whereas gays marched in pride parades."
    }, 
    {
      "index": 121, 
      "score": 0.20898297429084778, 
      "sent": "One day in June, when she was thirteen, her grandfather baptized her in the shallow end of the Block's pool."
    }, 
    {
      "index": 120, 
      "score": 0.20894007384777069, 
      "sent": "Children in Westboro must make a profession of faith before they are baptized and become full members of the church."
    }, 
    {
      "index": 298, 
      "score": 0.20893903076648712, 
      "sent": "Phelps-Roper's conversations with Abitbol had continued through the winter, and she knew that debating him in person would be more challenging than on Twitter."
    }, 
    {
      "index": 316, 
      "score": 0.20884469151496887, 
      "sent": "Here was a real live Orthodox Jew who lived in Israel and was more than happy to enlighten her."
    }, 
    {
      "index": 673, 
      "score": 0.20856061577796936, 
      "sent": "Today, Megan and Grace's only connection to Westboro is virtual."
    }, 
    {
      "index": 14, 
      "score": 0.20847278833389282, 
      "sent": "She learned about Twitter in 2008, after reading an article about an American graduate student in Egypt who had used it to notify his friends that he had been arrested while photographing riots."
    }, 
    {
      "index": 36, 
      "score": 0.20846031606197357, 
      "sent": "Since elementary school, she had given hundreds of interviews about Westboro, but the reaction on Twitter seemed more real than a quote in a newspaper."
    }, 
    {
      "index": 202, 
      "score": 0.20820082724094391, 
      "sent": "She wrote the church's press release: \"WBC is looking for the good figs among the Christ-rejecting hypocrites!\""
    }, 
    {
      "index": 195, 
      "score": 0.20812666416168213, 
      "sent": "Most of the prophecies centered on Jews, so she found a list, published by the Jewish Telegraphic Agency, a syndicated news service, of the hundred most influential Jewish Twitter users."
    }, 
    {
      "index": 667, 
      "score": 0.2078925222158432, 
      "sent": "The house had been bought, in 2012, by Planting Peace, a nonprofit group whose mission, according to its Web site, is \"spreading peace in a hurting world.\""
    }, 
    {
      "index": 490, 
      "score": 0.20788505673408508, 
      "sent": "In February, 2012, during the funeral of Whitney Houston, in New Jersey, Drain urged Phelps-Roper and other members to tweet poorly Photoshopped images that depicted them haranguing mourners."
    }, 
    {
      "index": 47, 
      "score": 0.20763044059276581, 
      "sent": "That afternoon, as Phelps-Roper picketed a small business in Topeka with other Westboro members, she was still glued to her iPhone."
    }, 
    {
      "index": 254, 
      "score": 0.20757769048213959, 
      "sent": "On 9/11, she was in the crowded hallway of her high school when she overheard someone talking about how an airplane had hit the World Trade Center."
    }, 
    {
      "index": 467, 
      "score": 0.20754227042198181, 
      "sent": "Westboro members drew on stories of powerful women in the Bible, like Deborah, a prophet and judge of Israel."
    }, 
    {
      "index": 275, 
      "score": 0.20741473138332367, 
      "sent": "She still preached God's hate, and still liberally deployed the word \"fag,\" but she also sprinkled her tweets with cheerful exclamations and emoticons."
    }, 
    {
      "index": 312, 
      "score": 0.20719768106937408, 
      "sent": "Not long after, she told him that Westboro would be picketing the General Assembly of the Jewish Federations, in New Orleans, that year."
    }, 
    {
      "index": 228, 
      "score": 0.20714679360389709, 
      "sent": "Abitbol is a large man in his early fifties who often has a shaggy Mohawk, which he typically covers with a Montreal Expos baseball cap."
    }, 
    {
      "index": 91, 
      "score": 0.20695681869983673, 
      "sent": "She had a central role in nearly every aspect of Westboro's operations: she was its media coordinator, planned the pickets, and managed Phelps Chartered."
    }, 
    {
      "index": 347, 
      "score": 0.20682355761528015, 
      "sent": "Phelps-Roper was inundated with tweets and new followers."
    }, 
    {
      "index": 93, 
      "score": 0.20673631131649017, 
      "sent": "Louis Theroux, a British filmmaker who made two documentaries about Westboro, said, \"My feeling was that there was a pecking order and there was an unacknowledged hierarchy, and at the top of it was Shirley's family.\""
    }, 
    {
      "index": 136, 
      "score": 0.20647963881492615, 
      "sent": "They picketed the funeral of Matthew Shepard, the gay man whose murder, in what was widely believed to be a hate crime, became a rallying cry for gay-rights activists."
    }, 
    {
      "index": 327, 
      "score": 0.20613232254981995, 
      "sent": "Shirley's sin of fornication was often thrown in the church members' faces by counterprotesters."
    }, 
    {
      "index": 2, 
      "score": 0.20574630796909332, 
      "sent": "Megan Phelps-Roper, a twenty-three-year-old legal assistant, seized the opportunity."
    }, 
    {
      "index": 320, 
      "score": 0.20554561913013458, 
      "sent": "Phelps-Roper still urged Abitbol to repent, but as someone who was concerned about a wayward friend."
    }, 
    {
      "index": 75, 
      "score": 0.20498690009117126, 
      "sent": "If you knew the truth in your heart, Westboro believed, even the filthiest products of pop culture couldn't defile you."
    }, 
    {
      "index": 205, 
      "score": 0.20481662452220917, 
      "sent": "2 was David Abitbol, a Jerusalem-based Web developer and the founder of the Jewish-culture blog Jewlicious."
    }, 
    {
      "index": 472, 
      "score": 0.20411720871925354, 
      "sent": "Westboro women had long been forbidden to cut their hair, and had restrictions on other aspects of their appearance."
    }, 
    {
      "index": 259, 
      "score": 0.20339803397655487, 
      "sent": "But Phelps-Roper had loved Murphy in \"Clueless,\" and she felt an unexpected pang--not quite sadness, but something close--over her death."
    }, 
    {
      "index": 324, 
      "score": 0.20319169759750366, 
      "sent": "Abitbol pointed out that Jesus had said, \"He that is without sin among you, let him first cast a stone.\""
    }, 
    {
      "index": 678, 
      "score": 0.20315185189247131, 
      "sent": "Fred Phelps died in March, 2014, at the age of eighty-four."
    }, 
    {
      "index": 200, 
      "score": 0.20310281217098236, 
      "sent": "Westboro called the protests the Fateful Fig Find, after a parable in the Book of Jeremiah that compares Jews who had been captured by the Babylonians to two baskets of figs, one good and one \"naughty.\""
    }, 
    {
      "index": 600, 
      "score": 0.20275886356830597, 
      "sent": "Phelps-Roper was tempted to hide in the Black Hills forever, but soon decided that, after spending so many years as the public face of Westboro, she wanted to go public with how she'd left the church, and to start making amends for the hurt she had caused."
    }, 
    {
      "index": 483, 
      "score": 0.20261038839817047, 
      "sent": "Typically, expulsion resulted only after a unanimous decision, but in the cousin's case she was excluded over other members' objections."
    }, 
    {
      "index": 134, 
      "score": 0.20257417857646942, 
      "sent": "Now Westboro targeted local churches, politicians, businesses, journalists, and anyone else who criticized Phelps's crusade."
    }, 
    {
      "index": 244, 
      "score": 0.20245473086833954, 
      "sent": "Abitbol had learned while running Net Hate that relating to hateful people on a human level was the best way to deal with them."
    }, 
    {
      "index": 518, 
      "score": 0.20227710902690887, 
      "sent": "The song \"Just One,\" by the indie folk group Blind Pilot--a band that C.G."
    }, 
    {
      "index": 364, 
      "score": 0.20187747478485107, 
      "sent": "\"He sent me a tweet, and initially it was like this angry, nasty tweet,\" Phelps-Roper said."
    }, 
    {
      "index": 323, 
      "score": 0.20187704265117645, 
      "sent": "One day, he asked about a Westboro sign that said \"Death Penalty for Fags,\" referring to a commandment from Leviticus."
    }, 
    {
      "index": 508, 
      "score": 0.20166456699371338, 
      "sent": "\"There's definitely more participation than when I first got here, in 2001, when you had one person doing all the sermons,\" he said, referring to Fred Phelps."
    }, 
    {
      "index": 29, 
      "score": 0.20159177482128143, 
      "sent": "\"I sort of thought they would be this fire-and-brimstone sort of Pentecostal anti-technology clan that would be removed from the world,\" he told me."
    }, 
    {
      "index": 82, 
      "score": 0.20140726864337921, 
      "sent": "Nine of Fred Phelps's children were still in the church, and most of them had large families of their own."
    }, 
    {
      "index": 675, 
      "score": 0.20101805031299591, 
      "sent": "Sometimes she'll tweet passages, knowing that church members will see them."
    }, 
    {
      "index": 51, 
      "score": 0.20072236657142639, 
      "sent": "She loved that Twitter let her talk to large numbers of people without the filter of a journalist."
    }, 
    {
      "index": 73, 
      "score": 0.20044609904289246, 
      "sent": "Westboro believed that its members could best preach to the wicked by living among them."
    }, 
    {
      "index": 227, 
      "score": 0.20026536285877228, 
      "sent": "\"Anybody's initial response to being confronted with the sort of stuff Westboro Baptist Church says is to tell them to fuck off,\" Abitbol told me."
    }, 
    {
      "index": 639, 
      "score": 0.20019902288913727, 
      "sent": "It was her first date ever, and it was with someone who had become a symbol of the unattainable."
    }, 
    {
      "index": 339, 
      "score": 0.20010973513126373, 
      "sent": "In February, 2011, the hacker collective Anonymous declared war against Westboro."
    }, 
    {
      "index": 157, 
      "score": 0.2001088410615921, 
      "sent": "In the summer of 2005, Westboro began protesting the funerals of soldiers killed in Iraq and Afghanistan, holding signs like \"Thank God for IEDs.\""
    }, 
    {
      "index": 615, 
      "score": 0.19954675436019897, 
      "sent": "The sisters befriended their hosts, an Orthodox rabbi and his family."
    }, 
    {
      "index": 84, 
      "score": 0.19944398105144501, 
      "sent": "The church was in a residential neighborhood in southwest Topeka, and its members had bought most of the houses on the block around it."
    }, 
    {
      "index": 162, 
      "score": 0.19873276352882385, 
      "sent": "The scale of the picketing increased dramatically."
    }, 
    {
      "index": 559, 
      "score": 0.19867685437202454, 
      "sent": "She would conclude that everything about Westboro's doctrine was wrong, only to be seized with terror that these thoughts were a test from God, and she was failing."
    }, 
    {
      "index": 176, 
      "score": 0.19852761924266815, 
      "sent": "She added, \"This was the only hope for mankind, and I was so grateful to be part of this ministry.\""
    }, 
    {
      "index": 379, 
      "score": 0.19848798215389252, 
      "sent": "was most critical of Westboro's cruelty."
    }, 
    {
      "index": 455, 
      "score": 0.19775563478469849, 
      "sent": "Megan took over picket planning, while Steve Drain became the church's media manager."
    }, 
    {
      "index": 182, 
      "score": 0.19775068759918213, 
      "sent": "First, the Supreme Court would overturn the Snyder verdict."
    }, 
    {
      "index": 160, 
      "score": 0.19754844903945923, 
      "sent": "He believed that 9/11 was God's punishment for America's embrace of homosexuality, but that, instead of repenting, Americans had drowned this warning in a flood of patriotism."
    }, 
    {
      "index": 62, 
      "score": 0.19749252498149872, 
      "sent": "Phelps denounced other Christians so vehemently that when Phelps-Roper was young she thought \"Christian\" was another word for evil."
    }, 
    {
      "index": 378, 
      "score": 0.19730287790298462, 
      "sent": "argued against Westboro's beliefs and practices, but while Abitbol's arguments were doctrinal C.G."
    }, 
    {
      "index": 573, 
      "score": 0.19704504311084747, 
      "sent": "As the sisters agonized over whether to leave, they befriended an older man in the church and his wife, eventually becoming allies in discontent."
    }, 
    {
      "index": 453, 
      "score": 0.19658137857913971, 
      "sent": "Shirley's role in the church was reduced dramatically."
    }, 
    {
      "index": 53, 
      "score": 0.19638840854167938, 
      "sent": "It was easy for Phelps-Roper to write things on Twitter that made other people cringe."
    }, 
    {
      "index": 207, 
      "score": 0.19635753333568573, 
      "sent": "On September 9, 2009, Shirley gave an interview to an Atlanta radio station, and Phelps-Roper shared a quote on Twitter."
    }, 
    {
      "index": 135, 
      "score": 0.1961776465177536, 
      "sent": "Throughout the nineties, Westboro members crisscrossed the country, protesting the funerals of AIDS victims and gay-pride parades."
    }, 
    {
      "index": 350, 
      "score": 0.19616864621639252, 
      "sent": "But as other members of the church joined Twitter they began to question her friendly relations with outsiders."
    }, 
    {
      "index": 466, 
      "score": 0.1959572434425354, 
      "sent": "Women like Shirley and her older sister Margie--an attorney who had argued the Snyder case in front of the Supreme Court--had always been among the most public and influential members of the church."
    }, 
    {
      "index": 464, 
      "score": 0.19588556885719299, 
      "sent": "But the elders met separately before bringing their decisions to the rest of the group."
    }, 
    {
      "index": 362, 
      "score": 0.1958075612783432, 
      "sent": "His avatar was Robert Redford in \"The Great Gatsby.\""
    }, 
    {
      "index": 67, 
      "score": 0.19576510787010193, 
      "sent": "To illustrate gay sin, he described exotic sex acts in lurid detail."
    }, 
    {
      "index": 115, 
      "score": 0.19557268917560577, 
      "sent": "Her uncle gave them a novelty wooden paddle inscribed with the tongue-in-cheek direction \"May be used on any child from 5 to 75,\" and her father hung it on the wall next to the family photos."
    }, 
    {
      "index": 262, 
      "score": 0.19543993473052979, 
      "sent": "She couldn't bring herself to post a tweet thanking God for Murphy's death."
    }, 
    {
      "index": 126, 
      "score": 0.19537968933582306, 
      "sent": "Fred Phelps believed that Gage Park, less than a mile from the Block, had become overrun with gay men cruising for sex."
    }, 
    {
      "index": 318, 
      "score": 0.19498467445373535, 
      "sent": "She figured that, since she would soon be living in Israel awaiting the end of the world, she should learn the language."
    }, 
    {
      "index": 610, 
      "score": 0.19486984610557556, 
      "sent": "They agreed, hoping that the experience might help them to find their way, and to finally understand a community that they had vilified for so long."
    }, 
    {
      "index": 601, 
      "score": 0.1945154070854187, 
      "sent": "In February, 2013, she wrote a statement on the blogging platform Medium."
    }, 
    {
      "index": 495, 
      "score": 0.19450639188289642, 
      "sent": "In addition, she now had to have all her media appearances approved by Drain."
    }, 
    {
      "index": 496, 
      "score": 0.19445230066776276, 
      "sent": "\"It seems like he wants to be Pope Steve and for no one else to do anything without his permission,\" she wrote in her journal."
    }, 
    {
      "index": 637, 
      "score": 0.1941664069890976, 
      "sent": "They met in Omaha, in driving distance for both of them, and saw \"The Great Gatsby,\" the Baz Luhrmann movie."
    }, 
    {
      "index": 629, 
      "score": 0.19404149055480957, 
      "sent": "Slowly, her fears about God's judgment--the first terrifying understanding of her faith as a child, and its most stubborn remnant--faded."
    }, 
    {
      "index": 311, 
      "score": 0.19393603503704071, 
      "sent": "Still, Phelps-Roper enjoyed the exchange with Abitbol."
    }, 
    {
      "index": 282, 
      "score": 0.19391518831253052, 
      "sent": "As she developed her affable rhetorical style, she justified it with a proverb: \"By long forbearing is a prince persuaded, and a soft tongue breaketh the bone.\""
    }, 
    {
      "index": 570, 
      "score": 0.19376350939273834, 
      "sent": "At the end of October, the sisters started secretly moving their possessions to the house of one of their high-school teachers, who agreed to help them."
    }, 
    {
      "index": 488, 
      "score": 0.1936957836151123, 
      "sent": "The next year, he and his family joined the church."
    }, 
    {
      "index": 112, 
      "score": 0.19346620142459869, 
      "sent": "But giving place to rebellious thoughts was the first step down the path toward Hell."
    }, 
    {
      "index": 288, 
      "score": 0.19336210191249847, 
      "sent": "When Hughes was hospitalized with a brain infection, Phelps-Roper showed him more concern than many of his real-life friends."
    }, 
    {
      "index": 54, 
      "score": 0.19334736466407776, 
      "sent": "She had been taught the church's vision of God's truth since birth."
    }, 
    {
      "index": 1, 
      "score": 0.19324541091918945, 
      "sent": "Credit Photograph by Katy Grannan for The New Yorker\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\tOn December 1, 2009, to commemorate World AIDS Day, Twitter announced a promotion: if users employed the hashtag #red, their tweets would appear highlighted in red."
    }, 
    {
      "index": 208, 
      "score": 0.19316217303276062, 
      "sent": "Phelps-Roper tagged Abitbol in the post so that he would see it."
    }, 
    {
      "index": 64, 
      "score": 0.19301415979862213, 
      "sent": "God hated the politicians who were allowing the United States to descend into a modern-day Sodom and Gomorrah."
    }, 
    {
      "index": 571, 
      "score": 0.19299879670143127, 
      "sent": "Many of Megan and Grace's young relatives who left the church had slipped away quietly, in order to avoid confronting their families."
    }, 
    {
      "index": 635, 
      "score": 0.19298811256885529, 
      "sent": "Now twenty-nine, she lives in a small town in South Dakota, where she works at a title company."
    }, 
    {
      "index": 189, 
      "score": 0.19268199801445007, 
      "sent": "One day, she was in the grocery store and picked up a container of yogurt with Oreo pieces."
    }, 
    {
      "index": 60, 
      "score": 0.19170446693897247, 
      "sent": "He believed that all people were born depraved, and that only a tiny elect who repented would be saved from Hell."
    }, 
    {
      "index": 425, 
      "score": 0.19165730476379395, 
      "sent": "Phelps-Roper had long assumed that she would likely never get married, since she was related to almost every male in the church."
    }, 
    {
      "index": 260, 
      "score": 0.19149492681026459, 
      "sent": "As she continued scrolling through Twitter, she saw that it was full of people mourning Murphy."
    }, 
    {
      "index": 72, 
      "score": 0.19111061096191406, 
      "sent": "Nevertheless, Phelps-Roper didn't grow up in isolation."
    }, 
    {
      "index": 74, 
      "score": 0.19080692529678345, 
      "sent": "The children of Westboro attended Topeka public schools, and Phelps-Roper ran track, listened to Sublime CDs, and read Stephen King novels."
    }, 
    {
      "index": 449, 
      "score": 0.1903577446937561, 
      "sent": "It accused her mother of lacking humility, saying that she was too zealous in correcting other members' behavior and had overreached her authority on a number of occasions, Phelps-Roper told me."
    }, 
    {
      "index": 17, 
      "score": 0.18991808593273163, 
      "sent": "Her posts could be easily monitored, since she worked at Phelps Chartered, the family law firm, beside her mother, Shirley, an attorney."
    }, 
    {
      "index": 622, 
      "score": 0.18987037241458893, 
      "sent": "One evening, after speaking at a Jewish festival in Montreal, she and Grace passed a group of drag queens on the sidewalk outside a cabaret."
    }, 
    {
      "index": 509, 
      "score": 0.1898036003112793, 
      "sent": "He also denied that women in the church had been significantly marginalized."
    }, 
    {
      "index": 335, 
      "score": 0.18936830759048462, 
      "sent": "Phelps-Roper knew that to press the issue would create problems for her in the church, so she quietly stopped holding the \"Death Penalty for Fags\" sign."
    }, 
    {
      "index": 671, 
      "score": 0.18932057917118073, 
      "sent": "Megan first visited the house in 2013, after her cousin Libby encouraged her to visit."
    }, 
    {
      "index": 297, 
      "score": 0.18902194499969482, 
      "sent": "In February, 2010, Westboro protested a festival in Long Beach, California, that David Abitbol had organized through Jewlicious."
    }, 
    {
      "index": 300, 
      "score": 0.18880882859230042, 
      "sent": "Phelps-Roper held four signs, while an Israeli flag dragged on the ground from her leg."
    }, 
    {
      "index": 353, 
      "score": 0.18845246732234955, 
      "sent": "She showed Theroux a picture of one of the filmmakers, Pepijn Borgwat, a smiling, handsome young man holding a package of chocolate truffles that she and her sister Grace had given to him."
    }, 
    {
      "index": 0, 
      "score": 0.18843352794647217, 
      "sent": "It was easy for Megan Phelps-Roper to tweet things that made people cringe--she knew that they were evil or deluded by God."
    }, 
    {
      "index": 169, 
      "score": 0.18830634653568268, 
      "sent": "The Westboro members stood across the street from the church, in a quiet neighborhood in South Omaha, as the mourners filed in."
    }, 
    {
      "index": 209, 
      "score": 0.18822379410266876, 
      "sent": "She wrote, \"Atlanta: radio guy says 'Finish this sentence: the only good Jew is a ."
    }, 
    {
      "index": 241, 
      "score": 0.18808719515800476, 
      "sent": "She was taken aback to see that he signed all his blog posts on Jewlicious with the handle \"ck\"--for \"christ killer\"--as if it were a badge of honor."
    }, 
    {
      "index": 469, 
      "score": 0.1880774199962616, 
      "sent": "Fred Phelps encouraged church members to read the Evangelical writer John R. Rice's book \"Bobbed Hair, Bossy Wives, and Women Preachers,\" from 1941, which offered a view of gender roles that was regressive even when it was published."
    }, 
    {
      "index": 392, 
      "score": 0.18793788552284241, 
      "sent": "The first image was of a tiny malnourished child."
    }, 
    {
      "index": 459, 
      "score": 0.18793421983718872, 
      "sent": "(Drain insists that Megan's description of the letter is inaccurate."
    }, 
    {
      "index": 661, 
      "score": 0.18785545229911804, 
      "sent": "We reached the church, an unremarkable white and brown mock-Tudor building on the northeast corner of the Block."
    }, 
    {
      "index": 217, 
      "score": 0.1877773106098175, 
      "sent": "Phelps-Roper posted another tweet, spelling it out more clearly."
    }, 
    {
      "index": 516, 
      "score": 0.18775419890880585, 
      "sent": "Phelps-Roper first considered leaving the church on July 4, 2012."
    }, 
    {
      "index": 193, 
      "score": 0.18773820996284485, 
      "sent": "\"We were making specific predictions about things without having, in my mind, sufficient scriptural support,\" she said."
    }, 
    {
      "index": 332, 
      "score": 0.18742740154266357, 
      "sent": "\"It was such a settled point that they've been preaching for so long it's almost like it didn't mean anything to her,\" Phelps-Roper said."
    }, 
    {
      "index": 677, 
      "score": 0.18734823167324066, 
      "sent": "Sometimes, when her mother appears in a video, Megan will loop it over and over, just to hear her voice."
    }, 
    {
      "index": 451, 
      "score": 0.18705447018146515, 
      "sent": "When a Westboro member was singled out for bad behavior, it often triggered a harrowing period of discipline."
    }, 
    {
      "index": 173, 
      "score": 0.18702112138271332, 
      "sent": "But, before the picket, she asked her mother to walk her through the Bible passages that justified their actions."
    }, 
    {
      "index": 49, 
      "score": 0.1869623064994812, 
      "sent": "By the end of the day, Phelps-Roper had more than a thousand followers."
    }, 
    {
      "index": 190, 
      "score": 0.18665124475955963, 
      "sent": "She stared at it, thinking, We won't have modern conveniences like this in the wilderness."
    }, 
    {
      "index": 290, 
      "score": 0.18647105991840363, 
      "sent": "As Phelps-Roper continued to tweet, she developed relationships with more people like Hughes."
    }, 
    {
      "index": 445, 
      "score": 0.18640804290771484, 
      "sent": "Phelps-Roper tried to throw herself back into the Westboro community, but the atmosphere had changed while she was distracted by her relationship with C.G."
    }, 
    {
      "index": 356, 
      "score": 0.1862395852804184, 
      "sent": "Megan's father made her block the Dutch journalists from her private Twitter account."
    }, 
    {
      "index": 246, 
      "score": 0.18622453510761261, 
      "sent": "And he wanted to humanize Jews to Westboro."
    }, 
    {
      "index": 101, 
      "score": 0.18608863651752472, 
      "sent": "Shirley, as Westboro's de-facto spokeswoman, granted interviews to almost any outlet, no matter how obscure or adversarial."
    }, 
    {
      "index": 355, 
      "score": 0.18599201738834381, 
      "sent": "\"I understand the concept of showing the world our brotherly kindness, but we don't have to let it all hang out,\" he wrote."
    }, 
    {
      "index": 274, 
      "score": 0.18555496633052826, 
      "sent": "And if she made things personal the conversation was inevitably derailed by a flood of angry tweets."
    }, 
    {
      "index": 253, 
      "score": 0.18533001840114594, 
      "sent": "When Phelps-Roper was younger, news of terrible events had given her a visceral thrill."
    }, 
    {
      "index": 491, 
      "score": 0.18529330193996429, 
      "sent": "The media quickly unravelled the hoax."
    }, 
    {
      "index": 153, 
      "score": 0.18503804504871368, 
      "sent": "One of the most common questions she was asked on the picket line was why she hated gay people so much."
    }, 
    {
      "index": 5, 
      "score": 0.18394400179386139, 
      "sent": "\"You won't repent of your rebellion that brought His wrath on you in this incurable scourge, so expect more & worse!"
    }, 
    {
      "index": 456, 
      "score": 0.18371763825416565, 
      "sent": "The Phelps-Roper house was now quiet, as the flow of church members and reporters stopped."
    }, 
    {
      "index": 502, 
      "score": 0.18353043496608734, 
      "sent": "Phelps-Roper was struck by the similarities between her arguments and what C.G."
    }, 
    {
      "index": 368, 
      "score": 0.18349187076091766, 
      "sent": "He said something like, 'I can't answer that, but I have never been beaten in Words with Friends' \"--the popular online Scrabble knockoff."
    }, 
    {
      "index": 512, 
      "score": 0.18339712917804718, 
      "sent": "Instead, after the Snyder decision, other members had volunteered to help her deal with an overwhelming torrent of media."
    }, 
    {
      "index": 499, 
      "score": 0.18317243456840515, 
      "sent": "She started to complain to her mother, saying that the elders were not obeying the Bible."
    }, 
    {
      "index": 185, 
      "score": 0.18275423347949982, 
      "sent": "Israel would be destroyed, and only a hundred and forty-four thousand Jews who repented for killing Jesus would be spared."
    }, 
    {
      "index": 337, 
      "score": 0.18253442645072937, 
      "sent": "She also put an end to the conversations with Abitbol."
    }, 
    {
      "index": 477, 
      "score": 0.18230260908603668, 
      "sent": "Phelps-Roper was upset to learn that some of her cousins lived under more liberal standards."
    }, 
    {
      "index": 191, 
      "score": 0.18215823173522949, 
      "sent": "Is it better to learn to live without them, or to enjoy them while we can?"
    }, 
    {
      "index": 340, 
      "score": 0.18210648000240326, 
      "sent": "On Twitter, Phelps-Roper taunted the group's members as \"crybaby hackers.\""
    }, 
    {
      "index": 314, 
      "score": 0.18175844848155975, 
      "sent": "Phelps-Roper and Abitbol continued their conversations via e-mail and Twitter's direct-message function."
    }, 
    {
      "index": 261, 
      "score": 0.18135407567024231, 
      "sent": "The contrast between the grief on Twitter and the buoyant mood in the basement unsettled her."
    }, 
    {
      "index": 529, 
      "score": 0.18134360015392303, 
      "sent": "\"These were the points I brought up: we're never going to see our families again, we're going to go to Hell for eternity, and our life will be meaningless.\""
    }, 
    {
      "index": 229, 
      "score": 0.1809518039226532, 
      "sent": "He was familiar with Westboro from its godhatesfags.com Web site."
    }, 
    {
      "index": 537, 
      "score": 0.18088905513286591, 
      "sent": "We don't believe that the Koran has the truth about God."
    }, 
    {
      "index": 645, 
      "score": 0.18076783418655396, 
      "sent": "In front of each house where Westboro members live, Megan pointed out colorful numbers on the curb; Grace had helped paint them when she was a teen-ager."
    }, 
    {
      "index": 187, 
      "score": 0.18047955632209778, 
      "sent": "Westboro members would lead these converted Jews through the wilderness until Christ returned and ushered them into Heaven."
    }, 
    {
      "index": 558, 
      "score": 0.18016098439693451, 
      "sent": "Phelps-Roper spent the summer and the fall in an existential spiral."
    }, 
    {
      "index": 572, 
      "score": 0.18011102080345154, 
      "sent": "But the sisters wanted to explain to their parents the reasons behind their decision."
    }, 
    {
      "index": 40, 
      "score": 0.17997913062572479, 
      "sent": "\"I think your plan is back-firing,\" she taunted Black."
    }, 
    {
      "index": 239, 
      "score": 0.17996281385421753, 
      "sent": "But he was harder to get a bead on than other critics she had encountered."
    }, 
    {
      "index": 308, 
      "score": 0.17988322675228119, 
      "sent": "Abitbol asked why Westboro always denounced homosexuality but never mentioned the fact that Leviticus also forbade having sex with a woman who was menstruating."
    }, 
    {
      "index": 149, 
      "score": 0.17986340820789337, 
      "sent": "Phelps-Roper believed that she was engaged in a profound act of love."
    }, 
    {
      "index": 357, 
      "score": 0.1796734482049942, 
      "sent": "\"It feels like we are opening ourselves up for entangling ourselves with the affairs or cares of this life,\" he e-mailed Phelps-Roper and her siblings."
    }, 
    {
      "index": 598, 
      "score": 0.179401695728302, 
      "sent": "As she drove there, she kept imagining her car careering off the highway--she was so afraid of God's wrath."
    }, 
    {
      "index": 575, 
      "score": 0.17937248945236206, 
      "sent": "Then the couple's marriage began to deteriorate, and the husband told Megan and Grace that they were going to divorce."
    }, 
    {
      "index": 591, 
      "score": 0.17936588823795319, 
      "sent": "Megan and Grace's father drove them to a hotel in Topeka, where he had paid for a room, but they were too scared to spend the night alone, so they called the teacher who had agreed to store their boxes."
    }, 
    {
      "index": 55, 
      "score": 0.17928560078144073, 
      "sent": "Her grandfather Fred Phelps established the church, in 1955."
    }, 
    {
      "index": 526, 
      "score": 0.17907366156578064, 
      "sent": "The next day, she mentioned the possibility of leaving to Grace."
    }, 
    {
      "index": 125, 
      "score": 0.1789373904466629, 
      "sent": "Westboro started picketing in June, 1991, when Phelps-Roper was five years old."
    }, 
    {
      "index": 119, 
      "score": 0.17868496477603912, 
      "sent": "As she grew older, she came to find comfort, and even joy, in submitting her will to the word of God."
    }, 
    {
      "index": 333, 
      "score": 0.1786743551492691, 
      "sent": "Still, she concluded that Westboro was in the wrong."
    }, 
    {
      "index": 597, 
      "score": 0.17855168879032135, 
      "sent": "They travelled to Deadwood, South Dakota, because Megan wanted to see the Black Hills."
    }, 
    {
      "index": 103, 
      "score": 0.17850248515605927, 
      "sent": "When reporters wanted the perspective of a young person, Shirley let them speak to Megan."
    }, 
    {
      "index": 56, 
      "score": 0.17809411883354187, 
      "sent": "Megan's mother was the fifth of Phelps's thirteen children."
    }, 
    {
      "index": 38, 
      "score": 0.1780400425195694, 
      "sent": "\"It's proof that people are seeing it and reacting to it.\""
    }, 
    {
      "index": 582, 
      "score": 0.17800942063331604, 
      "sent": "As Grace packed, their father came into her room and asked what she wanted the church to do differently."
    }, 
    {
      "index": 596, 
      "score": 0.17771178483963013, 
      "sent": "They lived in Lawrence for a month with their cousin Libby, who had also left the church, while Grace finished the first semester of her sophomore year at Washburn."
    }, 
    {
      "index": 57, 
      "score": 0.17760595679283142, 
      "sent": "Megan's father, Brent Roper, had joined the church as a teen-ager."
    }, 
    {
      "index": 248, 
      "score": 0.17753411829471588, 
      "sent": "One day, he tweeted about the television show \"Gossip Girl,\" and Phelps-Roper responded jocularly about one of its characters."
    }, 
    {
      "index": 104, 
      "score": 0.17714802920818329, 
      "sent": "In sixth grade, Megan gave her first live interview when she answered a call from a couple of radio d.j.s who wanted to speak to her mother."
    }, 
    {
      "index": 232, 
      "score": 0.17697958648204803, 
      "sent": "\"The first thing I wanted to see was something I didn't have access to in Montreal: neo-Nazis and hate groups.\""
    }, 
    {
      "index": 11, 
      "score": 0.17695322632789612, 
      "sent": "Westboro had long used the Internet to spread its message."
    }, 
    {
      "index": 113, 
      "score": 0.17689436674118042, 
      "sent": "\"The tone of your voice or the look on your face--you could get into so much trouble for these things, because they betray what's in your heart,\" she said."
    }, 
    {
      "index": 306, 
      "score": 0.17627881467342377, 
      "sent": "\"Our in-person interaction resembled our Twitter interaction,\" Phelps-Roper said."
    }, 
    {
      "index": 460, 
      "score": 0.17622923851013184, 
      "sent": "He said that it was a \"disciplinary message,\" but wouldn't reveal its contents."
    }, 
    {
      "index": 361, 
      "score": 0.17610175907611847, 
      "sent": "In February, 2011, Phelps-Roper began to have conversations on Twitter with a user named @F_K_A."
    }, 
    {
      "index": 424, 
      "score": 0.17606824636459351, 
      "sent": "When Phelps-Roper was growing up, one of her cousins had been pushed out of the church for, among other things, getting entangled with boys; other young women had been harshly punished."
    }, 
    {
      "index": 636, 
      "score": 0.17606580257415771, 
      "sent": "Six months after she left the church, she went on a date with C.G."
    }, 
    {
      "index": 267, 
      "score": 0.17604227364063263, 
      "sent": "They disregarded people's feelings in order to break their idols."
    }, 
    {
      "index": 58, 
      "score": 0.17597496509552002, 
      "sent": "Every Sunday, Megan and her ten siblings sat in Westboro's small wood-panelled church as her grandfather delivered the sermon."
    }, 
    {
      "index": 380, 
      "score": 0.1758095920085907, 
      "sent": "\"We had the same discussion several times when someone would die,\" Phelps-Roper said."
    }, 
    {
      "index": 140, 
      "score": 0.17558948695659637, 
      "sent": "When the targets were within driving distance, the group packed into a minivan and her grandfather saw them off from his driveway."
    }, 
    {
      "index": 168, 
      "score": 0.1753460019826889, 
      "sent": "She was nineteen years old and a sophomore at Washburn University, a secular public college in Topeka, where many Westboro children went."
    }, 
    {
      "index": 116, 
      "score": 0.1751931756734848, 
      "sent": "The joke hit close to home for Phelps-Roper, who was spanked well into her teens."
    }, 
    {
      "index": 231, 
      "score": 0.17516319453716278, 
      "sent": "\"Most people, when they first get access to the Internet, the first thing they wanted to see was naked ladies,\" he told me."
    }, 
    {
      "index": 336, 
      "score": 0.17485015094280243, 
      "sent": "There were plenty of other signs whose message she still believed in wholeheartedly."
    }, 
    {
      "index": 251, 
      "score": 0.17472729086875916, 
      "sent": "When she read the tweet aloud, other church members reacted with glee, celebrating another righteous judgment from God."
    }, 
    {
      "index": 475, 
      "score": 0.1742902547121048, 
      "sent": "After one shopping trip with her mother and her sisters, Phelps-Roper had to show her clothes to her father and her brother Sam, to make sure that they were appropriate."
    }, 
    {
      "index": 158, 
      "score": 0.17428362369537354, 
      "sent": "\"They turned the country over to the fags--they're coming home in body bags!\""
    }, 
    {
      "index": 313, 
      "score": 0.17418408393859863, 
      "sent": "Abitbol said that he'd be there, too, and when they met again they exchanged gifts."
    }, 
    {
      "index": 150, 
      "score": 0.17404212057590485, 
      "sent": "Leviticus 19:17 commands, \"Thou shalt not hate thy brother in thine heart: thou shalt in any wise rebuke thy neighbour, and not suffer sin upon him.\""
    }, 
    {
      "index": 365, 
      "score": 0.17404212057590485, 
      "sent": "But @F_K_A was disarmed by Phelps-Roper's friendly demeanor."
    }, 
    {
      "index": 167, 
      "score": 0.17399589717388153, 
      "sent": "Phelps-Roper picketed her first military funeral in July, 2005, in Omaha."
    }, 
    {
      "index": 166, 
      "score": 0.17354750633239746, 
      "sent": "A group of motorcyclists called the Patriot Guard Riders eventually began to follow Westboro members around the country, revving their engines to drown out their singing."
    }, 
    {
      "index": 235, 
      "score": 0.17294836044311523, 
      "sent": "\"We didn't want to debate them, we just wanted to make fun of them,\" he said."
    }, 
    {
      "index": 3, 
      "score": 0.17289726436138153, 
      "sent": "\"Thank God for AIDS!\""
    }, 
    {
      "index": 199, 
      "score": 0.17234024405479431, 
      "sent": "They picketed synagogues and sent anti-Semitic DVDs to Jewish organizations."
    }, 
    {
      "index": 292, 
      "score": 0.17230750620365143, 
      "sent": "There was a young Australian guy who tweeted political jokes that she and her younger sister Grace found hilarious."
    }, 
    {
      "index": 106, 
      "score": 0.17229931056499481, 
      "sent": "Obedience was one of the most important values that Shirley instilled in Megan."
    }, 
    {
      "index": 557, 
      "score": 0.17187301814556122, 
      "sent": "But the idea of living among outsiders was no longer unimaginable."
    }, 
    {
      "index": 672, 
      "score": 0.17185769975185394, 
      "sent": "She sneaked in the back door, for fear of being spotted by her family."
    }, 
    {
      "index": 485, 
      "score": 0.17182603478431702, 
      "sent": "\"It stopped feeling like this larger-than-life divine institution ordained and led by God, and more like the sniping and sordid activity of men who wanted to be in control,\" Phelps-Roper said."
    }, 
    {
      "index": 376, 
      "score": 0.17156533896923065, 
      "sent": "\"He was careful not to reveal anything about himself,\" Phelps-Roper said."
    }, 
    {
      "index": 627, 
      "score": 0.17153126001358032, 
      "sent": "Wherever Megan and Grace went, they met people who wanted to help them, despite all the hurt they had caused."
    }, 
    {
      "index": 366, 
      "score": 0.17152638733386993, 
      "sent": "He began to ask her questions about life in Westboro, and, because he was curious instead of condemning, she kept answering them."
    }, 
    {
      "index": 250, 
      "score": 0.17137381434440613, 
      "sent": "On December 20, 2009, Phelps-Roper was in the basement of her house, for a church function, when she checked Twitter on her phone and saw that Brittany Murphy, the thirty-two-year-old actress, had died."
    }, 
    {
      "index": 310, 
      "score": 0.17133559286594391, 
      "sent": "As far as she could remember, her grandfather had never addressed that issue from the pulpit."
    }, 
    {
      "index": 578, 
      "score": 0.17119832336902618, 
      "sent": "On Sunday, November 11th, the family had just returned from church when Megan and Grace were called into their parents' bedroom, where their father began to read the letter out loud."
    }, 
    {
      "index": 110, 
      "score": 0.17113827168941498, 
      "sent": "The smallest hint of dissent was seen as an intolerable act of rebellion against God."
    }, 
    {
      "index": 617, 
      "score": 0.17101344466209412, 
      "sent": "Grace became especially close with the family, and ended up staying for more than a month."
    }, 
    {
      "index": 503, 
      "score": 0.17085325717926025, 
      "sent": "and David Abitbol had always said about the church."
    }, 
    {
      "index": 94, 
      "score": 0.17045742273330688, 
      "sent": "Starting in middle school, Megan worked side by side with Shirley; among her siblings, she had a uniquely strong bond with her mother."
    }, 
    {
      "index": 334, 
      "score": 0.17037534713745117, 
      "sent": "\"That was the first time I came to a place where I disagreed, I knew I disagreed, and I didn't accept the answer that they gave,\" she said."
    }, 
    {
      "index": 48, 
      "score": 0.17037056386470795, 
      "sent": "\"I did not want to be the one to let it die,\" she said."
    }, 
    {
      "index": 384, 
      "score": 0.16988959908485413, 
      "sent": "\"always tried to advocate for a third group of people: people who were decent but not religious.\""
    }, 
    {
      "index": 473, 
      "score": 0.16982628405094147, 
      "sent": "But now the elders required more severe standards of modesty."
    }, 
    {
      "index": 468, 
      "score": 0.16944408416748047, 
      "sent": "But now the emphasis shifted to passages about women submitting to their husbands."
    }, 
    {
      "index": 76, 
      "score": 0.16929921507835388, 
      "sent": "She was friendly with her classmates and her teachers, but viewed them with extreme suspicion--she knew that they were either intentionally evil or deluded by God."
    }, 
    {
      "index": 605, 
      "score": 0.16926099359989166, 
      "sent": "It was her first tweet in three months."
    }, 
    {
      "index": 284, 
      "score": 0.16922713816165924, 
      "sent": "\"I remember just thinking, How can somebody who appreciates good music believe so many hateful things?\""
    }, 
    {
      "index": 243, 
      "score": 0.16895286738872528, 
      "sent": "\"I knew he was evil, but he was friendly, so I was especially wary, because you don't want to be seduced away from the truth by a crafty deceiver,\" Phelps-Roper said."
    }, 
    {
      "index": 439, 
      "score": 0.16893818974494934, 
      "sent": "\"And the fact that I dreamed about him, and the strong feeling of wanting that relationship, represented huge danger to me.\""
    }, 
    {
      "index": 478, 
      "score": 0.16884170472621918, 
      "sent": "How could God's judgment differ from house to house?"
    }, 
    {
      "index": 545, 
      "score": 0.1687658429145813, 
      "sent": "It's starting to seem made up to scare people into doing what they say.\""
    }, 
    {
      "index": 105, 
      "score": 0.16874995827674866, 
      "sent": "Megan recalls, \"They thought it was hilarious, this eleven-year-old talking about hating Jews.\""
    }, 
    {
      "index": 69, 
      "score": 0.16866379976272583, 
      "sent": "In awe of his conviction and deep knowledge of Scripture, she developed a revulsion to homosexuality."
    }, 
    {
      "index": 146, 
      "score": 0.16862234473228455, 
      "sent": "Her favorite slogans were \"God is your enemy,\" \"No Peace for the Wicked,\" \"God hates your idols,\" and \"Mourn for your sins.\""
    }, 
    {
      "index": 164, 
      "score": 0.16845844686031342, 
      "sent": "The outrage sparked by the soldier-funeral protests dwarfed anything that Phelps-Roper had experienced previously."
    }, 
    {
      "index": 4, 
      "score": 0.16839797794818878, 
      "sent": "she tweeted that morning."
    }, 
    {
      "index": 670, 
      "score": 0.16803734004497528, 
      "sent": "Planting Peace has worked with former Westboro members to spread its message of tolerance."
    }, 
    {
      "index": 481, 
      "score": 0.16776655614376068, 
      "sent": "Once-minor indignities, like being accompanied by an adult chaperone while eating lunch at a restaurant with other young church members, now seemed unbearable."
    }, 
    {
      "index": 682, 
      "score": 0.16753055155277252, 
      "sent": "At a church meeting, Zach recalls, members discussed the episode: \"He stepped out the front door of the church and looked at the Rainbow House, the Planting Peace organization, and looked over and said, 'You're good people.'"
    }, 
    {
      "index": 348, 
      "score": 0.16752065718173981, 
      "sent": "That month, she tweeted more than two thousand times; by the end of the month, she had more than seven thousand followers."
    }, 
    {
      "index": 590, 
      "score": 0.16746886074542999, 
      "sent": "When Megan told them she was leaving, her grandfather looked at her grandmother and said, \"Well, I thought we had a jewel this time.\""
    }, 
    {
      "index": 294, 
      "score": 0.16732560098171234, 
      "sent": "By following her opponents' feeds, she absorbed their thoughts on the world, learned what food they ate, and saw photographs of their babies."
    }, 
    {
      "index": 538, 
      "score": 0.16727660596370697, 
      "sent": "Is it just because we were told forever that this is How Things Are?\""
    }, 
    {
      "index": 155, 
      "score": 0.16715846955776215, 
      "sent": "And the rest of the world hated them, too, by cheering them on as they doomed themselves to Hell."
    }, 
    {
      "index": 237, 
      "score": 0.16705836355686188, 
      "sent": "Phelps-Roper got into an extended debate with Abitbol on Twitter."
    }, 
    {
      "index": 269, 
      "score": 0.16705396771430969, 
      "sent": "\"Get a grip, you presumptuous toad,\" Phelps-Roper had replied."
    }, 
    {
      "index": 408, 
      "score": 0.16703465580940247, 
      "sent": "He poked fun at the inelegant fonts that Westboro used for its press releases."
    }, 
    {
      "index": 564, 
      "score": 0.16697736084461212, 
      "sent": "She largely stopped tweeting and tried to avoid journalists on the picket line, for fear that she might say something that revealed her misgivings."
    }, 
    {
      "index": 114, 
      "score": 0.16695596277713776, 
      "sent": "Her parents took to heart the proverb \"He that spareth his rod hateth his son.\""
    }, 
    {
      "index": 405, 
      "score": 0.16689711809158325, 
      "sent": "He introduced Phelps-Roper to bands like the Antlers, Blind Pilot, and Cults--\"funnily enough,\" she said--and to the novels of David Foster Wallace and Marilynne Robinson."
    }, 
    {
      "index": 343, 
      "score": 0.16680081188678741, 
      "sent": "Your efforts to shut up God's word only serve to publish it further,\" Phelps-Roper tweeted."
    }, 
    {
      "index": 236, 
      "score": 0.16664531826972961, 
      "sent": "As for the Westboro members, \"I just thought they were crazy.\""
    }, 
    {
      "index": 30, 
      "score": 0.16644515097141266, 
      "sent": "He tweeted, \"Sort of obsessed w/ @meganphelps."
    }, 
    {
      "index": 174, 
      "score": 0.16626283526420593, 
      "sent": "\"I'm, like, O.K., it's there,\" she said."
    }, 
    {
      "index": 462, 
      "score": 0.16610242426395416, 
      "sent": "An all-male group of nine elders took control of church affairs."
    }, 
    {
      "index": 511, 
      "score": 0.16609655320644379, 
      "sent": "Shirley's role was not reduced as a punishment for overstepping her bounds, he said."
    }, 
    {
      "index": 35, 
      "score": 0.1659792959690094, 
      "sent": "Phelps-Roper was exhilarated by the response."
    }, 
    {
      "index": 341, 
      "score": 0.16585804522037506, 
      "sent": "Anonymous retaliated by hacking godhatesfags.com, and blogs seized on the drama."
    }, 
    {
      "index": 414, 
      "score": 0.165824294090271, 
      "sent": "It was coming from him, this question mark of a person that I don't get to know about, but she has some kind of thing with.\""
    }, 
    {
      "index": 428, 
      "score": 0.16581971943378448, 
      "sent": "She did her best to displace her feelings for C.G."
    }, 
    {
      "index": 616, 
      "score": 0.16578841209411621, 
      "sent": "They went kosher-grocery shopping together, and Megan and Grace looked after the kids."
    }, 
    {
      "index": 621, 
      "score": 0.16543102264404297, 
      "sent": "Megan tried to put herself in situations that challenged the intolerance she had been indoctrinated with."
    }, 
    {
      "index": 219, 
      "score": 0.16516248881816864, 
      "sent": "Your dead rote rituals == true repentance."
    }, 
    {
      "index": 458, 
      "score": 0.16488166153430939, 
      "sent": "\"She had to be put in her place, essentially, and that feeling--it just was really, really wrong to me.\""
    }, 
    {
      "index": 423, 
      "score": 0.16471059620380402, 
      "sent": "For young women in Westboro, having romantic interactions with someone outside the church was forbidden."
    }, 
    {
      "index": 604, 
      "score": 0.16446493566036224, 
      "sent": "She posted a link to the statement on Twitter."
    }, 
    {
      "index": 401, 
      "score": 0.16443505883216858, 
      "sent": "Phelps-Roper's conversations with C.G."
    }, 
    {
      "index": 501, 
      "score": 0.16433736681938171, 
      "sent": "The elders acted arrogantly and tolerated no dissent, when God demanded meekness and humility."
    }, 
    {
      "index": 634, 
      "score": 0.16411899030208588, 
      "sent": "Phelps-Roper wore a green polka-dot dress and high leather boots, and her long curly hair--she still hadn't cut it since leaving the church--fell down her back."
    }, 
    {
      "index": 80, 
      "score": 0.1640089750289917, 
      "sent": "The Westboro students had a reputation for being diligent and polite in class, but at lunch they would picket the school, dodging food hurled at them by incensed classmates."
    }, 
    {
      "index": 620, 
      "score": 0.16390880942344666, 
      "sent": "Your rabbi is a host.\""
    }, 
    {
      "index": 471, 
      "score": 0.16363875567913055, 
      "sent": "\"It was, like, I would need to get permission from Dad to talk to anybody else.\""
    }, 
    {
      "index": 118, 
      "score": 0.16358925402164459, 
      "sent": "But, she added, \"I also always knew that they were just trying to do what God required of them.\""
    }, 
    {
      "index": 198, 
      "score": 0.16339030861854553, 
      "sent": "Members hoped to find the hundred and forty-four thousand repentant Jews."
    }, 
    {
      "index": 603, 
      "score": 0.16317297518253326, 
      "sent": "\"What we can do is try to find a better way to live from here on.\""
    }, 
    {
      "index": 547, 
      "score": 0.16307108104228973, 
      "sent": "That day, Grace wrote to Megan, \"Our belief in God has always curbed everything."
    }, 
    {
      "index": 165, 
      "score": 0.1630222350358963, 
      "sent": "Crowds of rowdy, sometimes violent counterprotesters tried to block their signs with huge American flags."
    }, 
    {
      "index": 684, 
      "score": 0.162960484623909, 
      "sent": "Sign up for the daily newsletter: the best of The New Yorker every day."
    }, 
    {
      "index": 92, 
      "score": 0.16293990612030029, 
      "sent": "A parade of journalists and Westboro members sought meetings with her."
    }, 
    {
      "index": 416, 
      "score": 0.16292011737823486, 
      "sent": "Grace was seven years younger than Megan, and still in high school at the time."
    }, 
    {
      "index": 375, 
      "score": 0.16284850239753723, 
      "sent": "She knew that he was an attorney, but she didn't know where he lived or how old he was."
    }, 
    {
      "index": 220, 
      "score": 0.16281788051128387, 
      "sent": "We know the diff."
    }, 
    {
      "index": 652, 
      "score": 0.16279858350753784, 
      "sent": "Megan later explained that they had probably just come from doing repairs on a Westboro member's house."
    }, 
    {
      "index": 587, 
      "score": 0.16257742047309875, 
      "sent": "\"The fact that I'm coming face to face with the damage that I was doing to them was even worse than anything else that was happening to me,\" Phelps-Roper said."
    }, 
    {
      "index": 89, 
      "score": 0.16249243915081024, 
      "sent": "An alcove in the kitchen had cubbies for the signs that were used in pickets."
    }, 
    {
      "index": 457, 
      "score": 0.16243405640125275, 
      "sent": "\"I watched her all my life work so hard and sacrifice so much, and just be so willing to do anything for anybody,\" Phelps-Roper said."
    }, 
    {
      "index": 46, 
      "score": 0.16242866218090057, 
      "sent": "Like this: God hates America.\""
    }, 
    {
      "index": 448, 
      "score": 0.16236642003059387, 
      "sent": "After Phelps-Roper pressed her parents, they showed her an e-mail they'd received from her oldest brother, Sam, and Steve Drain, another church member."
    }, 
    {
      "index": 431, 
      "score": 0.16223099827766418, 
      "sent": "Then, on September 30, 2011, she had a dream: It was a beautiful summer day, and she was standing on the driveway of the church."
    }, 
    {
      "index": 264, 
      "score": 0.16219374537467957, 
      "sent": "Her hesitance reflected a growing concern for the feelings of people outside Westboro."
    }, 
    {
      "index": 226, 
      "score": 0.16212223470211029, 
      "sent": "Your 'ministry' is a joke.\""
    }, 
    {
      "index": 480, 
      "score": 0.16209569573402405, 
      "sent": "In 2012, she was twenty-six years old, but she was still being treated like a child."
    }, 
    {
      "index": 382, 
      "score": 0.16204993426799774, 
      "sent": "urged Phelps-Roper to think of how much hurt it must cause the families of the deceased to see Phelps-Roper and her family rejoicing."
    }, 
    {
      "index": 623, 
      "score": 0.16198191046714783, 
      "sent": "She felt a surge of disgust, but when Grace asked if they could watch the show she agreed."
    }, 
    {
      "index": 272, 
      "score": 0.16196735203266144, 
      "sent": "But on Twitter Phelps-Roper found that it was better to take a gentler tone."
    }, 
    {
      "index": 137, 
      "score": 0.16195601224899292, 
      "sent": "They picketed high schools, concerts, conferences, and film festivals, no matter how tenuous the connection to homosexuality or other sins."
    }, 
    {
      "index": 151, 
      "score": 0.16185684502124786, 
      "sent": "\"When you see someone is backing into traffic, you yell at them,\" Phelps-Roper said."
    }, 
    {
      "index": 411, 
      "score": 0.16128548979759216, 
      "sent": "As Phelps-Roper developed her relationship with C.G., her sister Grace grew suspicious."
    }, 
    {
      "index": 70, 
      "score": 0.16123798489570618, 
      "sent": "\"We thought of him as a star in the right hand of God,\" she said."
    }, 
    {
      "index": 595, 
      "score": 0.16120138764381409, 
      "sent": "For the next few months, the sisters drifted."
    }, 
    {
      "index": 281, 
      "score": 0.16090975701808929, 
      "sent": "Phelps-Roper told me, \"We weren't supposed to care about what people thought about us, but I did.\""
    }, 
    {
      "index": 631, 
      "score": 0.16087475419044495, 
      "sent": "One Sunday last February, I went with Megan and Grace to visit their old neighborhood."
    }, 
    {
      "index": 533, 
      "score": 0.16064742207527161, 
      "sent": "\"So many other thoughts came in that I'd never pursued, and that's every doubt that I'd ever had, everything that had ever seemed illogical or off.\""
    }, 
    {
      "index": 138, 
      "score": 0.16039560735225677, 
      "sent": "\"Eventually, the targets broadened such that everyone was a target,\" Phelps-Roper said."
    }, 
    {
      "index": 265, 
      "score": 0.1601952463388443, 
      "sent": "Church members disdained human feelings as something that people worshipped instead of the Bible."
    }, 
    {
      "index": 611, 
      "score": 0.16010390222072601, 
      "sent": "\"It was like we were just reaching out and grabbing on to whatever was around,\" Megan said."
    }, 
    {
      "index": 367, 
      "score": 0.1600087583065033, 
      "sent": "One day, Phelps-Roper recalled, \"I asked him some kind of pointed question about the Bible."
    }, 
    {
      "index": 536, 
      "score": 0.15994091331958771, 
      "sent": "One day, she texted Grace, \"What if the God of the Bible isn't the God of creation?"
    }, 
    {
      "index": 612, 
      "score": 0.15987329185009003, 
      "sent": "Abitbol said, \"People, before they met them, were, like, 'So, now they're not batshit-crazy gay haters and we're supposed to love them?"
    }, 
    {
      "index": 63, 
      "score": 0.15967181324958801, 
      "sent": "Phelps believed that God hated unrepentant sinners."
    }, 
    {
      "index": 286, 
      "score": 0.15956307947635651, 
      "sent": "In November, 2009, Hughes, then a college student in British Columbia, interviewed Phelps-Roper for a religious-studies class."
    }, 
    {
      "index": 500, 
      "score": 0.15955176949501038, 
      "sent": "They treated her mother and other members with cruelty when the Bible required brotherly love, she said."
    }, 
    {
      "index": 293, 
      "score": 0.15942949056625366, 
      "sent": "\"It was like I was becoming part of a community,\" Phelps-Roper said."
    }, 
    {
      "index": 498, 
      "score": 0.1593046635389328, 
      "sent": "Megan's doubt engendered by the \"Death Penalty for Fags\" sign grew."
    }, 
    {
      "index": 576, 
      "score": 0.15919493138790131, 
      "sent": "Grace became involved in a brief romantic relationship with the man."
    }, 
    {
      "index": 252, 
      "score": 0.15918807685375214, 
      "sent": "\"Lots of people were talking about going to picket her funeral,\" Phelps-Roper said."
    }, 
    {
      "index": 388, 
      "score": 0.15914167463779449, 
      "sent": "\"He seemed to genuinely like people and care about people, and that resonated with me.\""
    }, 
    {
      "index": 238, 
      "score": 0.15895038843154907, 
      "sent": "\"Arguing is fun when you think you have all the answers,\" she said."
    }, 
    {
      "index": 370, 
      "score": 0.15865728259086609, 
      "sent": "=)\" She put her Words with Friends username at the end of the tweet."
    }, 
    {
      "index": 289, 
      "score": 0.15841551125049591, 
      "sent": "\"I knew there was a genuine connection between us,\" he said."
    }, 
    {
      "index": 454, 
      "score": 0.1582767516374588, 
      "sent": "\"My mother was supposed to be primarily a mother and a caretaker,\" Zach Phelps-Roper, Megan's younger brother, told me."
    }, 
    {
      "index": 263, 
      "score": 0.15796594321727753, 
      "sent": "\"I felt like I would be such a jackass to go on and post something like that,\" she said."
    }, 
    {
      "index": 586, 
      "score": 0.15790124237537384, 
      "sent": "Other church members stopped by to say goodbye and to warn the sisters of the consequences of their decision."
    }, 
    {
      "index": 417, 
      "score": 0.15790100395679474, 
      "sent": "Grace would scroll through Megan's iPhone, asking about the various messages and e-mails."
    }, 
    {
      "index": 383, 
      "score": 0.15756291151046753, 
      "sent": "Westboro divided people into good and evil, but, Phelps-Roper said, C.G."
    }, 
    {
      "index": 307, 
      "score": 0.15748670697212219, 
      "sent": "\"Funny, friendly, but definitely on opposite sides and each sticking to our guns.\""
    }, 
    {
      "index": 641, 
      "score": 0.15718501806259155, 
      "sent": "He put his arm around my waist at one point, and I just stood up so straight.\""
    }, 
    {
      "index": 493, 
      "score": 0.15716502070426941, 
      "sent": "Phelps-Roper was embarrassed by the debacle."
    }, 
    {
      "index": 90, 
      "score": 0.15689978003501892, 
      "sent": "On summer afternoons, Shirley led Bible readings for young members."
    }, 
    {
      "index": 662, 
      "score": 0.15678317844867706, 
      "sent": "A banner advertised a Westboro Web site, godhatesamerica.com."
    }, 
    {
      "index": 520, 
      "score": 0.15664155781269073, 
      "sent": "The lyrics seemed to reflect her dilemma perfectly: \"And will I break and will I bow / if I cannot let it go?\""
    }, 
    {
      "index": 395, 
      "score": 0.15631704032421112, 
      "sent": "Her mother quickly composed a triumphant blog post about the famine."
    }, 
    {
      "index": 123, 
      "score": 0.15630394220352173, 
      "sent": "\"I wanted to be good, and I wanted to be obedient, and I wanted to be the object of my parents' pride."
    }, 
    {
      "index": 579, 
      "score": 0.15627659857273102, 
      "sent": "Megan told Grace quietly that they had to leave: \"It was like the world was exploding and I didn't want to be around to see it.\""
    }, 
    {
      "index": 296, 
      "score": 0.15622790157794952, 
      "sent": "When she read about an earthquake that struck off Canada's Pacific coast, she sent a concerned tweet to Graham Hughes: \"Isn't this close to you?\""
    }, 
    {
      "index": 593, 
      "score": 0.15617544949054718, 
      "sent": "Megan and Grace returned to their house the next day with a U-Haul truck to pick up their remaining possessions."
    }, 
    {
      "index": 170, 
      "score": 0.15601447224617004, 
      "sent": "\"Everybody's in close quarters, and marines in dress blues are just staring at us with--the word that comes to mind is hateful 'disgust.'"
    }, 
    {
      "index": 552, 
      "score": 0.15592199563980103, 
      "sent": "For Megan, the answer could be found in other people."
    }, 
    {
      "index": 85, 
      "score": 0.15572687983512878, 
      "sent": "Their back yards were surrounded by a tall fence, creating a huge courtyard that was home to a trampoline, an in-ground pool, a playground, and a running track."
    }, 
    {
      "index": 663, 
      "score": 0.15567798912525177, 
      "sent": "Two American flags--one of them rainbow colored--flew upside down from a pole."
    }, 
    {
      "index": 553, 
      "score": 0.15545126795768738, 
      "sent": "\"We know what it is to be kind & good to people,\" she wrote."
    }, 
    {
      "index": 65, 
      "score": 0.155422642827034, 
      "sent": "He hated the celebrities who glorified fornication."
    }, 
    {
      "index": 427, 
      "score": 0.15532869100570679, 
      "sent": "\"It's not just the physical stuff that can get you in trouble.\""
    }, 
    {
      "index": 142, 
      "score": 0.15532299876213074, 
      "sent": "When they flew, she and Libby recounted \"Saturday Night Live\" skits."
    }, 
    {
      "index": 556, 
      "score": 0.15486225485801697, 
      "sent": "In truth, Megan didn't want other people, either; she desperately wanted things in Westboro to go back to the way they had been."
    }, 
    {
      "index": 83, 
      "score": 0.15484373271465302, 
      "sent": "Many of them worked as lawyers at Phelps Chartered."
    }, 
    {
      "index": 194, 
      "score": 0.1547267735004425, 
      "sent": "Many other members shared her bewilderment, she found, and so she turned to Twitter for answers."
    }, 
    {
      "index": 407, 
      "score": 0.15464009344577789, 
      "sent": "He turned her on to the Field Notes brand of notebooks."
    }, 
    {
      "index": 410, 
      "score": 0.15449540317058563, 
      "sent": "complimented her on her grammar, she took pains to make sure that her tweets were free of clunky text-message abbreviations."
    }, 
    {
      "index": 589, 
      "score": 0.15430431067943573, 
      "sent": "She walked over to the residence where her grandparents lived, above the church sanctuary."
    }, 
    {
      "index": 213, 
      "score": 0.15429927408695221, 
      "sent": "The only answer that suffices @jewlicious.\""
    }, 
    {
      "index": 59, 
      "score": 0.15373581647872925, 
      "sent": "Fred Phelps preached a harsh Calvinist doctrine in a resounding Southern drawl."
    }, 
    {
      "index": 594, 
      "score": 0.15359455347061157, 
      "sent": "As they walked away for the last time, Shirley called after them, \"You know you can always come back.\""
    }, 
    {
      "index": 565, 
      "score": 0.15359194576740265, 
      "sent": "At one protest, a journalism student cornered her and asked if she ever got tired of picketing."
    }, 
    {
      "index": 81, 
      "score": 0.15326370298862457, 
      "sent": "Phelps-Roper was constantly around family."
    }, 
    {
      "index": 152, 
      "score": 0.1531464159488678, 
      "sent": "\"You don't mope around and say it's such a good idea.\""
    }, 
    {
      "index": 602, 
      "score": 0.15266524255275726, 
      "sent": "\"Until now, our names have been synonymous with 'God Hates Fags,' \" she wrote."
    }, 
    {
      "index": 23, 
      "score": 0.15223188698291779, 
      "sent": "Tons going in & taking pics--even tho others tried to block our signs\")."
    }, 
    {
      "index": 154, 
      "score": 0.1521570235490799, 
      "sent": "She didn't hate gay people, she would reply, God hated gay people."
    }, 
    {
      "index": 470, 
      "score": 0.15205316245555878, 
      "sent": "\"It suddenly sucked to be a woman,\" Phelps-Roper said."
    }, 
    {
      "index": 581, 
      "score": 0.15198859572410583, 
      "sent": "Their parents wanted to talk things over--they seemed to think that the sisters could be persuaded to stay--but Megan and Grace had made up their minds."
    }, 
    {
      "index": 521, 
      "score": 0.15183570981025696, 
      "sent": "Then came the chorus: \"I can't believe we get just one.\""
    }, 
    {
      "index": 614, 
      "score": 0.15158113837242126, 
      "sent": "\" He added, \"And then they heard them speak, and there wasn't a dry eye in the house.\""
    }, 
    {
      "index": 141, 
      "score": 0.15153177082538605, 
      "sent": "\"At five in the morning, he'd come out and give us all hugs,\" she said."
    }, 
    {
      "index": 476, 
      "score": 0.15144936740398407, 
      "sent": "She was barred from wearing colorful nail polish and her favorite gold sandals to church."
    }, 
    {
      "index": 436, 
      "score": 0.15143877267837524, 
      "sent": "\"It was so real, that feeling of wanting to be with him,\" Phelps-Roper told me."
    }, 
    {
      "index": 31, 
      "score": 0.15139719843864441, 
      "sent": "Sample tweet: 'AIDS is God's curse on you.'"
    }, 
    {
      "index": 319, 
      "score": 0.151105135679245, 
      "sent": "Abitbol helped her with the vocabulary."
    }, 
    {
      "index": 544, 
      "score": 0.15094587206840515, 
      "sent": "Two days later, she texted Grace about Hell: \"Why do we think it's real?"
    }, 
    {
      "index": 266, 
      "score": 0.15080656111240387, 
      "sent": "They even had a sign: \"God hates your feelings.\""
    }, 
    {
      "index": 369, 
      "score": 0.15076179802417755, 
      "sent": "Phelps-Roper replied, \"I can't boast the same."
    }, 
    {
      "index": 608, 
      "score": 0.15071351826190948, 
      "sent": "\"I expected a lot more people to be unforgiving,\" she said."
    }, 
    {
      "index": 102, 
      "score": 0.15069465339183807, 
      "sent": "\"She was smart and funny, and would answer impertinent questions and not be offended about it,\" Megan said."
    }, 
    {
      "index": 664, 
      "score": 0.15060818195343018, 
      "sent": "The church sign read \"ST. VALENTINE IS A CATHOLIC IDOL AND AN EXCUSE TO FORNICATE!"
    }, 
    {
      "index": 534, 
      "score": 0.15051911771297455, 
      "sent": "When they were together, Megan engaged Grace in interminable theological conversations."
    }, 
    {
      "index": 505, 
      "score": 0.15046119689941406, 
      "sent": "\"Seeing those parallels was really disorienting.\""
    }, 
    {
      "index": 412, 
      "score": 0.15038229525089264, 
      "sent": "\"Suddenly, her taste in music started changing,\" Grace told me."
    }, 
    {
      "index": 658, 
      "score": 0.15037617087364197, 
      "sent": "Sam and Noah had recently had birthdays, and Megan wished them a belated happy birthday."
    }, 
    {
      "index": 97, 
      "score": 0.15036344528198242, 
      "sent": "\"Shirley had a very abrasive personality,\" Josh Phelps said."
    }, 
    {
      "index": 504, 
      "score": 0.15031667053699493, 
      "sent": "\"It was like we were finally doing to ourselves what we had done to everyone else,\" she said."
    }, 
    {
      "index": 37, 
      "score": 0.14992578327655792, 
      "sent": "\"It's not just like 'Yes, all these people are seeing it,' \" she told me."
    }, 
    {
      "index": 301, 
      "score": 0.14989469945430756, 
      "sent": "The church members were quickly mobbed by an angry crowd."
    }, 
    {
      "index": 143, 
      "score": 0.14957159757614136, 
      "sent": "Amazing things happened on the trips."
    }, 
    {
      "index": 396, 
      "score": 0.14954875409603119, 
      "sent": "\"Thank God for famine in East Africa!\""
    }, 
    {
      "index": 372, 
      "score": 0.14954285323619843, 
      "sent": "@F_K_A told Phelps-Roper to call him C.G."
    }, 
    {
      "index": 148, 
      "score": 0.14950093626976013, 
      "sent": "\"If you were ever upset or even scared, you do not show it, because this is not the time or the place,\" she said."
    }, 
    {
      "index": 222, 
      "score": 0.14944902062416077, 
      "sent": "3:9 You keep promoting sin, which belies the ugly truth.\""
    }, 
    {
      "index": 429, 
      "score": 0.14921620488166809, 
      "sent": "onto the music and books he recommended, which she fervently consumed."
    }, 
    {
      "index": 394, 
      "score": 0.14907164871692657, 
      "sent": "Her mother asked what was wrong, and Phelps-Roper showed her the gallery."
    }, 
    {
      "index": 510, 
      "score": 0.14901356399059296, 
      "sent": "\"Women do a lot at Westboro now, as they always have,\" he said."
    }, 
    {
      "index": 438, 
      "score": 0.14898073673248291, 
      "sent": "\"He was not a good person, according to the church,\" she said."
    }, 
    {
      "index": 618, 
      "score": 0.1488683819770813, 
      "sent": "\"They were amazing and super-kind,\" Phelps-Roper said."
    }, 
    {
      "index": 385, 
      "score": 0.14871931076049805, 
      "sent": "She had heard all these arguments before, but they had never affected her as they did when C.G."
    }, 
    {
      "index": 633, 
      "score": 0.14861957728862762, 
      "sent": "It was sunny and warm for a winter day in Kansas."
    }, 
    {
      "index": 276, 
      "score": 0.14811632037162781, 
      "sent": "She became adept at deflecting critics with a wry joke."
    }, 
    {
      "index": 630, 
      "score": 0.14803139865398407, 
      "sent": "\"As undeniable as they had seemed before, they seemed just as impossible now,\" she said."
    }, 
    {
      "index": 638, 
      "score": 0.14785069227218628, 
      "sent": "\"It's hard to even describe how weird it was,\" she told me."
    }, 
    {
      "index": 302, 
      "score": 0.14782670140266418, 
      "sent": "\"Each of us was really surrounded,\" Phelps-Roper said."
    }, 
    {
      "index": 640, 
      "score": 0.14776326715946198, 
      "sent": "\"I was quite a bit like a teen-ager."
    }, 
    {
      "index": 247, 
      "score": 0.14767821133136749, 
      "sent": "\"I wanted to be like really nice so that they would have a hard time hating me,\" he said."
    }, 
    {
      "index": 406, 
      "score": 0.14762125909328461, 
      "sent": "\"Hipster shit,\" Phelps-Roper said."
    }, 
    {
      "index": 77, 
      "score": 0.14761902391910553, 
      "sent": "\"We would always say, They have nothing to offer us,\" Phelps-Roper said."
    }, 
    {
      "index": 87, 
      "score": 0.14729729294776917, 
      "sent": "\"We did lots of fun normal-kids stuff,\" Megan said."
    }, 
    {
      "index": 204, 
      "score": 0.14705678820610046, 
      "sent": "list of influential Jews and saw that No."
    }, 
    {
      "index": 203, 
      "score": 0.14703162014484406, 
      "sent": "She looked at the J.T.A."
    }, 
    {
      "index": 660, 
      "score": 0.14692063629627228, 
      "sent": "The crew quickly disappeared into a house."
    }, 
    {
      "index": 632, 
      "score": 0.1468818336725235, 
      "sent": "We parked a few blocks from the church and walked down a quiet street lined with ranch-style homes."
    }, 
    {
      "index": 415, 
      "score": 0.14679244160652161, 
      "sent": "As young children, Grace and Megan had squabbled constantly, but they had grown close."
    }, 
    {
      "index": 131, 
      "score": 0.14672777056694031, 
      "sent": "and \"And God Over-Threw Sodom.\""
    }, 
    {
      "index": 258, 
      "score": 0.14669612050056458, 
      "sent": "(The following March, she and other Westboro members travelled to New York City to protest what they described in a press release as \"FDNY fags and terrorists.\")"
    }, 
    {
      "index": 446, 
      "score": 0.14658653736114502, 
      "sent": "It had started in April, 2011."
    }, 
    {
      "index": 574, 
      "score": 0.14633660018444061, 
      "sent": "For a while, they all planned to leave together."
    }, 
    {
      "index": 349, 
      "score": 0.14585669338703156, 
      "sent": "\"That explosion of activity, it was insane,\" she said."
    }, 
    {
      "index": 644, 
      "score": 0.1457410454750061, 
      "sent": "When we reached the Block, we walked along the privacy fence."
    }, 
    {
      "index": 592, 
      "score": 0.14551578462123871, 
      "sent": "That night, they cried themselves to sleep on couches in his basement."
    }, 
    {
      "index": 619, 
      "score": 0.14507922530174255, 
      "sent": "Abitbol joked about the dramatic role reversal: \" 'Your Rabbi Is a Whore'?"
    }, 
    {
      "index": 418, 
      "score": 0.14501190185546875, 
      "sent": "But soon after Megan started talking to C.G."
    }, 
    {
      "index": 524, 
      "score": 0.144857257604599, 
      "sent": "\"It was, like, just the fact that I thought about it, I had to leave right then,\" she said."
    }, 
    {
      "index": 249, 
      "score": 0.14485123753547668, 
      "sent": "\"You know, for an evil something something, you sure do crack me up,\" Abitbol responded."
    }, 
    {
      "index": 643, 
      "score": 0.14483371376991272, 
      "sent": "connected as strongly in person as they had online, and they now live together."
    }, 
    {
      "index": 532, 
      "score": 0.14477460086345673, 
      "sent": "\"It was like flipping a switch,\" she said."
    }, 
    {
      "index": 216, 
      "score": 0.1445717066526413, 
      "sent": "\"That's handy what with Yom Kippur coming up!\""
    }, 
    {
      "index": 100, 
      "score": 0.14456988871097565, 
      "sent": "\"She was just happy in general,\" her cousin Libby Phelps, one of Megan's close friends, told me."
    }, 
    {
      "index": 554, 
      "score": 0.14447310566902161, 
      "sent": "\"We would just have to find somewhere else, other people to love and care about and help, too.\""
    }, 
    {
      "index": 117, 
      "score": 0.14403770864009857, 
      "sent": "Sometimes, she told me, \"it went too far, for sure.\""
    }, 
    {
      "index": 539, 
      "score": 0.14395390450954437, 
      "sent": "She added, \"Does it really make you happy when you hear about people dying or starving or being maimed?"
    }, 
    {
      "index": 525, 
      "score": 0.14392857253551483, 
      "sent": "\"I felt like I was going to jump out of my skin.\""
    }, 
    {
      "index": 303, 
      "score": 0.1438106894493103, 
      "sent": "\"Two really old women came up behind me and started whispering the filthiest stuff I'd ever heard.\""
    }, 
    {
      "index": 479, 
      "score": 0.14319701492786407, 
      "sent": "Phelps-Roper's confusion soon turned to outrage."
    }, 
    {
      "index": 513, 
      "score": 0.14299662411212921, 
      "sent": "\"We lifted her burden,\" he said."
    }, 
    {
      "index": 543, 
      "score": 0.14292001724243164, 
      "sent": "When I'm not scared of the answer, I know the answer is no.\""
    }, 
    {
      "index": 309, 
      "score": 0.14283441007137299, 
      "sent": "The question embarrassed Phelps-Roper--\"I didn't want to talk about it because, ugh\"--but it did strike her as an interesting point."
    }, 
    {
      "index": 398, 
      "score": 0.14277489483356476, 
      "sent": "\"God is longsuffering and patient, but he repays the wicked TO THEIR FACE!\""
    }, 
    {
      "index": 175, 
      "score": 0.14247643947601318, 
      "sent": "\"This is right.\""
    }, 
    {
      "index": 358, 
      "score": 0.14228804409503937, 
      "sent": "Phelps-Roper said, \"It made me scared for myself that I wanted that."
    }, 
    {
      "index": 304, 
      "score": 0.14143224060535431, 
      "sent": "She recognized Abitbol from his Twitter avatar."
    }, 
    {
      "index": 22, 
      "score": 0.14142532646656036, 
      "sent": "and a description of a picket that the church held at an American Idol concert in Kansas City (\"Totally awesome!"
    }, 
    {
      "index": 550, 
      "score": 0.14134852588176727, 
      "sent": "But we are human & humans die."
    }, 
    {
      "index": 98, 
      "score": 0.14118596911430359, 
      "sent": "But, he added, she could be remarkably tender when dispensing advice or compliments."
    }, 
    {
      "index": 474, 
      "score": 0.14087012410163879, 
      "sent": "Phelps-Roper had to wear high-necked shirts and dresses or shorts that covered her knees."
    }, 
    {
      "index": 486, 
      "score": 0.14063960313796997, 
      "sent": "She resented the increasing authority wielded by Drain."
    }, 
    {
      "index": 523, 
      "score": 0.14041751623153687, 
      "sent": "What if she was spending her one life hurting people, picking fights with the entire world, for nothing?"
    }, 
    {
      "index": 563, 
      "score": 0.14035484194755554, 
      "sent": "\"I couldn't bring myself to do the things we were doing and say the things we were saying.\""
    }, 
    {
      "index": 124, 
      "score": 0.14033620059490204, 
      "sent": "I wanted to go to Heaven.\""
    }, 
    {
      "index": 128, 
      "score": 0.14028081297874451, 
      "sent": "The church sought redress from city officials, to no avail, so throughout the summer church members, including Megan, protested every day, walking in a circle while holding signs with messages written in permanent marker such as \"Warning!"
    }, 
    {
      "index": 606, 
      "score": 0.14022135734558105, 
      "sent": "\"Hi,\" she wrote."
    }, 
    {
      "index": 531, 
      "score": 0.14019303023815155, 
      "sent": "But she plunged into a profound crisis of faith."
    }, 
    {
      "index": 607, 
      "score": 0.13983555138111115, 
      "sent": "Tweets of encouragement and praise poured in."
    }, 
    {
      "index": 139, 
      "score": 0.13975933194160461, 
      "sent": "Phelps-Roper enjoyed picketing."
    }, 
    {
      "index": 122, 
      "score": 0.13948114216327667, 
      "sent": "\"I wanted to do everything right,\" she said."
    }, 
    {
      "index": 646, 
      "score": 0.13926282525062561, 
      "sent": "We passed the Phelps-Roper house and came to an intersection."
    }, 
    {
      "index": 156, 
      "score": 0.13889171183109283, 
      "sent": "\"We love these fags more than anyone,\" she would say."
    }, 
    {
      "index": 659, 
      "score": 0.13814045488834381, 
      "sent": "The sisters said nothing to Drain."
    }, 
    {
      "index": 585, 
      "score": 0.13805808126926422, 
      "sent": "As the sisters packed, their younger brother Zach sat at the piano downstairs, crying and playing hymns, which he hoped might change their mind."
    }, 
    {
      "index": 599, 
      "score": 0.13795806467533112, 
      "sent": "\"We were a mess, crying all the time,\" she said."
    }, 
    {
      "index": 540, 
      "score": 0.13768140971660614, 
      "sent": "Do you really want to ask God to hurt people?"
    }, 
    {
      "index": 567, 
      "score": 0.13763056695461273, 
      "sent": "\"It's not about being tired, it's about not believing in it anymore."
    }, 
    {
      "index": 583, 
      "score": 0.13760049641132355, 
      "sent": "\"I want you and everyone else to leave with me,\" Grace replied."
    }, 
    {
      "index": 68, 
      "score": 0.13758441805839539, 
      "sent": "\"He would say things like 'These guys are slobbering around on each other and sucking on each other,' \" Megan said."
    }, 
    {
      "index": 568, 
      "score": 0.13739077746868134, 
      "sent": "If I believed it, I could do it forever.\""
    }, 
    {
      "index": 625, 
      "score": 0.13716854155063629, 
      "sent": "\"Like, oh, my gosh, I can't believe I'm here.\""
    }, 
    {
      "index": 277, 
      "score": 0.1371045857667923, 
      "sent": "\"So, when do you drink the Kool-aid?\""
    }, 
    {
      "index": 683, 
      "score": 0.13705259561538696, 
      "sent": "\"   Sign up for the daily newsletter."
    }, 
    {
      "index": 555, 
      "score": 0.13658073544502258, 
      "sent": "Grace wrote back, \"I don't want other people.\""
    }, 
    {
      "index": 626, 
      "score": 0.1361183375120163, 
      "sent": "She and Grace ended up dancing onstage during the intermission."
    }, 
    {
      "index": 566, 
      "score": 0.13597247004508972, 
      "sent": "\"I honestly replied no,\" she wrote in her journal."
    }, 
    {
      "index": 535, 
      "score": 0.13590985536575317, 
      "sent": "When they were apart, Megan detailed her doubts in text messages."
    }, 
    {
      "index": 497, 
      "score": 0.13569952547550201, 
      "sent": "\"I hate it so much.\""
    }, 
    {
      "index": 377, 
      "score": 0.13532926142215729, 
      "sent": "Like David Abitbol, C.G."
    }, 
    {
      "index": 426, 
      "score": 0.13479092717170715, 
      "sent": "\"I was terrified of even thinking about guys,\" she said."
    }, 
    {
      "index": 295, 
      "score": 0.13477915525436401, 
      "sent": "\"I was beginning to see them as human,\" she said."
    }, 
    {
      "index": 270, 
      "score": 0.13471423089504242, 
      "sent": "She signed off, \"Have a lovely day."
    }, 
    {
      "index": 214, 
      "score": 0.13448575139045715, 
      "sent": "\"Thanks Megan!\""
    }, 
    {
      "index": 588, 
      "score": 0.13423871994018555, 
      "sent": "Her parents told her to say goodbye to her grandfather."
    }, 
    {
      "index": 650, 
      "score": 0.1339665949344635, 
      "sent": "Steve Drain, a large bearded man, trailed behind."
    }, 
    {
      "index": 484, 
      "score": 0.13395538926124573, 
      "sent": "(Drain recalls no objections, and said, \"Everything was done decently and in accordance with Scripture.\")"
    }, 
    {
      "index": 515, 
      "score": 0.13393966853618622, 
      "sent": "(Through Drain, Megan's parents declined to comment.)"
    }, 
    {
      "index": 649, 
      "score": 0.13349160552024841, 
      "sent": "First came five of their young cousins, followed by two of their brothers, Sam and Noah."
    }, 
    {
      "index": 223, 
      "score": 0.13343161344528198, 
      "sent": "\"Dead rote rituals?\""
    }, 
    {
      "index": 41, 
      "score": 0.13342079520225525, 
      "sent": "\"Your followers are just nasty haters of God!"
    }, 
    {
      "index": 6, 
      "score": 0.13338187336921692, 
      "sent": "#red.\""
    }, 
    {
      "index": 519, 
      "score": 0.13267238438129425, 
      "sent": "had recommended--played on the stereo."
    }, 
    {
      "index": 96, 
      "score": 0.13237552344799042, 
      "sent": "Other young Westboro members regarded Shirley with a mixture of fear and respect."
    }, 
    {
      "index": 440, 
      "score": 0.13202047348022461, 
      "sent": "That day, she told C.G."
    }, 
    {
      "index": 569, 
      "score": 0.1319795548915863, 
      "sent": "In October, Megan finally persuaded Grace to leave."
    }, 
    {
      "index": 648, 
      "score": 0.13190358877182007, 
      "sent": "\"I can't tell yet, but it sure looks like a group of brothers and cousins,\" Megan said."
    }, 
    {
      "index": 624, 
      "score": 0.13187672197818756, 
      "sent": "\"It felt illicit,\" she said."
    }, 
    {
      "index": 99, 
      "score": 0.13118347525596619, 
      "sent": "Megan lacked Shirley's hard edge."
    }, 
    {
      "index": 95, 
      "score": 0.13087059557437897, 
      "sent": "\"I felt like I could ask her anything about anything,\" Megan told me."
    }, 
    {
      "index": 287, 
      "score": 0.13086868822574615, 
      "sent": "Afterward, they corresponded frequently on Twitter."
    }, 
    {
      "index": 430, 
      "score": 0.13002750277519226, 
      "sent": "\"I was in denial,\" she said."
    }, 
    {
      "index": 584, 
      "score": 0.12963467836380005, 
      "sent": "Their parents were stunned, but they didn't try to force the sisters to stay."
    }, 
    {
      "index": 528, 
      "score": 0.12924998998641968, 
      "sent": "\"It just sounded ridiculous to even suggest it,\" Grace told me."
    }, 
    {
      "index": 32, 
      "score": 0.12921142578125, 
      "sent": "Let her feel your love.\""
    }, 
    {
      "index": 435, 
      "score": 0.12857885658740997, 
      "sent": "She knew her family could see them on the surveillance cameras that line the Block, but she didn't care."
    }, 
    {
      "index": 278, 
      "score": 0.12724898755550385, 
      "sent": "one user tweeted at her."
    }, 
    {
      "index": 492, 
      "score": 0.12695109844207764, 
      "sent": "(Drain told me that the fake picket was never meant to be taken literally.)"
    }, 
    {
      "index": 450, 
      "score": 0.12656013667583466, 
      "sent": "Reading the e-mail made her sick with fear."
    }, 
    {
      "index": 413, 
      "score": 0.12631754577159882, 
      "sent": "\"It annoyed me, because it wasn't coming from Megan."
    }, 
    {
      "index": 373, 
      "score": 0.12606769800186157, 
      "sent": "But C.G."
    }, 
    {
      "index": 42, 
      "score": 0.12578573822975159, 
      "sent": "You should do something about that ."
    }, 
    {
      "index": 186, 
      "score": 0.12554854154586792, 
      "sent": "(Revelation says that a hundred and forty-four thousand \"children of Israel\" are \"redeemed from among men.\")"
    }, 
    {
      "index": 279, 
      "score": 0.12554468214511871, 
      "sent": "\"More of a Sunkist lemonade drinker, myself."
    }, 
    {
      "index": 522, 
      "score": 0.12533201277256012, 
      "sent": "She suddenly thought, What if Westboro had been wrong about everything?"
    }, 
    {
      "index": 666, 
      "score": 0.12522640824317932, 
      "sent": "Directly across the street stood a house painted in bright, horizontal rainbow stripes."
    }, 
    {
      "index": 530, 
      "score": 0.12496913224458694, 
      "sent": "Megan, still uncertain, agreed."
    }, 
    {
      "index": 432, 
      "score": 0.12482019513845444, 
      "sent": "A black car with tinted windows pulled up, and a tall, blond man got out."
    }, 
    {
      "index": 433, 
      "score": 0.12480252981185913, 
      "sent": "She couldn't see his face, but she knew it was C.G."
    }, 
    {
      "index": 551, 
      "score": 0.12449138611555099, 
      "sent": "What would we have if we didn't have each other?\""
    }, 
    {
      "index": 656, 
      "score": 0.12421902269124985, 
      "sent": "\"Hi, how are you?\""
    }, 
    {
      "index": 560, 
      "score": 0.12387979030609131, 
      "sent": "\"You literally feel insane,\" she said."
    }, 
    {
      "index": 242, 
      "score": 0.12332461774349213, 
      "sent": "Yet she found him funny and engaging."
    }, 
    {
      "index": 442, 
      "score": 0.1220133900642395, 
      "sent": "She deleted her Words with Friends account."
    }, 
    {
      "index": 387, 
      "score": 0.12157879024744034, 
      "sent": "\"I just really liked him,\" she said."
    }, 
    {
      "index": 461, 
      "score": 0.12137105315923691, 
      "sent": "\"We don't air our dirty laundry,\" he said.)"
    }, 
    {
      "index": 360, 
      "score": 0.12104012072086334, 
      "sent": "\" Another online relationship proved more threatening."
    }, 
    {
      "index": 381, 
      "score": 0.12099733948707581, 
      "sent": "C.G."
    }, 
    {
      "index": 655, 
      "score": 0.12096718698740005, 
      "sent": "Sam nodded and gave a terse smile and a small wave."
    }, 
    {
      "index": 271, 
      "score": 0.12087632715702057, 
      "sent": "You're going to Hell.\""
    }, 
    {
      "index": 21, 
      "score": 0.12044636905193329, 
      "sent": "Ted's in hell!\")"
    }, 
    {
      "index": 257, 
      "score": 0.12033507227897644, 
      "sent": "She couldn't wait to picket Ground Zero."
    }, 
    {
      "index": 562, 
      "score": 0.11993516981601715, 
      "sent": "\"I just couldn't keep up the charade,\" she said."
    }, 
    {
      "index": 147, 
      "score": 0.11932374536991119, 
      "sent": "She laughed and sang and smiled in the face of angry crowds."
    }, 
    {
      "index": 653, 
      "score": 0.11917129158973694, 
      "sent": "The group passed us without stopping."
    }, 
    {
      "index": 680, 
      "score": 0.11860696971416473, 
      "sent": "(The church denies these claims.)"
    }, 
    {
      "index": 421, 
      "score": 0.11825907230377197, 
      "sent": "What are you hiding?\""
    }, 
    {
      "index": 107, 
      "score": 0.11802753806114197, 
      "sent": "She would sum up the Bible in three words: \"Obey."
    }, 
    {
      "index": 393, 
      "score": 0.11734414100646973, 
      "sent": "She burst into tears at her desk."
    }, 
    {
      "index": 546, 
      "score": 0.11705856770277023, 
      "sent": "Grace replied, \"But what if?\""
    }, 
    {
      "index": 549, 
      "score": 0.11705463379621506, 
      "sent": "Without that we'd only have our belief in each other."
    }, 
    {
      "index": 580, 
      "score": 0.11701039224863052, 
      "sent": "Their mother tried to calm things down."
    }, 
    {
      "index": 548, 
      "score": 0.11648834496736526, 
      "sent": "Like, pain & sorrow, I mean."
    }, 
    {
      "index": 225, 
      "score": 0.11617334932088852, 
      "sent": "\"U mean like holding up God Hates Shrimp, err I mean Fag signs up?"
    }, 
    {
      "index": 409, 
      "score": 0.11611819267272949, 
      "sent": "After C.G."
    }, 
    {
      "index": 642, 
      "score": 0.11554831266403198, 
      "sent": "She and C.G."
    }, 
    {
      "index": 359, 
      "score": 0.11554805934429169, 
      "sent": "And so I was, like, 'O.K., you gotta step back.'"
    }, 
    {
      "index": 434, 
      "score": 0.11529208719730377, 
      "sent": "She walked up to him, and they embraced."
    }, 
    {
      "index": 79, 
      "score": 0.11506536602973938, 
      "sent": "Dating was out of the question."
    }, 
    {
      "index": 419, 
      "score": 0.11457628011703491, 
      "sent": "she stopped letting Grace look at her phone."
    }, 
    {
      "index": 256, 
      "score": 0.1131364032626152, 
      "sent": "she exclaimed, to the horror of a student next to her."
    }, 
    {
      "index": 420, 
      "score": 0.11276818811893463, 
      "sent": "\"I remember thinking, What the heck?"
    }, 
    {
      "index": 280, 
      "score": 0.11114510148763657, 
      "sent": "=)\" she replied."
    }, 
    {
      "index": 45, 
      "score": 0.1091698631644249, 
      "sent": "like tell them some truth every once in a while."
    }, 
    {
      "index": 443, 
      "score": 0.10906174033880234, 
      "sent": "C.G."
    }, 
    {
      "index": 647, 
      "score": 0.10901125520467758, 
      "sent": "A group of men and boys came toward us."
    }, 
    {
      "index": 218, 
      "score": 0.10887195914983749, 
      "sent": "\"Oh & @jewlicious?"
    }, 
    {
      "index": 78, 
      "score": 0.10848071426153183, 
      "sent": "She never went to dances."
    }, 
    {
      "index": 542, 
      "score": 0.10842495411634445, 
      "sent": "I think the answer is no."
    }, 
    {
      "index": 255, 
      "score": 0.10809802263975143, 
      "sent": "\"Awesome!\""
    }, 
    {
      "index": 171, 
      "score": 0.10809582471847534, 
      "sent": "Like 'How could you possibly do this?'"
    }, 
    {
      "index": 402, 
      "score": 0.10809516906738281, 
      "sent": "often drifted away from morality."
    }, 
    {
      "index": 437, 
      "score": 0.10682174563407898, 
      "sent": "She woke up fighting back tears."
    }, 
    {
      "index": 441, 
      "score": 0.10640164464712143, 
      "sent": "that they couldn't talk anymore."
    }, 
    {
      "index": 654, 
      "score": 0.10629978775978088, 
      "sent": "Grace called out, \"Hi!\""
    }, 
    {
      "index": 669, 
      "score": 0.10621465742588043, 
      "sent": "activists."
    }, 
    {
      "index": 665, 
      "score": 0.10564233362674713, 
      "sent": "JUDE 7.\""
    }, 
    {
      "index": 527, 
      "score": 0.1053144782781601, 
      "sent": "Grace was horrified."
    }, 
    {
      "index": 447, 
      "score": 0.10496192425489426, 
      "sent": "Her mother seemed mysteriously troubled."
    }, 
    {
      "index": 561, 
      "score": 0.10428071767091751, 
      "sent": "Eventually, her doubts won out."
    }, 
    {
      "index": 374, 
      "score": 0.10417443513870239, 
      "sent": "remained a mystery."
    }, 
    {
      "index": 129, 
      "score": 0.10157545655965805, 
      "sent": "Gays in the Bushes!"
    }, 
    {
      "index": 403, 
      "score": 0.10031133890151978, 
      "sent": "C.G."
    }, 
    {
      "index": 541, 
      "score": 0.10013299435377121, 
      "sent": "I ask myself these questions."
    }, 
    {
      "index": 130, 
      "score": 0.099143549799919128, 
      "sent": "Watch Your Children!\""
    }, 
    {
      "index": 172, 
      "score": 0.098076097667217255, 
      "sent": "\" Phelps-Roper said."
    }, 
    {
      "index": 613, 
      "score": 0.096296101808547974, 
      "sent": "Fuck that.'"
    }, 
    {
      "index": 285, 
      "score": 0.09568902850151062, 
      "sent": "Graham Hughes said."
    }, 
    {
      "index": 159, 
      "score": 0.095631703734397888, 
      "sent": "Fred Phelps would say."
    }, 
    {
      "index": 215, 
      "score": 0.093391045928001404, 
      "sent": "he responded."
    }, 
    {
      "index": 657, 
      "score": 0.092931307852268219, 
      "sent": "he said."
    }, 
    {
      "index": 342, 
      "score": 0.092892169952392578, 
      "sent": "\"Thanks, Anonymous!"
    }, 
    {
      "index": 651, 
      "score": 0.091722056269645691, 
      "sent": "They carried tools."
    }, 
    {
      "index": 404, 
      "score": 0.091095149517059326, 
      "sent": "liked indie rock and literary fiction."
    }, 
    {
      "index": 444, 
      "score": 0.089137710630893707, 
      "sent": "deleted his Twitter account."
    }, 
    {
      "index": 224, 
      "score": 0.084864318370819092, 
      "sent": "he responded."
    }, 
    {
      "index": 109, 
      "score": 0.084199286997318268, 
      "sent": "Obey.\""
    }, 
    {
      "index": 422, 
      "score": 0.08304162323474884, 
      "sent": "Grace said."
    }, 
    {
      "index": 397, 
      "score": 0.081704370677471161, 
      "sent": "she wrote."
    }, 
    {
      "index": 386, 
      "score": 0.079781033098697662, 
      "sent": "made them."
    }, 
    {
      "index": 212, 
      "score": 0.073503889143466949, 
      "sent": "Ma says 'Repentant Jew!'"
    }, 
    {
      "index": 221, 
      "score": 0.070619761943817139, 
      "sent": "Rev."
    }, 
    {
      "index": 108, 
      "score": 0.070066578686237335, 
      "sent": "Obey."
    }, 
    {
      "index": 210, 
      "score": 0.068971045315265656, 
      "sent": "."
    }, 
    {
      "index": 43, 
      "score": 0.065097332000732422, 
      "sent": "."
    }, 
    {
      "index": 44, 
      "score": 0.05457005649805069, 
      "sent": "."
    }, 
    {
      "index": 211, 
      "score": 0.046381533145904541, 
      "sent": ".'"
    }
  ], 
  "title": null
}