{"site_name": "Medium", "description": "I’m 41, Single and Pregnant. Welcome to the New Normal. Hello, I’m Rachel. I’m 41, single and pregnant. Taken together, these three elements tend to act as sad little modifiers for each other. “Single” is usually applied to women as though they are a problem to be fixed. “41” is usually past the age when people consider your problem fixable (let’s just say the concerned clucking about when I would get married and have kids ended abruptly at 40). “Pregnant” — well, everyone seems to have ideas about what women ought to be doing with their uteri. Some of you may even feel sorry for me, all alone with no husband to rub my feet. (This is a pregnancy book staple, I am discovering.) I know how it looks: at 41, single and pregnant, I’m a sad, lonely outlier. But it’s 2014. I’m not. Actually, I’ve discovered that I am living a whole new reality for women — that is to say, approaching and experiencing motherhood from outside the narrow bounds of the default, traditional model. You know that model — boy meets girl (the girl is always met, after all!), boy marries girl, boy impregnates girl, smiling happy family ensues. But sometimes boy meets boy, and girl meets girl. Sometimes boy and girl meet, marry, and struggle with that third part — maybe boy has a low sperm count, or girl has uterine fibroids. Sometimes there are basal thermometers and blood tests and injections and ultrasounds and many visits", "videos": [], "images": ["https://cdn-images-1.medium.com/fit/c/60/60/0*Mx5a_Ut8QUPjQ_Kx.png", "https://cdn-images-1.medium.com/fit/c/60/60/1*DhuPyTtB2Lww3fPJwN5m3g.jpeg", "https://cdn-images-1.medium.com/fit/c/40/40/0*Mx5a_Ut8QUPjQ_Kx.png"], "words": 1565, "date": 1414540800.0, "title": "I’m 41, Single and Pregnant. — TheLi.st @ Medium", "url": "https://medium.com/thelist/im-41-single-and-pregnant-9b2da840a45a", "is_rtl": false, "author": "Rachel Sklar", "html": "<main><section><div><div><div><div><div><div><h2>I’m 41, Single and Pregnant.</h2><h4>Welcome to the New Normal.</h4></div></div></div></div></div></div></section><section><div><div><p>Hello, I’m Rachel. I’m 41, single and pregnant.</p><p>Taken together, these three elements tend to act as sad little modifiers for each other. “Single” is usually applied to women as though they are a problem to be fixed. “41” is usually past the age when people consider your problem fixable (let’s just say the concerned clucking about when I would get married and have kids ended abruptly at 40). “Pregnant” — well, everyone seems to have ideas about what women ought to be doing with their uteri. Some of you may even feel sorry for me, all alone with no husband to rub my feet. (This is a pregnancy book staple, I am discovering.) I know how it looks: at 41, single and pregnant, I’m a sad, lonely outlier.</p><p>But it’s 2014. I’m not.</p><p>Actually, I’ve discovered that I am living a whole new reality for women — that is to say, approaching and experiencing motherhood from outside the narrow bounds of the default, traditional model.</p><p>You know that model — boy meets girl (the girl is always met, after all!), boy marries girl, boy impregnates girl, smiling happy family ensues.</p><p>But sometimes boy meets boy, and girl meets girl. Sometimes boy and girl meet, marry, and struggle with that third part — maybe boy has a low sperm count, or girl has uterine fibroids. Sometimes there are basal thermometers and blood tests and injections and ultrasounds and <a href=\"https://medium.com/theli-st-medium/the-saddest-room-on-earth-cb2249250830\">many visits to the doctor</a>. Sometimes girl meets a bunch of different boys and none of them quite take. Sometimes girl says, fuck it, I’ll do it on my own.</p><p>And sometimes, at 41, after lots of great relationships and some less-great relationships and optimistic plans to explore fertility treatments, girl gets unexpectedly knocked up.</p><p>That’s what happened to me. I had a lovely summer romance, and got pregnant. The relationship ended, the pregnancy did not. And so, here I am — 41, single and pregnant. Woohoo, I have it all!</p><p>I’m now in my second trimester and luckily, all is well so far. I’ve started telling friends. They’ve started telling friends. And I’ve realized just how many non-traditional parents I know.</p><p>There’s the friend who has been jumping through the complex hoops of surrogacy across three states and counting. There’s the friend who ordered up a sperm donor and happily did it on her own.</p><p>There’s the friend who is carrying her wife’s fertilized egg, and the friend whose job it was to inject her wife with donor sperm.</p><p>There’s the single friend who took advantage of her company’s corporate egg-freezing benefit because she’s in her mid-30s and hopes to someday have kids, and the married friend who did it because she’s in her mid-30s and isn’t sure yet. There are the friends with kids in their 20s, 30s, and IVF-assisted 40s. There are the friends who adopt, and there are the friends who don’t want kids at all.</p><p>(I also have friends who met, married, and reproduced. They’re great, too.)</p><p>All this, as it turns out, is not unusual. Certainly not single mothers, whose birth rates have been <a href=\"http://blogs.reuters.com/great-debate/2013/03/25/same-sex-marriage-does-not-threaten-birth-rates-or-child-rearing/\">increasing steadily for decades</a>, particularly <a href=\"http://www.census.gov/prod/2013pubs/acs-21.pdf\">over the past decade</a>. They account for <a href=\"http://www.npr.org/2014/09/30/352661280/marriage-pattern-shifts-seen-by-some-as-destabilizing-society\">over half of first births</a> in the United States and approximately <a href=\"https://singlemotherguide.com/single-mother-statistics/#identifier_0_13\">40% of all newborns</a>.</p><p>Not older mothers, since both the average age for <a href=\"http://www.pewsocialtrends.org/2010/05/06/the-new-demography-of-american-motherhood/\">childbirth</a> and <a href=\"http://www.npr.org/2014/09/30/352661280/marriage-pattern-shifts-seen-by-some-as-destabilizing-society?utm_source=tumblr.com&amp;utm_medium=social&amp;utm_campaign=npr&amp;utm_term=nprnews&amp;utm_content=20140930\">marriage</a> is increasing. <a href=\"http://www.cdc.gov/nchs/data/nvsr/nvsr62/nvsr62_09.pdf\">According to the CDC</a>, in 2012, the birthrate decreased for women in their 20s but increased for women aged 30-44, and the average age of a woman at her first birth increased. We know <a href=\"http://www.babycenter.com/0_age-and-fertility-getting-pregnant-in-your-40s_1494699.bc\">fertility declines as a woman ages</a>, but thanks to evolving technologies, later pregnancies are <a href=\"http://parenting.blogs.nytimes.com/2012/06/20/pregnancy-rates-rise-for-women-over-40/?_php=true&amp;_type=blogs&amp;_r=0\">much more common</a>. (I am officially what is called a “<a href=\"http://www.mayoclinic.org/healthy-living/pregnancy-week-by-week/in-depth/high-risk-pregnancy/art-20047012\">high-risk pregnancy</a>” but at my doctor’s office no one seems to find me that remarkable, which is immensely comforting.) Not everyone who tries later in life will be able to get pregnant. But the <a href=\"https://www.yahoo.com/health/6-ways-to-boost-your-odds-of-ivf-success-96727458312.html\">trends</a> are <a href=\"http://www.dailymail.co.uk/femail/article-2598140/IVF-treatment-single-women-DOUBLES-search-Mr-Right-instead.html\">showing</a> that more women will try, and more of those tries will have a better chance of success.</p><p>(Three points on technology feeding into this trend: (1) demand for reproductive technologies is clearly on the rise; (2) at this point it is <a href=\"http://www.gayivf.com/family-building-for-gay-men/financial-considerations.cfm\">quite expensive</a>; (3) both those things should incentivize entry into the marketplace, which will increase access and, eventually, bring down costs. There’s no denying that right now, fertility options are really only options for the affluent.)</p><p>The cost of pursuing fertility treatments was my biggest obstacle last year as I tried to figure out the best course of action. Obamacare doesn’t explicitly cover it, though <a href=\"http://www.boston.com/lifestyle/health/pregnancy/2013/10/reproductive_services_under_obamacare_5_things_you_should_know.html\">some states do so electively</a>, and <a href=\"http://www.resolve.org/get-involved/the-center-for-infertility-justice/public-policy/the-affordable-care-act-and-infertility.html\">selectively</a>. Once a woman starts, taking time off work to undergo those treatments can be <a href=\"http://ced.blr.com/2008/07/family-and-medical-leave-can-an-employee-use-intermittent-fmla-leave-for-fertility-treatments/#\">complicated</a>. Then, if God willing it all works out, there’s the whole issue of what happens after the baby is born. If you don’t have a great employer with a great maternity plan, taking time off from work <a href=\"http://the-toast.net/2014/10/27/employer-put-fml-fmla/\">can also be challenging</a>. As an expectant mom who is currently self-employed, I’m amazed at just how tied to the workplace maternity benefits are. And then, of course, <a href=\"http://en.wikipedia.org/wiki/Motherhood_penalty#cite_note-BudigEngland-1\">there’s the motherhood penalty</a>. The New Normal, such as it is, is definitely not without its bumps and bruises — on the one hand, there are the affluent parents who can, at least, afford all this, and on the other there are the 12 million <a href=\"https://singlemotherguide.com/single-mother-statistics/#identifier_0_13\">single-parent families</a> in the U.S., 80% of which are led by single mothers.</p><p>I’m lucky — all this is happening for me during a moment of unprecedented transparency around parenthood, fertility and the rainbow of possible options therefor. Odds are I won’t be the only single woman in my eventual birthing class (and if I am, one of my best girlfriends volunteered to come with me to help me figure out how to breathe and when to push). And while I can’t click on a pregnancy-related link or open a pregnancy book without being informed of what my assumed “partner” should be doing, I also recognize that they are out of date, not me. (Never mind that the default pronoun there is usually “he.” Time for some new editions, publishers!)</p><p>But even acknowledging my luck — to get pregnant the old-fashioned way, to get pregnant at all — doesn’t mean everything is going to be perfect. That’s one of the biggest flaws in the so-called ‘debate’ over fertility options, like the <a href=\"http://www.newrepublic.com/article/119945/freak-out-over-birth-control\">recent kerfuffle</a> over companies offering coverage for egg-freezing — these are options, but no one said they were perfect options. But what is? Even a dewily-youthful zygote conceived inside a loving marriage has no guarantees, since 10–20% of known pregnancies <a href=\"http://www.babycenter.com/0_understanding-miscarriage_252.bc#articlesection1\">end in miscarriage</a> (and that stat is <a href=\"http://www.mayoclinic.org/diseases-conditions/pregnancy-loss-miscarriage/basics/definition/con-20033827\">probably higher</a> owing to the incidence of miscarriage very early on, before a woman might know she was pregnant).</p><p>This <a href=\"https://medium.com/theli-st-medium/in-due-time-60055938267b\">emphasis on pregnancy perfection</a> has led to a bizarre cone of silence around fertility challenges. It’s amazing that something common to so many women is shrouded in so much shame. There has until very recently been no real space for women to talk about experiencing <a href=\"http://modernloss.com/giving-voice-to-the-silent-sorrow/\">miscarriage</a>, <a href=\"https://medium.com/theli-st-medium/the-saddest-room-on-earth-cb2249250830\">IVF</a>, <a href=\"https://medium.com/theli-st-medium/rainy-with-a-chance-of-baby-infertility-ivf-and-cancer-71f05c72f780\">infertility</a>. Egg-freezing is still kept mum (and women are still <a href=\"http://time.com/3509930/company-paid-egg-freezing-will-be-the-great-equalizer/\">reluctant to go on the record</a> about it). And despite every newly-married couple being asked, “So, when are you having kids?” it’s still unusual for women to share that they’re trying, at least outside their closest circle.</p><p>For single women, admitting that you want kids when you’re still unattached can feel like exposing a vulnerability. It did to me. If someone said, “Don’t you want kids?” (when you hit a certain age, it’s usually framed like that). I’d say yes, but I would deflect more questions. I certainly didn’t share that I sometimes lay down on my bed and sobbed to realize that I was 40 years old and had probably missed the boat.</p><p>Now that I am pregnant — and showing — my body is a tell. There have been and will be perfectly innocent reactions, like “I didn’t know you were seeing someone!” (I’m not) and “Is the father involved?” (he’s not). It’s fine — I’m happy to be where I am and do not want what I haven’t got. (Random Sinead O’Connor reference, <a href=\"http://en.wikipedia.org/wiki/I_Do_Not_Want_What_I_Haven%27t_Got\">check</a>.)</p><p>What I do want is to be transparent about where I am and how I got here. I don’t like the cone of silence — it didn’t do me any favors in my 20s or 30s, and I don’t see it doing much for other women, either. In 2014, I see that changing, and I want to be part of it. We’re having a coming out moment about fertility, and, like the miracle sperm that somehow managed to fertilize my forty-something eggs, it’s just in time. In 2014, having children is complicated and daunting and fraught — as much as it’s always been, but now we’re talking about it. And the more we talk about it, the more of us will realize that we’re not going through it alone. Far from it.</p><p>I’m 41, single, and pregnant. It feels good.</p><p><em>Rachel Sklar is a </em><a href=\"http://changetheratio.tumblr.com/post/15087972070/rachelsklarbio\"><em>writer/entrepreneur</em></a><em> and founder of </em><a href=\"http://www.theli.st/\"><em>TheLi.st</em></a><em>. She writes frequently on issues relating to women, and now she has one more. The photo above is of her first sonogram.</em></p></div></div></section></main>", "thumbnail": "https://cdn-images-1.medium.com/max/800/1*Boo-ao5H-MWz87oGoZa6Hw.jpeg"}