{"site_name": "Ars Technica", "description": "Scientists have just discovered a bizarre pattern in global weather. Extreme heat waves like the one that hit the Eastern US in 2012 , leaving at least 82 dead, don't just come out of nowhere. A new study, published today in Nature Geoscience , reveals that heat waves arise in a predictable pattern roughly 40 to 50 days after an event called the Pacific Extreme Pattern. During a Pacific Extreme Pattern, a large area of the Pacific north of Hawaii experiences unusual temperatures both at the water's surface and far above it in the atmosphere. Specifically, the southern part of the region gets far hotter than is typical, and the northeastern part of the region gets much colder. These unusual temperature patterns create a wave of weather effects that sweep over most of the US, then stop over the humid inland eastern region, creating a high pressure zone that brings clear skies and oppressive heat. The effect is intensified if there has been little rain in the east as well. The researchers examined weather data from sensors in both the Pacific and throughout the Eastern US between 1982 to 2015, finding that the Pacific Extreme Pattern was a strong predictor of heat waves. When the pattern emerges, there is a 1 in 4 chance that the Eastern US will experience extreme heat in 50 days. There's a 1 in 2 chance that they'll experience it in 40 days. Given that the Eastern US has a high population as well as", "videos": [], "images": ["https://cdn.arstechnica.net/wp-content/uploads/2016/03/Pasted-image-at-2016_03_31-12_33-PM.png", "http://cdn.arstechnica.net/wp-content/uploads/2016/01/arshead.png", "http://cdn.arstechnica.net/wp-content/uploads/2016/03/whac-300x100.jpg", "https://cdn.arstechnica.net/i/https://dwgyu36up6iuz.cloudfront.net/heru80fdn/image/upload/c_fill,d_placeholder_thescene.jpg,fl_progressive,g_center,h_405,q_80,w_720/v1457558355/arstechnica_science-and-exploration-nasa-michoud-composite-development.jpg", "http://cdn.arstechnica.net/wp-content/uploads/2016/04/IMG_1798-150x150.jpg", "http://cdn.arstechnica.net/wp-content/uploads/2016/04/Screen-Shot-2016-04-04-at-9.56.47-AM-150x150.png", "http://cdn.arstechnica.net/wp-content/uploads/2015/03/IMG_3822-150x150.jpg", "http://cdn.arstechnica.net/wp-content/themes/arstechnica/assets/images/condenast-logo.png", "http://cdn.arstechnica.net/wp-content/themes/arstechnica/assets/images/ad_choices_arrow.png"], "words": 424, "date": 1459198200.0, "title": "The “Pacific Extreme Pattern” predicts heat waves up to 50 days in advance", "url": "http://arstechnica.com/science/2016/03/the-pacific-extreme-pattern-predicts-heat-waves-up-to-50-days-in-advance/", "is_rtl": false, "author": "Annalee Newitz", "html": "<div>\n    \n\n\n\n\n<p>Scientists have just discovered a bizarre pattern in global weather. Extreme heat waves like <a href=\"http://www.climatecentral.org/blogs/was-the-heat-wave-an-unprecedented-event\">the one that hit the Eastern US in 2012</a>, leaving at least 82 dead, don't just come out of nowhere. A new study, published today in <em>Nature Geoscience</em>, reveals that heat waves arise in a predictable pattern roughly 40 to 50 days after an event called the Pacific Extreme Pattern.</p>\n<p>During a Pacific Extreme Pattern, a large area of the Pacific north of Hawaii experiences unusual temperatures both at the water's surface and far above it in the atmosphere. Specifically, the southern part of the region gets far hotter than is typical, and the northeastern part of the region gets much colder. These unusual temperature patterns create a wave of weather effects that sweep over most of the US, then stop over the humid inland eastern region, creating a high pressure zone that brings clear skies and oppressive heat. The effect is intensified if there has been little rain in the east as well.</p>\n<p>The researchers examined weather data from sensors in both the Pacific and throughout the Eastern US between 1982 to 2015, finding that the Pacific Extreme Pattern was a strong predictor of heat waves. When the pattern emerges, there is a 1 in 4 chance that the Eastern US will experience extreme heat in 50 days. There's a 1 in 2 chance that they'll experience it in 40 days. Given that the Eastern US has a high population as well as many agricultural regions that are breadbaskets for the nation, this kind of long-range prediction could be lifesaving.</p>\n<p>What's remarkable about this study is that it might pave the way for other kinds of extreme weather prediction as well.</p>\n<p>Tornado forecasting researcher Victor Gensini, who was not involved in the study, <a href=\"http://www.sacbee.com/news/weather/article68605882.html\">told the Associated Press</a>:</p>\n<blockquote><p>The physical mechanisms underpinning the results of their study make sense. It is exciting that there is some skill demonstrated as far out as 50 days as this also gives us hope for linkages to other extreme weather events.</p></blockquote>\n<p>The authors of the study emphasize that the heat waves are a combination of heat in the Pacific with low rain in the east. They write, \"The results presented here link two previously identified precursors to hot days—precipitation deficits and an anomalous atmospheric wave train—with the occurrence of [Pacific Extreme Pattern].\" That's one train you don't want to be riding when summer comes. Now, at least, you may have seven weeks to prepare for it.</p>\n<p>Nature Geoscience, 2016. DOI: <a href=\"http://dx.doi.org/10.1038/ngeo2687\">10.1038/ngeo2687</a></p>\n\n\t\t</div>\n    ", "thumbnail": "http://cdn.arstechnica.net/wp-content/themes/arstechnica/assets/images/ars-logo-open-grey.png"}