{"site_name": "The Atlantic", "description": "An 1882 sketch of the railroad depot at Council Bluffs, Iowa British Library / Wikimedia Council Bluffs is a mid-sized town in Iowa, right on that state’s border with Nebraska. Although better known for cultivating presidential candidates than server racks, Iowa is a pretty popular site for data centers, especially new data centers built by major tech companies. Microsoft, Google, and Facebook have all built custom data centers in the state over the past seven years, and all three are expanding in the region. Many forces have come together to shape Iowa’s data-center industry (which will be discussed in further detail in another story), but it’s the state’s history as a junction for another major network—railroads—that put it at the top of my list for Cloud sightseeing. My favorite part of looking for network infrastructure in America is really all the ghosts. Networks tend to follow networks, and telecommunications and transportation networks tend to end up piled on top of each other. The histories of these places isn’t always immediately obvious, but it’s there, forming a kind of infrastructural palimpsest, with new technologies to annihilate space and time inheriting the idealized promise and the political messiness of their predecessors. Iowa is no exception. It’s pretty much impossible to talk about American Internet infrastructure without talking about railroads, and Iowa is a state rich with railroad history. We came to Council Bluffs because the Union Pacific railroad route for the first transcontinental railroad began in Council Bluffs, a starting point selected", "videos": [], "images": ["http://cdn.theatlantic.com/assets/media/img/issues/2016/03/14/0416_CoversanspgnoRGB/large.jpg", "http://cdn.theatlantic.com/assets/media/img/issues/2016/03/14/0416_CoversanspgnoRGB/large.jpg?1457984067", "http://cdn.theatlantic.com/assets/media/img/issues/2016/02/01/0316_Cover_RGB/large.jpg?1454344864", "http://cdn.theatlantic.com/assets/media/img/mt/2015/11/HEADLEY1882_p558_Iowa_Railroad_Depot_at_Council_Bluffs/lead_960.jpg?1448384400", "https://cdn.theatlantic.com/assets/media/img/posts/2015/11/DSC_0107/847cebe71.jpg", "https://cdn.theatlantic.com/assets/media/img/posts/2015/11/DSC_0212/6dde1fb2d.jpg", "https://cdn.theatlantic.com/assets/media/img/posts/2015/11/IMG_2910/7a47d3f28.jpg", "http://cdn.theatlantic.com/assets/media/video/img/2016/04/1/thumb_wide_300.jpg?1459781225", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/AP_20867470613_1/hero_wide_640.jpg?1459773752", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/RTS4K5U/hero_wide_640.jpg?1459543694", "http://cdn.theatlantic.com/assets/media/img/2016/03/WEL_Goldberg_Obama_OPENER/hero_wide_640.jpg?1456867567", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/AP90156067166/hero_wide_640.jpg?1459780633", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/AP_20867470613/hero_wide_640.jpg?1459724824", "http://cdn.theatlantic.com/assets/media/img/mt/2016/03/TWD_616_GP_1110_0013_RT/hero_wide_640.jpg?1459460409", "http://cdn.theatlantic.com/assets/media/img/mt/2016/02/RTX26TC0/hero_wide_640.jpg?1456262172", "http://cdn.theatlantic.com/assets/media/img/mt/2016/03/parenting_tips_final/hero_wide_640.jpg?1458917105", "http://cdn.theatlantic.com/assets/media/img/mt/2015/10/WealyFamiliesSociology_3/hero_wide_640.jpg?1445526718", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/11042066023_afe931586f_o/hero_wide_640.jpg?1459542754", "http://cdn.theatlantic.com/assets/media/video/img/2016/03/Screen_Shot_2016_03_28_at_5.50.27_PM_2/hero_wide_640.jpg?1459267879", "http://cdn.theatlantic.com/assets/media/video/img/2016/03/Empathy_Thumbnail_v1/hero_wide_640.jpg?1458569587", "http://cdn.theatlantic.com/assets/media/video/img/2016/03/Campaign_Ads_Thumb_Final1/hero_wide_640.jpg?1459190961", "http://cdn.theatlantic.com/assets/media/img/issues/2016/03/14/0416_CoversanspgnoRGB/large.jpg"], "words": 1782, "date": 1448323200.0, "title": "How Railroad History Shaped Internet History", "url": "http://www.theatlantic.com/technology/archive/2015/11/how-railroad-history-shaped-internet-history/417414/", "is_rtl": false, "author": "Ingrid Burrington", "html": "<div>\n        \n        <figure>\n            <div>\n                <picture>\n                    <img src=\"http://cdn.theatlantic.com/assets/media/img/mt/2015/11/HEADLEY1882_p558_Iowa_Railroad_Depot_at_Council_Bluffs/lead_960.jpg?1448384400\">\n                </picture>\n            </div>\n                \n                <figcaption>\n                    \n                        <span>An 1882 sketch of the railroad depot at Council Bluffs, Iowa</span>\n                    \n                    \n                        <a href=\"https://commons.wikimedia.org/wiki/File:HEADLEY(1882)_-p558_Iowa-Railroad_Depot_at_Council_Bluffs.jpg\">British Library / Wikimedia</a>\n                    \n                </figcaption>\n                \n        </figure>\n        \n    \n<section><p>Council Bluffs is a mid-sized town in Iowa, right on that state’s border with Nebraska. Although better known for cultivating presidential candidates than server racks, Iowa is a pretty popular site for data centers, especially new data centers built by major tech companies. Microsoft, Google, and Facebook have all built custom data centers in the state over the past seven years, and all three are expanding in the region.</p><p>Many forces have come together to shape Iowa’s data-center industry (which will be discussed in further detail in another story), but it’s the state’s history as a junction for another major network—railroads—that put it at the top of my list for Cloud sightseeing.</p><p>My favorite part of looking for network infrastructure in America is really all the ghosts. Networks tend to follow networks, and telecommunications and transportation networks tend to end up piled on top of each other. The histories of these places isn’t always immediately obvious, but it’s there, forming a kind of infrastructural palimpsest, with new technologies to annihilate space and time inheriting the idealized promise and the political messiness of their predecessors.</p><p>Iowa is no exception. It’s pretty much impossible to talk about American Internet infrastructure without talking about railroads, and Iowa is a state rich with railroad history. We came to Council Bluffs because the Union Pacific railroad route for the first transcontinental railroad <i>began</i> in Council Bluffs, a starting point selected for reasons both physical and political.</p><p>The selection of Council Bluffs as the start of the Union Pacific route is mostly credited to Grenville Dodge. Dodge would later become the UP’s chief engineer but first recommended the route in 1859, in an informal meeting with then-presidential candidate Abraham Lincoln. Dodge liked the route primarily because of the 42nd parallel’s uniform grade running to the Rocky Mountains—it was a route of least resistance across the plains (except, of course, all the resistance that comes from brutal winters and the Native American populations who weren’t particularly enthralled with the rhetorical promise of the railroad).</p></section><section><p>In between that meeting with Lincoln and the official selection of Council Bluffs in 1864, Dodge served in the Civil War (a war that shaped the future of railroads in America as much as the railroads shaped its outcome). In a twist of historical resonance, the chief engineer behind the western route of the transcontinental railroad was also a pioneer of military intelligence, leading a small corps that would later be absorbed into the Bureau of Military Information, the earliest formal American-government intelligence agency. A <a href=\"https://www.cia.gov/library/publications/intelligence-history/civil-war/Intel_in_the_CW1.pdf\">CIA history of Civil War intelligence</a> notes Dodge’s ferocious commitment to opsec: “Well aware that telegraph wires could be tapped, he enciphered his dispatches and sent them by messenger … His security precautions were so thorough that little still is known about his operations or the names of most of his agents. When Dodge’s commander, Major General Stephen A. Hurlbut, demanded those names, Dodge refused. Hurlbut then threatened to cut off Dodge’s spy funds. [Ulysses S.] Grant backed Dodge.”</p><p>Dodge went to work for the Union Pacific in 1866, working under Charles Durant, who is the kind of historical figure who gets described in even the driest of texts as “Mephistophelean” and “a born manipulator.” Dodge and Durant had worked together during the Civil War to smuggle contraband cotton out of the south, but Durant is probably best-known for instigating the Crédit Mobilier scandal, a massive graft scheme that took advantage of the U.S. government subsidies for transcontinental-railroad construction.</p><figure><picture><img src=\"https://cdn.theatlantic.com/assets/media/img/posts/2015/11/DSC_0107/847cebe71.jpg\"></picture><figcaption>Ingrid Burrington</figcaption></figure><p>Formed in 1864 (the same year Council Bluffs was selected as the railroad’s starting point and the same year that Durant conspicuously acquired a whole lot of soon-to-be-valuable land in Omaha, Council Bluffs’s next-door neighbor), Crédit Mobilier was the shell company through which the Union Pacific ran contracts for construction of the railroad. In turn, Crédit Mobilier purchased and sold Union Pacific bonds on the market, funnelling the profits back to its Union Pacific owners like Durant. By the time the scam was revealed in 1872, the shell company managed to reap $72 million in profits from a railroad only worth $53 million. Durant had been ousted from Crédit Mobilier and the Union Pacific long before then, resigning his posts shortly after the completion of the transcontinental railroad in 1869.</p></section><section><p>The histories, scoundrels, and scandals of the transcontinental railroad can’t be seen at the Google’s two data centers in Council Bluffs, Iowa. Of the two data centers, the second one (currently under construction) is a bit more spectacular. While the first data center is surrounded by bland industrial services along a fairly busy intersection, the second is literally <i>in a cornfield</i>, in an area where nearly every house we passed had an American flag on display out front.</p><p>Google didn’t come to Council Bluffs because of historical resonance. They came for the fiber, which runs parallel to Iowa’s many railroads and interstates. Rail infrastructure has shaped the language of the network (as noted in David A. Banks’s work on the <a href=\"http://firstmonday.org/ojs/index.php/fm/article/view/6283\">history of the term “online”</a>), the constellation of companies that form the network (most famously with Sprint emerging from the <a href=\"http://utahrails.net/sp/sprint.php\">Southern Pacific Railroad</a>’s internal-communications network), and, most relevant to this story, the actual routes that fiber-optic networks run.</p><aside>The U.S. government supported the construction of railroads with many of the same motives that supported the development of the Internet.</aside><p>Telecommunications companies quickly recognized the value of rail right-of-way as real estate for running cable networks long before the Internet—the first substantial use of rail networks for telecommunication networks starts with telegraphs. It’s a hell of a lot more efficient to run a cable along a single straight shot of property than negotiating easements with every single landowner between, say, Denver and Salt Lake City.</p><p>For railroads, this was a win-win, as the right-of-way agreements generate passive income, and the networks could be used for internal operations of the railroads themselves. As the first dot-com bubble expanded, more and more telecoms rushed to place their cables along rail routes. This <em>New York</em> <i>Times</i> <a href=\"http://www.nytimes.com/2000/05/06/business/new-life-for-old-railroads-what-better-place-to-lay-miles-of-fiber-optic-cable.html\">story from 2000</a> documents the moment well; it also uses the delightful (and today, woefully underused) term “cyberage” and mentions an exciting new player in the telecom scene, Enron Broadband Services. Some railroad companies followed Sprint’s suit in this period, creating their own telecom services, like <a href=\"http://www.cfnservices.com/\">CSX Fiber Networks</a>.</p></section><section><p>The markers of this right-of-way race along railroad routes (and highways, which have a similar right-of-way appeal to telecoms) are not especially impressive, but pretty hard to ignore. They usually take the form of orange-tipped white poles, or orange metal signs, spaced out a few meters apart running parallel to the rails. The orange part usually has a label warning people to call before digging, a phone number to call, and sometimes the name of the company or government agency that happens to own the buried cable. Labeled this way, fiber markers become a testament to telecom history, bearing names of companies that fell in the bursting of the first bubble, long ago absorbed into larger telecom networks. The new owners apparently don’t bother replacing the poles with their names or logos—presumably because it’s not really financially worthwhile to send someone to put Level 3 stickers over thousands of Global Crossing or Williams Communications logos on signage that’s more or less designed to be ignored by 99 percent of the public, like most network infrastructure.</p><figure><picture><img src=\"https://cdn.theatlantic.com/assets/media/img/posts/2015/11/DSC_0212/6dde1fb2d.jpg\"></picture><figcaption>Ingrid Burrington</figcaption></figure><p>Google’s Iowa data centers aren’t entirely designed to be ignored. Given their massive scale, they don’t really blend into the landscape that well, and because Google brands itself as open and accessible, they kind of have to call attention to themselves with accents of the traditional company color scheme and signage. Google data centers are more often obscured through landscape design choices and a security-through-obscurity logic. Placed beneath cresting hills or along thoroughfares that don’t have readily accessible shoulders, they are hard to really stop and look at, remaining unknown industrial buildings always glimpsed just barely out of the corner of one’s eye while driving.</p><p>While Google does offer a polished, carefully curated <a href=\"http://google.com/datacenters\">online tour</a> of their data centers, they don’t tend to publicize their addresses or talk in great detail about what they’re doing inside. And they go to great lengths to shield that information when it inadvertently appears, as seen in the <a href=\"http://www.wired.com/2012/09/pluto-switch/\">Pluto Switch incident</a> in 2012.</p></section><section><p>In the end, I was a little disappointed at the apparent pragmatism of Google’s decision to place its Iowa data centers in the starting point of the transcontinental railroad. Surely someone in the company had a sense of irony, or at least a sense of legacy. The history of American networks has always been the history of spooks, graft, questionable labor and supply chains, and territorial conquest, long before the Internet acquired its history rife with spooks, graft, questionable labor and supply chains, and territorial conquest. It also is a history that, despite the meritocratic bootstrapping narratives of the Valley, has always been driven by the financial support and influence of the state. The U.S. government heavily subsidized and supported the construction of railroads for the same reasons it subsidized and supported the development of the Internet itself: military strategy, economic development, and a zealous, romantic vision of the both liberatory and unifying potential of being able to traverse or defy the limits of greater and greater distances.</p><figure><picture><img src=\"https://cdn.theatlantic.com/assets/media/img/posts/2015/11/IMG_2910/7a47d3f28.jpg\"></picture><figcaption>Sam Kronick</figcaption></figure><p>I keep going back to a very early example of this faith in networks, a passage from <i>Bloodgood vs. Mohawk &amp; H.R.R</i>., an easement case from 1837. In it, the judge describes the inherent value of railroads thusly: “...they tend to annihilate distance, bringing in effect places that are distant near to each other: tending in their magic influence to the extension of personal acquaintance, the enlargement of business relations, and cementing more firmly the bond of fellowship and union between the inhabitants of the States.” It is difficult to read this hopeful passage and not be reminded of <a href=\"https://projects.eff.org/~barlow/Declaration-Final.html\">J.P. Barlow in Davos</a> exalting the liberation of the “global conveyance of thought” in 1996.</p><p>Our pilgrimage to Council Bluffs failed to feature too many obvious moments of resonance (it did not help that we passed through the day that the Union Pacific Railroad Museum happened to be closed). But flickers of freight rail and orange markers alongside highways followed us through Iowa, keeping the ghosts of annihilated distance if not always in mind then at least out of the corner of my eye, as we drove toward arguably the most unexpected pilgrimage I’ve ever made: a tour of a Facebook data center.</p></section>\n    </div>\n\n    ", "thumbnail": "http://cdn.theatlantic.com/assets/media/img/mt/2015/11/HEADLEY1882_p558_Iowa_Railroad_Depot_at_Council_Bluffs/facebook.jpg?1448384400"}