{"site_name": "The Atlantic", "description": "Metamorphosis insectorum Surinamensium It was silkworms that first captured 13–year–old Maria Sibylla Merian’s attention. She would later graduate to a wider set of creatures, watching caterpillars, pupae, butterflies, and moths for days, weeks, and months. Paintbrush in hand, Merian recorded each stage of their life cycles, noting every change and movement. She depicted the silkworm moth from eggs, hatching larvae, molts, cocoons, all the way to adult moths. She distinguished between male and female, and showed a silkworm feeding on a mulberry leaf. Unlike many other girls her age, Merian was not disgusted by hairy crawling creatures or by tightly cocooned ‘date pits’ as she called the chrysalis. She pocked, squeezed, and prodded them to note how they ‘roll up,’ ‘twist and turn violently,’ or ‘lie there as if dead.’ Merian was born in 1647 in Frankfurt into a family of artists and printers — her father was the engraver and publisher Matthäus Merian the Elder and when he died, her mother married still–life painter Jacob Marrel, who encouraged his stepdaughter’s talent. As a young girl Maria Sibylla Merian painted flowers, before becoming obsessed with caterpillars and how they metamorphosed into moths and butterflies. At sixteen, Merian married Johann Andreas Graff, an artist who had learned his trade as her stepfather’s pupil. It wasn’t a happy marriage, but even as a mother of two daughters, she found time to rear her caterpillars and draw them. Their house was filled with boxes, jars, and plants, with her kitchen as the laboratory.", "videos": [], "images": ["http://cdn.theatlantic.com/assets/media/img/issues/2016/03/14/0416_CoversanspgnoRGB/large.jpg", "http://cdn.theatlantic.com/assets/media/img/issues/2016/03/14/0416_CoversanspgnoRGB/large.jpg?1457984067", "http://cdn.theatlantic.com/assets/media/img/issues/2016/02/01/0316_Cover_RGB/large.jpg?1454344864", "http://cdn.theatlantic.com/assets/media/img/mt/2016/01/archivebutterfly/lead_960.jpg?1453216475", "https://cdn.theatlantic.com/assets/media/img/posts/2016/01/maria_merian_insects_of_surinam_1719_lg_folio._spider_web_18_2_58388_p/ee53a5d6b.jpg", "http://cdn.theatlantic.com/assets/media/video/img/2016/04/campbell_kid_2/thumb_wide_300.jpg?1459795090", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/AP_75903016688/hero_wide_640.jpg?1459792100", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/RTSDJVG/hero_wide_640.jpg?1459793568", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/AP6955270405/hero_wide_640.jpg?1459793249", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/RTS4K5U/hero_wide_640.jpg?1459543694", "http://cdn.theatlantic.com/assets/media/img/2016/03/WEL_Goldberg_Obama_OPENER/hero_wide_640.jpg?1456867567", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/AP_20867470613_1/hero_wide_640.jpg?1459773752", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/AP90156067166/hero_wide_640.jpg?1459780633", "http://cdn.theatlantic.com/assets/media/img/mt/2016/04/AP_20867470613/hero_wide_640.jpg?1459724824", "http://cdn.theatlantic.com/assets/media/img/mt/2016/03/parenting_tips_final/hero_wide_640.jpg?1458917105", "http://cdn.theatlantic.com/assets/media/img/mt/2016/03/TWD_616_GP_1110_0013_RT/hero_wide_640.jpg?1459460409", "http://cdn.theatlantic.com/assets/media/video/img/2016/03/Screen_Shot_2016_03_28_at_5.50.27_PM_2/hero_wide_640.jpg?1459267879", "http://cdn.theatlantic.com/assets/media/video/img/2016/03/Empathy_Thumbnail_v1/hero_wide_640.jpg?1458569587", "http://cdn.theatlantic.com/assets/media/video/img/2016/03/Campaign_Ads_Thumb_Final1/hero_wide_640.jpg?1459190961", "http://cdn.theatlantic.com/assets/media/img/issues/2016/03/14/0416_CoversanspgnoRGB/large.jpg"], "words": 1228, "date": 1453161600.0, "title": "The Woman Who Made Science Beautiful", "url": "http://www.theatlantic.com/science/archive/2016/01/the-woman-who-made-science-beautiful/424620/", "is_rtl": false, "author": "Andrea Wulf", "html": "<div>\n        \n        <figure>\n            <div>\n                <picture>\n                    <img src=\"http://cdn.theatlantic.com/assets/media/img/mt/2016/01/archivebutterfly/lead_960.jpg?1453216475\">\n                </picture>\n            </div>\n                \n                <figcaption>\n                    \n                    \n                        <span>Metamorphosis insectorum Surinamensium</span>\n                    \n                </figcaption>\n                \n        </figure>\n        \n    \n<section><p><span>It was silkworms that first captured 13–year–old Maria Sibylla Merian’s attention. She would later graduate to a wider set of creatures, watching caterpillars, pupae, butterflies, and moths for days, weeks, and months. Paintbrush in hand, Merian recorded each stage of their life cycles, noting every change and movement. She depicted the silkworm moth from eggs, hatching larvae, molts, cocoons, all the way to adult moths. She distinguished between male and female, and showed a silkworm feeding on a mulberry leaf. Unlike many other girls her age, Merian was not disgusted by hairy crawling creatures or by tightly cocooned ‘date pits’ as she called the chrysalis. She pocked, squeezed, and prodded them to note how they ‘roll up,’ ‘twist and turn violently,’ or ‘lie there as if dead.’  </span></p><p><span>Merian was born in 1647 in Frankfurt into a family of artists and printers</span>—<span>her father was the engraver and publisher Matthäus Merian the Elder and when he died, her mother married still–life painter Jacob Marrel, who encouraged his stepdaughter’s talent. As a young girl Maria Sibylla Merian painted flowers, before becoming obsessed with caterpillars and how they metamorphosed into moths and butterflies. At </span><span>sixteen, Merian married Johann Andreas Graff, an artist who had learned his trade as her stepfather’s pupil. It wasn’t a happy marriage, but even as a mother of two daughters, she found time to rear her caterpillars and draw them. Their house was filled with boxes, jars, and plants, with her kitchen as the laboratory. In 1679, a year after the birth of her second daughter, Merian published </span><span><i>Der Raupen wunderbarer Verwandlung </i>(<i>The Wondrous Transformation of Caterpillars</i>), the result of almost two decades of observations. </span></p></section><section><p><span>It was unlike any other book yet written. There were other publications on insects, but no one had ever drawn their full life cycle and their ecological connections. Instead of depicting them as specimens set against a plain background, Merian showed the relationships between animals and plants. And at a time when other scientists were trying to make sense of the natural world by classifying plants and animals into narrow categories, Merian looked at their place within the wider natural world. She searched for connections where others were looking for separation. </span></p><p><span>Merian was an extraordinary woman. Curious, intelligent, and independent-minded, she </span><span>left her husband in 1685 and moved with her daughters to a religious sect in Friesland. There was a public spat with Graff as he tried, to no avail, to get his wife back. A few years later, Merian moved again, to Amsterdam, to live alone with her daughters. </span></p><p><span>In Amsterdam the intrepid Merian found a world fueled by trade and the Dutch empire, a world where women were allowed to have a business and earn money. Collectors bought her drawings and opened their cabinets of curiosities for her. She saw marvelous butterflies and moths with magnificently patterned wings, some the size of a palm but pinned into their wooden trays</span>—<span>disconnected from their pupae, eggs, and food. The exotic specimens had arrived from all corners of the Dutch empire, but Merian was determined to see them in their natural habitat. </span></p><p><span>In June 1699, aged 52, she and her youngest daughter boarded a ship headed to the northwestern coast of South America, to Surinam, the colony that the Dutch had swapped with the English for Manhattan. It was an audacious enterprise. N</span><span>ot only was Merian a woman naturalist in the male–dominated scientific world of the late seventeenth century, she also embarked on a exploration for entirely scientific purposes before it became fashionable. (Previous explorations always had political, economic, or military premises.) She traveled alone and without protection, and financed her adventure by selling her drawings. </span></p></section><section><p><span>For two years, Merian collected whatever she could get her hands on—in the vegetable gardens of the capital Paramaribo, on the banks of the Surinam River, and in fields and forests of the sugar plantations. She took the boat up the river past caimans to explore the rainforest. She questioned indigenous people and paid them to bring her insects. They hacked paths into the jungle so that she could scramble through the tangle in corset and petticoat. She climbed up ladders to reach the higher branches and happily brought hundreds of caterpillars into her house. She returned to Amsterdam after 2 years, in the summer of 1701.</span></p><p><span>The result of this expedition was Merian’s magnificent </span><span><i>Metamorphosis insectorum Surinamensium</i>, written in Latin, the international language of science, and a lavish folio edition of 60 stunning copperplate engravings that brought the exotic world of the rainforest to the damp drawing rooms of Europe. The drawings were exquisite. Azure blue butterflies hovering over delicate blossoms, moths unfurling their proboscis, fat frogs together with their eggs and tadpoles, dazzlingly striped caterpillars munching on leaves and leggy ants crawling up branches. Merian’s nature was beautiful, but true-to life. Her blossoms had holes, her leaves were half chewed, and her blooms had lost their petals. </span></p><p><span>Merian</span><span> published her work on the metamorphosis of caterpillars during an age when other naturalists were still discussing ‘spontaneous generation’</span>—<span>a theory that had been popular since Aristotle. Many of Merian’s contemporaries believed that rotten meat created maggots, insects grew from dew, mud, and even from books, and that moths sprang from old wool and caterpillars from cabbages. </span></p><p><span>Merian corresponded with scientists across Europe and her books were proudly displayed in the finest libraries. The </span><span>Swedish naturalist Carl Linnaeus</span><span> would later use her drawings to classify insects, and Germany’s most celebrated poet Goethe (who also wrote a treatise on the metamorphosis of plants) praised Merian for her ability to move ‘between art and science, between nature observation and artistic intention.’ Her emphasis on relationships influenced</span>—<span>directly and indirectly</span>—<span>important naturalists and artists such as Mark Catesby, William Bartram, and John James Audubon, who all depicted animals and their plants’ hosts and habitats. Yet today, few people have heard of her. She died in 1717, just before her seventieth birthday. On the day of her funeral an agent for the Russian Tsar, Peter the Great, bought her remaining watercolors.</span></p><p><span>Most European butterflies didn’t even have a scientific name when Merian began to study them, nor were they properly classified before Linnaeus imposed his order on to the natural world many years after her death. </span><span>Merian was not interested in classification, as she explained to an English collector, but ‘only in the formation, propagation, and metamorphosis of creatures ... and the nature of their diet.’ </span><span>Almost two centuries before the German zoologist Ernst Haeckel coined the term ‘<i>Oecologie</i>’</span>—e<span>cology</span>—<span>Merian published plates that </span><span>depicted ecological communities. </span></p><figure><picture><img src=\"https://cdn.theatlantic.com/assets/media/img/posts/2016/01/maria_merian_insects_of_surinam_1719_lg_folio._spider_web_18_2_58388_p/ee53a5d6b.jpg\"></picture><figcaption>In Plate 18 from <em>Metamorphosis</em>, Merian portrays the ruthless nature of the food chain. (<em>Metamorphosis insectorum Surinamensium / </em>Albion Prints)</figcaption></figure><p><span>Take plate 18 from her </span><span><i>Metamorphosis</i></span><span> which shows the branch of a guava tree almost defoliated by leafcutter and army ants which are crawling up the stem. A few ants attack a small spider and a cockroach, while a tarantula eats a hummingbird. There are different species of spiders and yet another tarantula with an egg sac. This was no garden of Eden but a relentless battle. One hundred and fifty years before Charles Darwin wrote his <i>Origin of Species</i>, Merian knew nature well enough to depict it as a constant struggle for survival. </span></p></section>\n    </div>\n\n    ", "thumbnail": "http://cdn.theatlantic.com/assets/media/img/mt/2016/01/archivebutterfly/facebook.jpg?1453216475"}