{"site_name": "nytimes.com", "description": "Sleeping in two distinct blocks opens an ancient portal to the other side of midnight. Illustration by Valero Doval Late last year, an edgy, blanked-­out feeling nestled in with me and wouldn’t leave. I’d find myself sitting at my desk, facing emails that I couldn’t remember sending and deeply wished to retract. How had my life been put in the hands of someone like me? I had no attention, no patience; whatever I did, I was bored 10 seconds later. I closed my eyes and saw browser tabs on the inside of my lids. Soon insomnia knocked me totally out of sync, and I compensated one night by nodding off at 8 p.m. That caused me to wake up at 2 a.m., disoriented. I spent a few hours brooding, then slept again until 6, when I got up, had coffee and showered. Tired again at 8 p.m., I repeated the pattern the following night. And the next, and the next, until I was regularly entering the forgotten, ancient tunnel to the other side of midnight: segmented sleep. It looked embarrassing in a modern context, but it was once the most normal thing in the world. Back when segmented sleep was common, this period between “first” and “second” sleep inspired reverence. The French called it dorveille , or wakesleep, a hypnotic state. English speakers called it “the watch.” I had usually approached the post-­midnight hours full-sail, by staying up. Waking into them is different, childlike. The time feels freer. The urge", "videos": [], "images": ["https://static01.nyt.com/images/2016/04/03/magazine/03lor/03mag-03lor-t_CA0-master675.jpg"], "words": 1018, "date": 1459382400.0, "title": "Letter of Recommendation: Segmented Sleep", "url": "http://www.nytimes.com/2016/04/03/magazine/letter-of-recommendation-segmented-sleep.html", "is_rtl": false, "author": "Jesse Barron", "html": "<article>\n\n            \n\n        \n    <div>\n    <div>\n        <figure>\n    \n    <div>\n            <img src=\"https://static01.nyt.com/images/2016/04/03/magazine/03lor/03mag-03lor-t_CA0-master675.jpg\">\n            \n            \n    </div>\n        <figcaption>\n                <span>Sleeping in two distinct blocks opens an ancient portal to the other side of midnight.</span>\n                        <span>\n            \n            Illustration by Valero Doval        </span>\n            </figcaption>\n    </figure>\n<p>Late last year, an edgy, blanked-­out feeling nestled in with me and wouldn’t leave. I’d find myself sitting at my desk, facing emails that I couldn’t remember sending and deeply wished to retract. How had my life been put in the hands of someone like me? I had no attention, no patience; whatever I did, I was bored 10 seconds later. I closed my eyes and saw browser tabs on the inside of my lids.</p><p>Soon insomnia knocked me totally out of sync, and I compensated one night by nodding off at 8 p.m. That caused me to wake up at 2 a.m., disoriented. I spent a few hours brooding, then slept again until 6, when I got up, had coffee and showered. Tired again at 8 p.m., I repeated the pattern the following night. And the next, and the next, until I was regularly entering the forgotten, ancient tunnel to the other side of midnight: segmented sleep. It looked embarrassing in a modern context, but it was once the most normal thing in the world.</p><p>Back when segmented sleep was common, this period between “first” and “second” sleep inspired reverence. The French called it <em>dorveille</em>, or wakesleep, a hypnotic state. English speakers called it “the watch.” I had usually approached the post-­midnight hours full-sail, by staying up. Waking into them is different, childlike. The time feels freer. The urge to be busy abates. Conversation has a conspiratorial intimacy, as if you’ve sneaked behind the tent to find the only other smoker at the wedding. Though I preferred the name <em>dorveille</em>, because it sounded glamorous, “the watch” was technically more accurate during those early weeks, when I mainly got up and watched Netflix.</p><p>In the preindustrial West, most people slept in two discrete blocks and used <em>dorveille</em> for all kinds of purposes. Having sex was popular. Benjamin Franklin liked to “take cold-air baths,” a fancy way of saying “open his windows naked.” Many people wrote in journals or interpreted dreams, which feel more proximate at 3 a.m. than in daylight. You could drink a cup of tea and take a satisfied leak on the embers of your fire. But everyone did something, because <em>dorveille</em> was ubiquitous.</p>\n<p>We tend to view our basic patterns, like spending the evening out and then lying unconscious for eight hours straight, as belonging to a natural order. But until streetlights, being up late meant wandering town in butt-­clenching terror, tripping over stray animals until the wind blew out your lantern and you were set upon by armed bandits. So you went home before dark and went to bed early, waking after midnight. Much of this was forgotten until 2001, when the historian Roger Ekirch unearthed segmented sleep in the cultural history of pre-­19th-­century Europe, supporting the research of an American chronobiologist who, in a 1992 study, asserted that segmented sleep is more natural than the monophasic variety we now aspire to. Exposed over several weeks to preindustrial light conditions, most of us will gradually start sleeping twice a night, hooked to the Ur-­rhythm of our internal clock.</p>\n<p>It was the Industrial Revolution, saturating us with electric light, that caused <em>dorveille</em> to obsolesce — but now it’s electricity that makes it so useful. <em>Dorveille</em> is the only part of the day when no one expects to hear from anyone at all. You can keep yourself unavailable without that abstract sense of guilt. You never need to open an email. <em>Dorveille’s</em> appeal doesn’t derive from historicity: what appeals is the escape from the very conditions that obliterated it.</p><p>At first, I treated <em>dorveille</em> like stolen time, and like most thieves, I was careless with my loot, frittering it away each night. But as I persisted, I saw the deeper value. <em>Dorveille</em> once served as a time to remember dreams. For me, the tasks undertaken in <em>dorveille</em> retained a little of the ease of dreaming. During the day, I can’t reliably read 20 pages in a row before I experience an overwhelming physical urge to waste my time. During <em>dorveille,</em> I finished books. It was like having a superpower. Nor must <em>dorveille</em> be all business. I found that snaggly, insoluble problems, in friendships and writing and marriage, were more easily confronted and could be muddled through for longer.</p><p>Metabolically, the alertness of <em>dorveille</em> differs from the taut insomniac variety. The author of that 1992 study — the one that proved the innateness of segmented sleep — described <em>dorveille</em> as a state of “nonanxious wakefulness,” which truly sounds oxymoronic until you experience it. I’m one of the least relaxed people I know; having lived most of my adult life in New York, “awake” and “anxious” are synonyms as far as I’m concerned. But during these hours I felt calm. Most amazing, I had no desire to reach for my phone. I felt an unfamiliar lack of itch.</p>\n<p>It is sometimes noted that segmented sleep fits snugly within the Christian Liturgy of the Hours, which obligated the faithful to rise at dawn for Lauds and pray in the dead of night. This isn’t the whole story (pre- and non-­Christian cultures practiced biphasic sleep), but what is true is that <em>dorveille</em> was communal. Waking at 2 a.m. in 1550, you were not quite alone. Your husband or wife was up, too. Your neighbors were up, you might reasonably think, probably doing the same things you were. An invisible clamor of writing, drinking, lovemaking, fighting humanity enveloped you. That’s the part of segmented sleep I might never experience. I get the postmodern afterglow, the decay of a mass-­cultural behavior into an individual preference. I’ve gained another routine, when what I want is a sense of ritual.</p><footer>\n    <div>\n                <em><div><p>Jesse Barron is a writer in New York.</p></div></em>\n        <div><p><em>Sign up for <a href=\"http://www.nytimes.com/newsletters/magazine\">our newsletter</a> to get the best of The New York Times Magazine delivered to your inbox every week.</em></p></div>\n\n        \n        <em><p>A version of this article appears in print on April 3, 2016, on page MM26 of the <span>Sunday Magazine</span> with the headline: Segmented Sleep. \n</p></em>\n    </div>\n    </footer>\n        \n    </div>\n    <div>\n    </div>\n</div>\n\n    \n    <div>\n        <div>\n    \n</div>\n<div>\n    <aside>\n</aside>\n</div>\n<div>\n    <aside>\n</aside>\n</div>\n<div>\n    <aside>\n</aside>\n</div>\n    </div>\n\n</article>\n\n\n\n                    \n            ", "thumbnail": "https://static01.nyt.com/images/2016/04/03/magazine/03lor/03mag-03lor-t_CA0-facebookJumbo.jpg"}