{"site_name": "The New Yorker", "description": "El Chapo escaped from a maximum-security prison and evaded many attempts at capture, often hiding out in the Sierra Madre. Credit Clockwise from top left: Alfredo Estrella / AFP / Getty; Greg Mathieson / Mai / Mai / Time Life Pictures / Getty; Ronaldo Schemidt / AFP / Getty; Nikolai Golovanoff / Corbis; Artgraphixel / Shutterstock; Natrot / Shutterstock; Us DEA / Reuters; Chris Ratcliffe / Bloomberg / Getty; BSIP / UIG / Getty; Zimand / Shutterstock (AK-47); Ronaldo Schemidt / AFP / Getty (handgun) One afternoon last December, an assassin on board a K.L.M. flight from Mexico City arrived at Amsterdam’s Schiphol Airport. This was not a business trip: the killer, who was thirty-three, liked to travel, and often documented his journeys around Europe on Instagram. He wore designer clothes and a heavy silver ring in the shape of a grimacing skull. His passport was an expensive fake, and he had used it successfully many times. But, moments after he presented his documents to Dutch customs, he was arrested. The U.S. Drug Enforcement Administration had filed a Red Notice with Interpol—an international arrest warrant—and knew that he was coming. Only after the Dutch authorities had the man in custody did they learn his real identity: José Rodrigo Arechiga, the chief enforcer for the biggest drug-trafficking organization in history, Mexico’s Sinaloa cartel. To work in the Mexican drug trade is to have a nickname, and Arechiga went by the whimsically malevolent handle El Chino Ántrax. He supervised the armed wing", "videos": [], "images": ["http://www.newyorker.com/wp-content/assets/dist/img/px.gif", "http://www.newyorker.com/wp-content/assets/dist/img/px.gif", "http://www.newyorker.com/wp-content/assets/dist/img/px.gif", "http://www.newyorker.com/wp-content/uploads/2014/05/2014_05_05-200.jpg", "http://www.newyorker.com/wp-content/uploads/2014/05/140505_r24957-320.jpg", "http://www.newyorker.com/wp-content/uploads/2014/07/keefe.png", "http://www.newyorker.com/wp-content/assets/dist/img/spacer-mobile-320x240.png", "http://www.newyorker.com/wp-content/assets/dist/img/spacer-mobile-728x375.png", "http://www.newyorker.com/wp-content/uploads/2015/08/150803_r26807-728-375-23160615.jpg", "http://www.newyorker.com/wp-content/uploads/2015/08/150803_r26807-320-240-23160602.jpg", "http://www.newyorker.com/wp-content/assets/dist/img/spacer-mobile-320x240.png", "http://www.newyorker.com/wp-content/assets/dist/img/spacer-mobile-728x375.png", "http://www.newyorker.com/wp-content/uploads/2015/07/Keefe-El-Chapo-Escapes-Again-728-375-12133552.jpg", "http://www.newyorker.com/wp-content/uploads/2015/07/Keefe-El-Chapo-Escapes-Again-320-240.jpg", "http://www.newyorker.com/wp-content/assets/dist/img/px.gif", "http://www.newyorker.com/wp-content/assets/dist/img/icon/ad_choices_arrow.png", "http://www.newyorker.com/wp-content/assets/dist/img/px.gif"], "words": 9826, "date": "", "title": "The Hunt for El Chapo", "url": "http://www.newyorker.com/magazine/2014/05/05/the-hunt-for-el-chapo", "is_rtl": false, "author": "Patrick Radden Keefe", "html": "<div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t<figure>\n\t\t\t\t\t\t\t\t<a href=\"http://www.newyorker.com/wp-content/uploads/2014/05/140505_r24957-842.jpg\">\n\t\t\t\t\t\t\t\t\t<img src=\"http://www.newyorker.com/wp-content/uploads/2014/05/140505_r24957-320.jpg\">\t\t\t\t\t\t\t\t</a>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<figcaption>\n\t\t\t\t\t\t\t\t\t<span>El Chapo escaped from a maximum-security prison and evaded many attempts at capture, often hiding out in the Sierra Madre.</span>\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<span>Credit</span> Clockwise from top left: Alfredo Estrella / AFP / Getty; Greg Mathieson / Mai / Mai / Time Life Pictures / Getty; Ronaldo Schemidt / AFP / Getty; Nikolai Golovanoff / Corbis; Artgraphixel / Shutterstock; Natrot / Shutterstock; Us DEA / Reuters; Chris Ratcliffe / Bloomberg / Getty; BSIP / UIG / Getty; Zimand / Shutterstock (AK-47); Ronaldo Schemidt / AFP / Getty (handgun)\t\t\t\t\t\t\t\t\t</span>\t\t\t\t\t\t\t\t</figcaption>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</figure>\n\t\t\t\t\t\t\t<p>One afternoon last December, an assassin on board a K.L.M. flight from Mexico City arrived at Amsterdam’s Schiphol Airport. This was not a business trip: the killer, who was thirty-three, liked to travel, and often documented his journeys around Europe on Instagram. He wore designer clothes and a heavy silver ring in the shape of a grimacing skull. His passport was an expensive fake, and he had used it successfully many times. But, moments after he presented his documents to Dutch customs, he was arrested. The U.S. Drug Enforcement Administration had filed a Red Notice with Interpol—an international arrest warrant—and knew that he was coming. Only after the Dutch authorities had the man in custody did they learn his real identity: José Rodrigo Arechiga, the chief enforcer for the biggest drug-trafficking organization in history, Mexico’s Sinaloa cartel.</p> <p>To work in the Mexican drug trade is to have a nickname, and Arechiga went by the whimsically malevolent handle El Chino Ántrax. He supervised the armed wing of the Sinaloa—a cadre of executioners known as Los Ántrax—and coördinated drug shipments for the cartel’s leader, Joaquín Guzmán Loera, who was known as El Chapo, or Shorty. Arechiga was a <em>narcotraficante</em> of the digital age, bantering with other criminals on Twitter and posting snapshots of himself guzzling Cristal, posing with exotic pets, and fondling a gold-plated AK-47. Guzmán, who is fifty-seven, typified an older generation. Obsessively secretive, he ran his multibillion-dollar drug enterprise from hiding in Sinaloa, the remote western state where he was born, and from which the cartel takes its name. The Sinaloa cartel exports industrial volumes of cocaine, marijuana, heroin, and methamphetamine to America; it is thought to be responsible for as much as half the illegal narcotics that cross the border every year. Guzmán has been characterized by the U.S. Treasury Department as “the world’s most powerful drug trafficker,” and after the killing of Osama bin Laden, three years ago, he became perhaps the most wanted fugitive on the planet. Mexican politicians promised to bring him to justice, and the U.S. offered a five-million-dollar reward for information leading to his capture. But part of Guzmán’s fame stemmed from the perception that he was uncatchable, and he continued to thrive, consolidating control of key smuggling routes and extending his operation into new markets in Europe, Asia, and Australia. According to one study, the Sinaloa cartel is now active in more than fifty countries.</p> <p>On several occasions, authorities had come close to catching Guzmán. In 2004, the Mexican Army descended on a dusty ranch in Sinaloa where he was holed up, but he had advance warning and fled along a rutted mountain track in an all-terrain vehicle. Three years later, Guzmán married a teen-age beauty queen named Emma Coronel and invited half the criminal underworld of Mexico to attend the ceremony. The Army mobilized several Bell helicopters to crash the party; the troops arrived, guns drawn, to discover that Guzmán had just departed. American authorities have no jurisdiction to make arrests in Mexico, so whenever D.E.A. agents developed fresh intelligence about Guzmán’s whereabouts all they could do was feed the leads to their Mexican counterparts and hope for the best. In Washington, concerns about the competence of Mexican forces mingled with deeper fears about corruption. A former senior Mexican intelligence official told me that the cartel has “penetrated most Mexican agencies.” Was Guzmán being tipped off by an insider? After a series of near-misses in which Chapo foiled his pursuers by sneaking out of buildings through back doors, officials at the U.S. Embassy in Mexico City took to joking, bitterly, that there is no word in Spanish for “surround.”</p> <p>Guzmán developed “a Zorro-like reputation,” Gil Gonzalez, who pursued him in Mexico for the D.E.A., told me. In dozens of <em>narcocorridos</em>, the heraldic Mexican ballads that glorify traffickers, singers portrayed Guzmán as a country boy turned cunning bandit who had grown rich but not soft, his <em>cuerno de chivo</em>, or “goat horn”—Mexican slang for an assault rifle with a curved magazine—never far from his side.</p> <p>Yet Guzmán himself remained maddeningly obscure. Only a few photographs of him circulated publicly. A famous series taken after an arrest in 1993 shows a stocky, dark-eyed, square-jawed young man standing awkwardly in a prison yard; he gazes at the camera with a shyness that seems at odds with his fearsome reputation. Chapo escaped eight years later, and had been on the run ever since. Because he might have had plastic surgery to alter his appearance, the authorities could no longer be sure what he looked like. One <em>narcocorrido</em> captured the predicament: “Only he knows who he is / So go looking for someone / Who looks just like him / Because the real Chapo / You’ll never see again.”</p> <p>The authorities tried to track Guzmán by monitoring telephone lines. Narcotics smuggling necessitates regular phone communication between farmers and packers, truckers and pilots, accountants and enforcers, street dealers and suppliers. But traffickers at the top of the hierarchy maintain operational security by rarely making calls or sending e-mails. Guzmán was known to use sophisticated encryption and to limit the number of people he communicated with, keeping his organization compartmentalized and allowing subordinates a degree of autonomy, as long as the shipments kept running on time. “I never spoke to him directly,” one former Sinaloa lieutenant told me. “But I knew what he wanted us to do.”</p> <p>The Sinaloa cartel is sometimes described as a “cellular” organization. Structurally, its network is distributed, and has more in common with a terrorist organization like Al Qaeda than with the antiquated hierarchies of the Cosa Nostra. When the cartel suffers the loss of a major figure like El Chino Ántrax, it can reconstitute itself—but not without a few phone calls among the leadership. At the D.E.A., which taps hundreds of phone lines and e-mail accounts associated with traffickers, the process of applying pressure to a criminal organization and then monitoring furtive attempts at outreach is known as “tickling the wires.” When El Chino Ántrax was arrested in Amsterdam, the cartel was still coping with two other high-level losses: in November, the twenty-three-year-old son of one of Guzmán’s closest associates was arrested while trying to cross the border in Nogales; in December, Mexican troops in a helicopter shot and killed another key cartel enforcer, on a stretch of highway by the Sea of Cortez.</p> <p>As the cartel attempted to regroup, authorities on both sides of the border intercepted scores of phone calls, texts, and e-mails. They learned that Guzmán would soon be coming to Culiacán, the state capital of Sinaloa, for a meeting with his sons Alfredo and Iván—ascendant traffickers who were both close friends of El Chino Ántrax. The D.E.A. presented an intelligence dossier to authorities in Mexico, and in mid-January a special-forces unit of commandos from the Mexican Marines, or <small>SEMAR</small>, began to assemble at a forward operating base near the resort town of Los Cabos, along the southern tip of the Baja Peninsula. The marines, who are the Mexican equivalent of Navy <small>SEAL</small>s, were joined by a small group of American advisers. Mexican authorities code-named the mission Operation Gargoyle. Its object was to capture Guzmán.</p> <p>According to the Dallas <em>Morning News,</em> the government of Mexico’s President Enrique Peña Nieto informed the marines and their American partners that they would have approximately three weeks to bring down the drug lord. A U.S. official involved in planning the operation told me that this was true. Fighting drug traffickers in Mexico has become a matter of triage, and the <small>SEMAR</small> unit was soon to be redeployed to battle another cartel, the Knights Templar, in the restive state of Michoacán. (Eduardo Sánchez, the chief spokesman for the government of Mexico, denied that any such time limit was in place. “There was no window,” he said.)</p> <p>As the marines and their advisers moved into Los Cabos, they tried not to attract attention. A battleship anchored off the coast was used as a decoy, so that curious observers might conclude that the sudden influx of commandos was part of a standard naval exercise. But one reason that Guzmán had remained at large so long was his unparalleled network of informants. One person involved in the operation told me, “As soon as we landed, he knew.”</p>    <p>Guzmán had always been a master of escape. Born in the mountain village of La Tuna, in Mexico’s wild and craggy Sierra Madre Occidental, he was the oldest child of a subsistence farmer who dabbled in the drug trade. For generations, Sinaloan ranchers had cultivated cannabis and opium, and children were taken out of elementary school to assist in the harvest. Guzmán left school for good in third grade, and in the seventies, in spite of his illiteracy, he became an apprentice to two drug chieftains: Amado Carrillo Fuentes, who owned a fleet of airplanes and was known as the Lord of the Skies; and Miguel Ángel Félix Gallardo, a police officer turned drug baron, who ran the Guadalajara cartel and was known as El Padrino—the Godfather.</p> <p>Guzmán started as a kind of air-traffic controller, coördinating cocaine flights from Colombia. But he was clever and aggressive, and quickly began to acquire power. One night in November, 1992, Guzmán’s henchmen massacred six people at a crowded discothèque in Puerto Vallarta. They severed the telephone lines so that nobody could call for help, then walked inside and opened fire on the dance floor. The targets were Tijuana-based traffickers whom Guzmán was challenging for control of the lucrative smuggling routes through Baja California. They were in the bathroom when the shooting started, and fled without being harmed. The next spring, the traffickers arranged for their own hit men to murder Guzmán at the international airport in Guadalajara. As gunfire erupted, Guzmán scrambled out of his vehicle and crawled to safety. Seven people were killed, including Archbishop Juan Jesús Posadas Ocampo. (The gunmen apparently mistook him for Guzmán.) Ocampo’s murder caused a political uproar, and it was not long before Guzmán, who had gone into hiding, was picked up by authorities in Guatemala and turned over to Mexico. He was sentenced to twenty years in prison, on charges of conspiracy, drug trafficking, and bribery, and ended up in Puente Grande, in Jalisco, which was considered one of the most secure prisons in Mexico.</p> <p>Behind bars, Guzmán consolidated both his empire and his reputation. He bought off the prison staff and enjoyed a life of relative luxury: he conducted business by cell phone, orchestrated regular visits from prostitutes, and threw parties for favored inmates that featured alcohol, lobster bisque, and filet mignon. While he was there, the Mexican attorney general’s office subjected him to psychological interviews. The resulting criminal profile noted that he was “egocentric, narcissistic, shrewd, persistent, tenacious, meticulous, discriminating, and secretive.”</p> <p>One day in January, 2001, a prison administrator pulled aside a makeshift curtain that Guzmán had draped across the entrance to his cell and shouted, “He’s escaped!” A subsequent investigation determined that Guzmán had hidden in a laundry cart pushed by a paid accomplice. But many in Mexico speculate that he didn’t have to bother with subterfuge. Guzmán controlled Puente Grande so thoroughly by the time of his exit that he might as well have walked out the front door. Criminal charges were eventually brought against seventy-one people who worked at the prison, including the warden.</p> <p>If Chapo’s escape suggested that the Mexican political system had been corroded by drug money, his subsequent years as a fugitive did not diminish this impression. He retreated to Sinaloa and expanded his operations, launching violent turf wars with rival cartels over control of prized entry points along the U.S. border. The sociologist Diego Gambetta, in his 1993 book “The Sicilian Mafia,” observes that durable criminal enterprises are often woven into the social and political fabric, and part of their “intrinsic tenacity” is their ability to offer certain services that the state does not. Today on the streets of Culiacán you see night clubs, fortified villas, and an occasional Lamborghini. Chapo and other drug lords have invested and laundered their proceeds by buying hundreds of legitimate businesses: restaurants, soccer stadiums, day-care centers, ostrich farms. Juan Millán, the former state governor of Sinaloa, once estimated that sixty-two per cent of the state’s economy is tied up with drug money. Sinaloa remains poor, however, and Badiraguato, the municipality containing Guzmán’s home village, is one of the most desperate areas in the state. There had always been some sympathy for the drug trade in Sinaloa, but nothing deepens sympathy like charity and bribes. Eduardo Medina Mora, Mexico’s Ambassador in Washington, described Guzmán’s largesse in the state: “You are financing everything. Baptisms. Infrastructure. If someone gets sick, you provide a little plane. So you have lots of local support, because you are Santa Claus. And everybody likes Santa Claus.”</p> <p>Mexico’s municipal police were poorly trained, poorly paid, and poorly equipped, rendering them susceptible to bribery. “In practical terms, organized crime literally privatized the municipal police forces across many parts of the country,” one senior Mexican official told me. Guzmán’s influence over the public sector was not confined to law enforcement. Last year, a former bodyguard for the current governor of Sinaloa, Mario López Valdez, released a series of YouTube videos in which he described accompanying López Valdez, who had just taken office, on a trip to meet with Guzmán. In one video, the bodyguard played a recorded conversation in which the Governor appeared to instruct his subordinates not to antagonize the Sinaloa cartel—and, instead, to crack down on its rivals. López Valdez insisted that the recording was doctored. Last August, the bodyguard was discovered beside a road in Sinaloa. He had been decapitated.</p> <p>As long as Guzmán remained in the mountains, the inhospitable terrain and the allegiance of locals appeared to guarantee his safety. In 2009, Dennis Blair, President Barack Obama’s national intelligence director, met with Guillermo Galván, who was then Mexico’s Secretary of Defense. Galván told him that everybody knew, roughly, where Guzmán was. The challenge was taking him into custody. According to a diplomatic cable that was later released by WikiLeaks, Galván explained that Guzmán was believed to move among a dozen or so ranches, and to be protected by up to three hundred armed men. The peaks of the Sierra Madre Occidental are steep and jagged, and the roads that vein their contours often taper to a single dirt track. An armored convoy would be spotted by Guzmán’s lookouts well before it arrived at its destination. And if a Blackhawk helicopter was dispatched to attack his outpost he would hear it thundering across the valley from miles out, leaving plenty of time to flee.</p> <p>More recently, however, intelligence collected by Mexican authorities and the D.E.A. indicated that Guzmán might be changing his habits. There is a saying in the Mexican drug trade that it is better to live one good year than ten bad ones. Many young men enter the industry expecting to enjoy a decadent life for a short time before being incarcerated or killed. Young narcos behave recklessly: they go to night clubs, they race Bentleys, and they post pictures of themselves online with their co-conspirators (and with the occasional dead body). The only traffickers in Sinaloa who beat the odds are those who are content to follow a more austere life in the mountains. Until lately, Guzmán had taken that approach. But because he was tired, or married to a much younger woman, or overconfident of his ability to escape, Guzmán began spending time in Culiacán and other cities. “Here’s a guy who has made hundreds of millions of dollars in the drug trade, and he’s living like a pauper up in the mountains,” Mike Vigil, a former D.E.A. agent who worked in Mexico for many years, told me. “He likes the fiestas. He likes the music. He likes to dance.” Another law-enforcement official speculated that, though Guzmán was accustomed to a rustic life, Emma Coronel was not. “She’s not much of a mountain person,” he said, adding that they had twin daughters, and, even though Guzmán was a fugitive, his wife was adamant that he be present in the girls’ lives: “She would go out of her way to maintain that family life.”</p> <p>Guzmán had other weaknesses. “He loves the gourmet food,” a D.E.A. official told me. From time to time, he would be spotted at an elegant restaurant in Sinaloa or in a neighboring state. The choreography was always the same. Diners would be startled by a team of gunmen, who would politely but firmly demand their telephones, promising that they would be returned at the end of the evening. Chapo and his entourage would come in and feast on shrimp and steak, then thank the other diners for their forbearance, return the telephones, pick up the tab for everyone, and head off into the night.</p>    <p>It has been reported, erroneously, that Guzmán used a satellite phone; in fact, his favored communication device was the BlackBerry. Like many narcos, he was suspicious of satellite phones, because most of the companies that manufacture them are American and the devices are relatively easy for law-enforcement officials to compromise. But the BlackBerry is made by a Canadian company, and Guzmán felt more comfortable using one. This trust was misplaced: by early 2012, the D.E.A. had homed in on Guzmán’s BlackBerry, and could not only monitor his communications but also use geolocation technology to triangulate his signal.</p> <p>That February, the agency confirmed that Guzmán had travelled to Los Cabos for a liaison with a prostitute. He had been married at least three times, and he had relationships with many mistresses; nevertheless, he appears to have had an unflagging appetite for paid companionship. (Numerous current and former officials noted Guzmán’s prodigious consumption of Viagra. “He ate it like candy,” one said.) The D.E.A. agents who monitored his e-mails and texts marvelled at the extent to which his communications seemed focussed not on managing his multinational empire but on juggling the competing demands of his wife, his ex-wives (with whom he remained cordial), his girlfriends, and his paid consorts. “It was like ‘Peyton Place,’ ” a former law-enforcement official who kept track of the communications told me. “It was a non-stop deal.”</p> <p>After authorities traced the BlackBerry signal to a mansion on a cul-de-sac in a wealthy enclave near the coast, Mexican troops burst through the front door of the building. Whether or not Guzmán had been alerted in advance remains unclear, but he had enough time to sneak out the back of the property; he went to an adjacent resort, where he blended into a crowd of vacationers before moving on. Over the next three days, the authorities pursued him as he moved around the city, desperately trying to arrange an escape route to the mountains.</p> <p>At one point during the chase, Guzmán must have realized that his BlackBerry had been compromised, and decided to turn this setback to his advantage. He met up with a subordinate and gave him the BlackBerry. Someone involved in the operation said of Guzmán, “He took us for a ride.” The authorities, unaware of the handoff, chased the signal around Los Cabos, until they finally pounced on the sacrificial subordinate. While they were occupied with arresting him, Chapo made it into the desert, where a private plane picked him up and flew him back to the safety of the Sierra Madre.</p> <p>“He changed it up after Los Cabos,” one U.S. law-enforcement official told me, adding a line worthy of a <em>narcocorrido:</em> “He’s an illiterate son of a bitch, but he’s a street-smart motherfucker.” Rather than switch BlackBerrys, as he had done in the past, Guzmán now appeared to have stopped communicating altogether.</p> <p>Like bin Laden, he might have chosen to rely on couriers. But a courier system is too inefficient for the fast pace of the narcotics trade, and so, as U.S. and Mexican authorities eventually discovered, Chapo devised an elaborate solution. In the past, he had occasionally restricted his contact with others in the cartel by relaying his commands through a proxy. For a time, a woman known as La Voz (the Voice) served as his gatekeeper, sending and receiving messages on his behalf. After Los Cabos, Guzmán reinstated this arrangement, but with additional precautions. If you needed to communicate with the boss, you could reach him via B.B.M., BlackBerry’s instant-messaging application. (Guzmán had apparently learned to read and write well enough to communicate in the shorthand of instant messages.) Your message would go not directly to Guzmán, however, but to a trusted lieutenant, who spent his days in Starbucks coffee shops and other locations with public wireless networks. Upon receiving the message, the lieutenant would transcribe it onto an iPad, so that he could forward the text using WiFi—avoiding the cellular networks that the cartel knew the authorities were trolling. The transcribed message would be sent not to Guzmán but to a second intermediary, who, also using a tablet and public WiFi, would transcribe the words onto <em>his</em> BlackBerry and relay them to Guzmán. Although Guzmán continued to use a BlackBerry, it was almost impossible to track, because it communicated with only one other device. When he received your message, his reply would be relayed back to you through the same indirect means. Many members of the cartel did not realize that when they wrote to the boss and received an answer, every word had been transmitted via two intermediaries. This is sometimes described as a “mirror” system, and it is fiendishly difficult for authorities to penetrate (especially when the transcribers keep moving from one WiFi hot spot to another). Nevertheless, by studying the communications patterns of the cartel, analysts at the Special Operations Division of the D.E.A. eventually grasped the nature of the arrangement. They resolved to focus on the small ring of logistical facilitators surrounding Guzmán, to identify the mirrors that he was using, and, ultimately, to target their communications.</p> <p>In early February of this year, when the special-forces unit from <small>SEMAR</small> began making forays into Sinaloa, it was the first time that Mexico’s marines had ever pursued such a significant operation in the state. Unlike the Mexican Army—which tended to move slowly, and always informed state authorities before conducting an operation, even when those authorities were corrupt—the marines were nimble and secretive. They mobilized rapidly, on Blackhawk helicopters, and did not ask permission before initiating raids. The marines pursuing Guzmán had seen intense combat in recent years, battling the Zetas cartel in northeast Mexico. They were veterans of a 2009 firefight that had killed a former associate of Guzmán’s, Arturo Beltrán Leyva, during a raid in Cuernavaca. One of the marines in the unit, a young officer from Tabasco named Melquisedet Angulo Córdova, was killed in the shoot-out. He was buried with full military honors. Shortly after his funeral, gunmen charged into a home where his family had gathered to mourn, and murdered his mother, his brother, his sister, and his aunt.</p> <p>The warning could not have been clearer, yet, according to people who know the <small>SEMAR</small> unit, the marines grew more determined to bring down the traffickers. They now made a fetish of secrecy. Whenever they were photographed in public, they followed the custom of other élite security forces in Mexico and wore black masks over their faces. They implemented clever safeguards against penetration by the cartels. Apart from the admiral who commanded them and a few senior personnel, none of them knew where they were headed or who their target might be until they boarded a Blackhawk to undertake the mission. Several days before an operation, the commandos were obliged to surrender their cell phones, to protect against leaks.</p> <p>The first important arrest of Operation Gargoyle occurred on February 13th, when the <small>SEMAR</small> unit apprehended a group of Sinaloa assassins on a highway outside Culiacán. The marines confiscated the men’s phones and sent them off for analysis. Because cartel members frequently shed phones, a single device can offer an intelligence windfall if it contains current numbers for other members of the organization. In American debates over the National Security Agency’s warrantless collection of “metadata,” this is one reason that many authorities have been quick to defend these techniques; a constellation of dialled phone numbers can be used to build a “link chart” exposing the hierarchy of an organization.</p> <p>Using information extracted from the phones collected in the arrest, the marines and the D.E.A. began to focus on a trafficker named Mario Hidalgo Argüello. A plump-cheeked man with a droopy mustache and a crooked boxer’s nose, he was a veteran of Mexico’s special forces who had switched sides to work for the traffickers. Within the cartel, he was known as El Nariz—the Nose. Now that Guzmán was spending more time in urban areas, his entourage had become very small. Nariz was part of this privileged circle, serving as Guzmán’s personal assistant and errand boy.</p> <p>In Culiacán, Guzmán rarely spent consecutive nights in the same bed. He rotated from house to house and seldom told those around him—even Nariz—where his next destination was, until they were en route. Guzmán had a personal chef, an attractive young woman who accompanied him everywhere he travelled. He is said to have feared poisoning, and sometimes made his underlings taste food before he would eat it. But one D.E.A. agent said of the chef, “She’s absolutely a great cook. So maybe the whole personal-chef thing was more hedonism than paranoia.”</p>    <p>Guzmán also liked takeout food, and, on the night of February 16th, he sent Nariz out to pick up an order. Guzmán’s life had become largely nocturnal, and he ate dinner very late. That evening, he was sleeping at a safe house that belonged to his ex-wife Griselda López. By the time Nariz left work, it was already past midnight. Nariz returned to his own house in Culiacán, and discovered that the commandos from <small>SEMAR</small> had been waiting for him.</p> <p>Under questioning by the marines, Nariz admitted that Guzmán was hiding in the city, and gave the address. “He flipped right away,” an American law-enforcement official told me. Just before dawn, the marines arrived at a cream-colored two-story house on Río Humaya Street, in the middle-class neighborhood of Libertad. There were bars on the windows, but that was standard in Culiacán. The marines readied their weapons and produced a battering ram, but when they moved to breach the front door it didn’t budge. A wooden door would have splintered off its hinges, but this door was a marvel of reinforced steel—some of the marines later likened it to an airlock on a submarine. For all the noise that their efforts made, the door seemed indestructible. Normally, the friction of a battering ram would heat the steel, rendering it more pliable. But the door was custom-made: inside the steel skin, it was filled with water, so that if anyone tried to break it down the heat from the impact would not spread. The marines hammered the door again and again, until the ram buckled and had to be replaced. It took ten minutes to gain entry to the house.</p> <p>The marines streamed through a modest kitchen and into a series of windowless rooms. They noticed surveillance cameras and monitors everywhere. A gaudy oil painting of a bucking bull, stuck full of swords but still defiant, hung on one wall. But there was nobody in the house. In a bathroom on the ground floor, they discovered a bathtub that had been raised from its base, on hydraulic lifts, at a forty-five-degree angle, revealing a dark opening leading to a steep set of stairs: a tunnel.</p> <p>In the early days of Guzmán’s career, before his time at Puente Grande, he distinguished himself as a trafficker who brought an unusual sense of imagination and play to the trade. Today, tunnels that traverse the U.S.-Mexico border are a mainstay of drug smuggling: up to a mile long, they often feature air-conditioning, electricity, sophisticated drainage systems, and tracks, so that heavy loads of contraband can be transported on carts. Guzmán invented the border tunnel. A quarter of a century ago, he commissioned an architect, Felipe de Jesús Corona-Verbera, to design a grocery store that served as a front company, and a private zoo in Guadalajara for his collection of tigers, crocodiles, and bears. By this point, Guzmán was making so much money that he needed secure locations in which to hide it, along with his drugs and his weapons. So he had Corona-Verbera devise a series of <em>clavos</em>, or stashes—secret compartments under the beds in his homes. Inevitably, a bolder idea presented itself: if you could dig a <em>clavo</em> beneath a house near the U.S. border, why not continue digging and come out on the other side? Guzmán ordered Corona-Verbera to design a tunnel that ran from a residence in Agua Prieta, immediately south of the border, to a cartel-owned warehouse in Douglas, Arizona. The result delighted him. “Corona made a fucking cool tunnel,” he said. Since then, U.S. intelligence has attributed no fewer than ninety border tunnels to the Sinaloa cartel.</p> <p>When the marines began breaking into the house on Río Humaya Street, Guzmán was inside, as was a bodyguard. As the battering ram clanged against the door, they moved quickly into the ground-floor bathroom. Chapo activated the escape hatch by pushing a plug into an electrical outlet by the sink while flicking a hidden switch on the side of the vanity mirror. Suddenly, the caulk around the rim of the bathtub broke and the tub rose from its tiled frame. The caulk had camouflaged the escape hatch; even the bodyguard might have been unaware of its existence before Guzmán turned on the hydraulic lift.</p> <p>They scrambled down the steps into a narrow passage. The space was lighted, but very tight, and they moved quickly, knowing that they had only a slight head start on the marines. They reached a small portal resembling the door of a bank safe, where the tunnel they were in connected to the main sewer system of Culiacán; crawling through this opening, they entered a cylindrical tunnel. The passage was unlit and less than five feet high; nevertheless, they splashed through the dirty, shallow water at high speed, as if Guzmán had rehearsed this escape.</p> <p>By the time the <small>SEMAR</small> commandos entered the tunnel, Guzmán had been running for more than ten minutes. A tunnel is an exceedingly dangerous environment in which to stalk someone who is armed: if he should turn and fire at you, he doesn’t even need to aim—one of the ricocheting bullets will likely hit you. But the marines did not hesitate. In the streets of Culiacán, meanwhile, dozens of troops were in position, ready to pursue Guzmán when he returned above ground. In the sky, a covert U.S. drone looked down on the city, poised to track the fugitive if he emerged from a manhole and fled through the streets.</p> <p>Meanwhile, Chapo ran through the sewers, like Harry Lime in “The Third Man.” The tunnel forked, and at one juncture the marines were momentarily flummoxed, unable to tell which path he had taken. Then they spotted a tactical vest on the ground—Guzmán or the bodyguard must have shed it—and charged onward in that direction. Eventually, the marines emerged at a storm drain by the banks of a muddy river, more than a mile from the point where Guzmán had entered the tunnel. Once again, he had vanished.</p> <p>Two days later, on February 19th, President Obama, who was visiting Mexico City, held a press conference with President Peña Nieto. Obama praised the “excellent coöperation between the United States and Mexico” on criminal-justice issues. When Peña Nieto came into office, in 2012, many Washington officials had doubts about his determination to fight the cartels. His predecessor, Felipe Calderón, had launched an unprecedented assault against drug trafficking, deploying fifty thousand troops to battle the traffickers in the streets; the armed forces pursued a “kingpin strategy,” seeking to dismantle drug syndicates by killing or capturing their leaders. Calderón’s approach received strong financial and material support from Washington. But the campaign was a resounding failure: the death toll in Mexico spiralled as the cartels fought daylight gun battles with the authorities and among themselves. In Ciudad Juárez, one of the flashpoints in the conflict, the annual murder rate jumped from about three hundred in 2007 to more than three thousand in 2010.</p> <p>The carnage might have been somewhat redeemed had Calderón succeeded in curtailing the <em>narcotraficantes</em>. But, as Ioan Grillo observes in his recent book, “El Narco,” “In the drug business, it seems, a war economy functions perfectly well.” The flow of narcotics across the border never diminished significantly, and, as cartels like Sinaloa and the Zetas vanquished smaller competitors, they consolidated territorial control, growing more powerful and more grotesque in the process. “Corpse messages”—piles of dismembered bodies—were left on major street corners. Mexican voters who went to the polls in 2012 were weary of the violence; Peña Nieto, a youthful-looking former governor who represented the Partido Revolucionario Institucional, or <small>PRI</small>, which had dominated Mexican politics for much of the past century, promised a fresh start. He pledged to focus not on attacking the cartels but on reducing the killing—though his plan for achieving this met with skepticism. In the past, <small>PRI</small> officials had largely countenanced drug trafficking, in exchange for well-placed bribes, and it wasn’t clear if Peña Nieto was sincere about pursuing a different path.</p> <p>For years, U.S. law-enforcement officers had chafed at the pretense that they were merely “advising” their Mexican counterparts in the fight against the narcos; some of them wanted American armed forces to have wide operational latitude on the ground, as they had once had in Colombia. Calderón had come closer to tolerating such a scenario than any previous Mexican head of state had. But Peña Nieto indicated that he preferred to maintain greater distance. When young Mexican officers study their nation’s military history, the curriculum dwells, inescapably, on the many invasions by the United States; the prospect of an overbearing American law-enforcement presence south of the border offended many Mexicans’ sense of sovereignty.</p>    <p>Soon after Peña Nieto assumed office, he declared that all initiatives led or assisted by the U.S. must be routed through an office in Mexico’s Ministry of the Interior, which became known as “the single window.” It was especially surprising, then, when Peña Nieto’s administration began capturing or killing some of the country’s most brutal drug kingpins, often in close collaboration with the U.S. Last July, the authorities arrested Miguel Ángel Treviño Morales, one of the leaders of the Zetas, who sometimes burned his victims alive. The next month, military operatives apprehended the leader of the Gulf cartel—El Pelón, or Baldy—who was known for blindfolding his enemies and torturing them to death. For Peña Nieto, establishing rhetorical distance from the gringos may have created the political latitude for him to collaborate with them.</p> <p>At the time of the Obama meeting, the <small>SEMAR</small> unit was still pursuing Guzmán in Culiacán. (This was a departure: Mexican armed forces had generally retreated to their bases following a failed attempt to apprehend him.) After the marines emerged from the sewers without capturing him, they discovered that the house on Río Humaya Street was connected not just to Culiacán’s sewer system but, through the sewers, to six other houses, each similarly furnished and appointed, and each with its own bathtub escape hatch. Guzmán had been shuttling nightly among these houses. Information from one of Guzmán’s captured associates led the marines to a nearby warehouse, where they uncovered a cache of heavy weaponry and more than three tons of cocaine and methamphetamine. Some of the drugs had been concealed inside plastic cucumbers and bananas, in preparation for a surreptitious journey across the border.</p> <p>The marines knew that, in addition to the safe houses and the escape routes, Guzmán had aides who could provide him with a new BlackBerry or a ride out of town. So <small>SEMAR</small> occupied each safe house it discovered, and focussed on pursuing the men in Guzmán’s entourage, on the theory that if they cut him off from his support network he would no longer have a place to hide. What had started as a covert operation became overt as Mexican forces attempted to heighten the pressure on Chapo. Eduardo Sánchez, the government spokesman, told me that authorities established conspicuous roadblocks “so that Mr. Guzmán could feel that we were after him.”</p> <p>Soon after the escape in the tunnel, the marines arrested Manuel López Osorio, another former special-forces officer who had joined Guzmán’s inner circle; he went by the name El Picudo (Pointy Nose). He, too, became coöperative under questioning, and gave up a significant detail. Picudo said that he had picked up Guzmán and the bodyguard by a storm drain on the outskirts of Culiacán. He had driven them south of the city, where they met up with another aide and switched vehicles. According to Picudo, the bodyguard Guzmán was travelling with was his most trusted employee: Carlos Hoo Ramírez, who was called El Condor.</p> <p>The marines knew who Condor was, and raided his house in Culiacán. It was empty. They had also been monitoring his BlackBerry communications, but the device appeared to be turned off. Suddenly, on February 20th, it came to life: he was sending a text. The authorities traced the signal and saw that it came from the port city of Mazatlán, a hundred and forty miles to the southeast. In light of the debacle in Los Cabos, the <small>SEMAR</small> operators and their American colleagues worried that Guzmán might have already left Mazatlán. He enjoyed considerable protection in the city, where he had often received shipments from India and China of the precursor chemicals used to manufacture meth. But it would be folly to move from one major population center to another, and, judging from Guzmán’s past behavior, he was probably already back in the Sierra Madre.</p> <p>By this point, federal authorities in Mexico City had learned about the botched operation in Culiacán, and the three-week window before the <small>SEMAR</small> redeployment was nearly closed. But, if Condor was so indispensable to the drug lord, capturing him could provide valuable intelligence and squeeze Guzmán even further. So the marines flew down to the coast.</p> <p>Mazatlán is a resort town popular with retirees from the U.S. and Canada. It has long been a corridor for narcotics trafficking, but, as uncontested Sinaloa territory, it has been spared the severe internecine violence that has plagued more disputed areas. On the night of Friday, February 21st, about forty marines assembled in the city, along with a small contingent of agents from the D.E.A., the U.S. Marshals, and the Department of Homeland Security. The marshals, who specialize in locating fugitives, had been able to trace the signal on Condor’s BlackBerry to the Hotel Miramar, a white, twelve-story condominium building with three columns of half-moon balconies overlooking the Pacific. Geolocation technology can trace a signal to a given city block or building, but not necessarily determine where in the building the device is situated. So, in the early hours of Saturday morning, the marines fanned out, forming a perimeter around the property. Someone consulted the registry and discovered that two apartments had been rented the previous day. A team of marines climbed to the sixth floor and burst into one of the apartments, where they discovered two groggy tourists, who were recovering from an evening of partying. (One of them, an American, thought that their room had been stormed because they had been smoking marijuana. The marines were perplexed when he produced, from his wallet, a California medical-marijuana card.)</p> <p>Meanwhile, on the fourth floor, a team of six marines approached Apartment 401, where they discovered Condor standing guard and holding an assault rifle. He raised his weapon only for a moment, since it was obvious that he was outnumbered. Guzmán’s decision to jettison his huge security force had allowed him to move around quickly and inconspicuously, but he was left essentially defenseless. The commandos needed no battering ram as they crashed through a flimsy wooden door, shouting, “Marines!”</p> <p>They entered a two-bedroom apartment with potted plants, cheap furniture, and a white tile floor. In one bedroom, the marines found two women: the chef and a nanny, who had been sleeping with Guzmán’s two-year-old twins, Mali and María Joaquina. A pink Pack ’n Play—which matched the girls’ miniature pink suitcases—had been set up. The marines raced to the master bedroom in the back, where they discovered Emma Coronel, who had been sleeping. “Don’t kill him!” she shrieked.</p> <p>Guzmán had scrambled out of bed in his underwear, grabbed an assault rifle, and darted into a small bathroom. “Don’t kill him!” Coronel pleaded again. “He’s the father of my children!” The standoff lasted only a few seconds, with the marines bellowing and Coronel screaming. Then Chapo shouted, “O.K., O.K., O.K., O.K.!” and extended his empty hands through the bathroom doorway.</p> <p>It had been a stunningly swift operation: less than three minutes after the marines stormed the apartment, Guzmán surrendered. No one would have imagined such a legendary outlaw going out in anything but a firefight. But <small>SEMAR</small> had developed a reputation as an outfit that shoots first and asks questions later. “They notoriously kill everybody in the room when there is the slightest provocation,” an American law-enforcement official who has worked with <small>SEMAR</small> told me. With his wife and daughters present, Guzmán may have realized that the only way to spare their lives was to surrender.</p> <p>When the marines searched the Miramar apartment, they found a blue vinyl wheelchair: Guzmán had entered the building pretending to be a frail old man. But when they took him into custody they discovered that he looked much as he had in the earlier photographs. His teeth were a little pearlier—he’d had them capped. His hair and his mustache were still thick and jet black. (In the house on Río Humaya Street, in Culiacán, the marines discovered a bottle of hair dye.) They got him dressed in a pair of black jeans and a white shirt, then escorted him out of the building and around the corner to a dirt soccer field, where he was placed on a Blackhawk and transported to a nearby naval base. A Learjet then took him to Mexico City. As the marines frog-marched him out of a hangar at the airport, journalists photographed him looking furtively at his captors. His face was bruised and swollen, which <small>SEMAR</small> attributes not to any rough handling but to dings that he had received while sprinting through the dark tunnels beneath Culiacán. The marines also noticed bruises and cuts on his feet, and learned that when he fled the house on Río Humaya Street he didn’t have time to grab his shoes; he had run through the tunnels barefoot.</p> <p>Guzmán was gruff but respectful with his captors. He had been planning to leave for the mountains that day, he told them. If the marines had arrived just a few hours later, he would have been gone. “I can’t believe you got me,” he said.</p>    <p>At eleven-forty-two that morning, Peña Nieto announced the capture on Twitter: “I acknowledge the work of the security agencies of the Mexican state in pulling off the apprehension of Joaquín Guzmán Loera in Mazatlán.” U.S. officials had already leaked the news to the Associated Press, but Peña Nieto wanted to be certain that his troops had the right man. In the summer of 2012, Mexican authorities announced that they had captured Guzmán’s son Alfredo, and held a press conference in which they paraded before the cameras a sullen, pudgy young man in a red polo shirt. A lawyer representing the man then revealed that he was not Guzmán’s son but a local car dealer named Félix Beltrán. Guzmán’s family chimed in, with barely suppressed glee, that the young man in custody was not Alfredo. In another recent case, officials in Michoacán announced that they had killed the infamous kingpin Nazario Moreno, a triumph that was somewhat undercut by the fact that Moreno—who was known as El Más Loco, or the Craziest One—had supposedly perished in a showdown with government forces in 2010. (D.E.A. agents now joke that El Más Loco is the only Mexican kingpin to have died twice.)</p> <p>Fingerprints and a DNA swab confirmed that the man captured at the Miramar was indeed Guzmán. It was a huge victory for Peña Nieto and for the D.E.A., if largely a symbolic one. Nobody had any illusions that the arrest would slow down the drug trade. “If you kill the C.E.O. of General Motors, General Motors will not go out of business,” a Mexican official told me. Guzmán’s genius was always architectural, and the infrastructure that he created will almost certainly survive him. Earlier this month, five weeks after Guzmán’s apprehension, two new drug tunnels were discovered in Sinaloa territory, starting in Tijuana and emerging in the industrial outskirts of San Diego. Some believe that, even before Guzmán’s capture, his role in the organization had become largely symbolic. “He was a non-executive chairman,” Ambassador Mora told me. “An emblematic figure.”</p> <p>Even so, the arrest signified a powerful reassertion of the rule of law in Mexico. Alejandro Hope, a former senior official in Mexican intelligence, told me that the message of Operation Gargoyle is simple and resounding: “No one is beyond sanction.” Yet, almost as soon as Peña Nieto’s government took Guzmán into custody, questions arose about its ability to hold him. According to a memo sent to Attorney General Eric Holder a few hours after the Mazatlán raid, Guzmán is the subject of indictments in Arizona, California, Texas, Illinois, New York, Florida, and New Hampshire. The morning after his capture, Michael McCaul, the Texas Republican who chairs the House Homeland Security committee, announced that Guzmán should be extradited to America, telling ABC, “There is a history here—he escaped from a prison in 2001.” A federal prosecutor in New York declared that Guzmán should be tried in New York. The head of the D.E.A. office in Chicago vowed, “I fully intend for us to have him tried here.” But Mexico’s attorney general, Jesús Murillo Karam, was quick to object. Guzmán still needed to complete his original twenty-year sentence, and then face multiple new charges, before the Mexican government would consider turning him over to the U.S. Earlier this month, he announced that Mexico has “no intention” of extraditing Guzmán, citing a concern that other Mexican officials raised with me: that American authorities might flip Guzmán and grant him a reduced sentence, in exchange for his coöperation. The U.S. has a history of “reaching deals with criminals,” Karam noted. The opposition to extradition, however, could be driven by less noble concerns: flipping Guzmán might provide the American government with evidence against top Mexican officials.</p> <p>In a story that aired on the Televisa network, the Mexican journalist Carlos Loret de Mola reported that, during the flight from Mazatlán to Mexico City, Guzmán told the marines that he had killed between two and three thousand people. If this figure includes not just individuals he murdered personally but people he authorized subordinates to kill, it is surely a gross underestimate. Nobody knows exactly how many people have been killed in Mexico’s drug wars over the past decade, but between the dead and the disappeared the number likely exceeds eighty thousand. As both the instigator and the victor of some of the bloodiest battles on the border, Guzmán bears responsibility for an appalling proportion of these atrocities. His victims were overwhelmingly Mexican; one reason that the drug war has been so easy for most Americans to ignore is that very little of the violence visited upon Mexico has spilled into the U.S. During the years when Juárez was the most dangerous city on the planet—and a resident there had a greater statistical likelihood of being murdered than someone living in the war zones of Afghanistan or Iraq—El Paso, just across the border, was one of the safest cities in America. Given this record, it makes intuitive sense that Guzmán should answer for his crimes where the worst of them were committed.</p> <p>But the Mexican officials I spoke with acknowledge that the criminal-justice system in their country is fragile, and that corruption remains endemic. Last summer, an old friend of Guzmán’s, Rafael Caro Quintero, was released in the middle of the night from the prison where he had been serving a forty-year sentence for murdering a D.E.A. agent. He was sprung on a technicality by a panel of Mexican judges, under circumstances that struck many observers as suspicious. The U.S. Justice Department furiously objected that Caro Quintero still faced charges in America and declared that the Mexicans should extradite him. But he had already disappeared into the mountains.</p> <p>The prospect of a similar dead-of-night release for Chapo may not be far-fetched. The level of distrust between U.S. and Mexican officials on this issue is pronounced; indeed, one theory I heard for the Americans’ decision to leak the news of Guzmán’s capture to the Associated Press was that going public would foreclose any possibility of Mexican authorities quietly letting him go.</p> <p>“Once bitten, twice shy,” Ambassador Mora told me, maintaining there was no possibility that his country would risk the political embarrassment of allowing its most notorious convict to escape a second time. But there are plausible scenarios short of actual escape that would be troubling. According to the U.S. Treasury Department, Caro Quintero continued to operate his drug business during his years in prison, much as Guzmán did while he was at Puente Grande. Guzmán is ostensibly being held “in isolation,” at Mexico’s most secure prison, Altiplano, about fifty miles west of Mexico City. He is permitted visits not just with his lawyer but also with members of his family, many of whom have been implicated in the activities of his cartel. Shortly after the arrest in Mazatlán, Guzmán’s son Alfredo lashed out on Twitter. “The Government is going to pay for this betrayal—it shouldn’t have bitten the hand that feeds it,” he wrote. “I just want to say that we are not beaten. The cartel is my father’s and will always be my father’s. <small>GUZMÁN LOERA FOREVER.</small>” His brother, Iván, vowed revenge: “Those dogs that dared to lay a hand on my father are going to pay.”</p> <p>One curious feature of Guzmán’s capture was the fact that he was betrayed, in rapid succession, by at least two of his closest aides: Nariz and Picudo. Had either one refused to coöperate, Guzmán would likely remain free today. I was impressed, initially, by the speed with which the marines had elicited leads from these subordinates, both of them ex-members of Mexico’s special forces who had been hardened by years in the cartel. One U.S. law-enforcement official told me that it is not unusual for cartel members to start coöperating as soon as they are captured. “There’s very little allegiance once they’re taken into custody,” he said.</p> <p>But when I raised the subject with a former D.E.A. agent who has spoken to Mexican counterparts involved in the operation, he had a different explanation. “The marines tortured these guys,” he told me, matter-of-factly. “They would never have given it up, if not for that.” The D.E.A. refused to comment on the torture allegation. However, two senior U.S. law-enforcement officials told me that, though they had no specific knowledge of the Mexican authorities using torture in the operation, they “wouldn’t be surprised.” Eduardo Sánchez, the spokesman for the Mexican government, denied the allegation, and maintained that, in this and other operations, “federal officials, agents, and officers perform their duties strictly within the applicable legal framework and with utmost respect for human rights.” But the Mexican armed forces have been implicated before in the use of torture as an interrogation technique in the pursuit of drug traffickers. A 2011 Human Rights Watch report found that members of Mexico’s security services “systematically use torture to obtain forced confessions and information about criminal groups,” and documented the use of such techniques as “beatings, asphyxiation with plastic bags, waterboarding, electric shocks, sexual torture, and death threats.” The broad employment of brutal techniques, coupled with the high profile and the urgency of the hunt for Guzmán, makes it seem all the more plausible that Mexican authorities used unsavory, and illegal, means to pursue him.</p>    <p>What will become of the Sinaloa cartel remains unclear. Chapo’s top associates, Ismael Zambada and Juan José Esparragoza, are both older than he is, and seem unlikely to assume day-to-day management. Guzmán’s sons would appear to be candidates, but, as the coddled children of a wealthy trafficker, they may be more enamored of the narco life style than of the business itself. “The drug trade is one of the few really meritocratic sectors in the Mexican economy,” Alejandro Hope said. “Being the son of Chapo Guzmán doesn’t necessarily guarantee you’ll be his successor.”</p> <p>But the question of who will inherit the Sinaloa cartel may be somewhat beside the point, because, well before Guzmán’s capture, the landscape of crime in Mexico had begun to shift. Whereas Sinaloa is a traditional drug cartel, focussing chiefly on the manufacture and export of narcotics, newer groups, such as the Zetas and the Knights Templar, have diversified their money-making activities to include extortion, human trafficking, and kidnapping for ransom. With cocaine consumption declining in the U.S., and marijuana on a path toward widespread legalization, a Darwinian logic is driving the cartels’ expansion into more parasitic varieties of crime. Organizations that once concentrated exclusively on drugs now extract rents from Mexico’s oil industry and export stolen iron ore to China; the price of limes in U.S. grocery stores has doubled in the past few years because the cartels are taxing Mexico’s citrus farmers. “We don’t have a drug problem—we have a crime problem,” more than one Mexican official told me, and, as the criminal syndicates continue to evolve, this dynamic could end up rendering organizations like Guzmán’s obsolete. The prohibition of narcotics may have created a monster, but, as Alejandro Hope pointed out, even if you decriminalized all drugs tomorrow the monster would find a way to survive. “You can’t legalize kidnapping,” he said.</p> <p>Some speculate that Guzmán wasn’t really captured against his will: seeing that his time had come, he chose to enjoy a quiet retirement behind bars. One by-product of the culture of corruption in Mexico is a reflexive cynicism about any official story put out by the government. Several years ago, a fearless journalist named Anabel Hernández published a book about the Sinaloa cartel, called “Los Señores del Narco.” (It was recently published in English, under the title “Narcoland.”) Hernández argued that Guzmán’s influence was so pervasive, and the Mexican political system so thoroughly rotted by graft, that the whole Chapo saga could be interpreted as a grand charade. Guzmán was “imprisoned” at Puente Grande, but he was actually running the place. He “escaped,” when in reality, Hernández suggests, the President of Mexico at the time, Vicente Fox, personally authorized his release, in exchange for a colossal bribe. (Fox has angrily denied this accusation.) Guzmán spent years as a “fugitive,” though everyone knew where he was, and the authorities were simply lying when they claimed that they “could not catch him.” Hernández’s book sold more than a hundred thousand copies in Mexico—her taste for conspiracy and her tone of bitter knowingness struck a chord. So it should come as no surprise that many observers believe that Guzmán’s “capture” in Mazatlán was a theatrical event directed by the drug lord himself. When I reached Hernández and asked her what she made of the arrest, she challenged the premise of my question. “<em>If</em> Chapo Guzmán has been captured,” she said. “<em>If</em> that is the real story.” She is not convinced that the man who was photographed in Mazatlán, and whose DNA was tested, is the real Chapo.</p> <p>When Guzmán was questioned in prison by authorities, he, too, seemed to suggest a case of mistaken identity. He maintained his innocence, his rote replies taking on a smug absurdity:</p> <p>Q: May the deponent say to which organization he belongs.</p> <p>A: I don’t belong to any cartel. . . . I am a farmer.</p> <p>His products were not cocaine, heroin, marijuana, and meth, Guzmán insisted, but corn, sorghum, beans, and safflower. He made twenty thousand pesos a month, he continued, or about eighteen thousand dollars a year. In a poll of Mexicans conducted after the arrest, half the respondents said that Guzmán was more powerful than the government of Mexico; in Culiacán, in the days after his capture, hundreds of protesters took to the streets, holding signs demanding his release.</p> <p>Guzmán’s wife, Emma Coronel, was born in California, and she retains U.S. citizenship. After the raid in Mazatlán, the authorities let her go, along with her daughters, and she has since disappeared from public view. She was only seventeen when she caught Chapo’s eye, in 2006, while competing in a beauty contest at the annual Festival of Coffee and Guava, in her home state of Durango. Her uncle Ignacio (Nacho) Coronel was one of Chapo’s closest associates at the time, and when the cartel boss conveyed his interest she may have had little choice but to indulge it. A <em>norteño</em> band, Los Alegres del Barranco, was playing at the festival. Like Chapo, the band members came from the Badiraguato area, and they had found success playing <em>narcocorridos</em> about the cartel. They are rumored to have performed at private parties for Guzmán and his associates; they even toured the U.S., with gigs in Los Angeles, Las Vegas, and Miami.</p> <p>After the raid, Los Alegres posted a new single, “La Captura de Joaquín Guzmán,” on YouTube. A jaunty guitar-and-accordion number, it’s not so different from their other ballads, apart from the words. “They don’t know what they’ve done, and what kind of trouble they’ve got themselves in, the people who ordered my arrest,” the band sings, assuming the voice of the kingpin. “It won’t be long before I return to La Tuna and become a fugitive again. That’s what the people want.” <span>♦</span></p> <section><p><em>Sign up for the daily newsletter.</em><em>Sign up for the daily newsletter: the best of The New Yorker every day.</em></p>  \t<div>      \t        </div></section>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\n    \t\t\t\t\t\t</div>\n\n\t\t\t\t\t\t\n\t\t\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t", "thumbnail": "http://www.newyorker.com/wp-content/uploads/2014/05/140505_r24957-1200x630-1457644671.jpg"}