{"site_name": "The New Yorker", "description": "It was easy for Megan Phelps-Roper to tweet things that made people cringe—she knew that they were evil or deluded by God. Credit Photograph by Katy Grannan for The New Yorker On December 1, 2009, to commemorate World AIDS Day, Twitter announced a promotion: if users employed the hashtag #red, their tweets would appear highlighted in red. Megan Phelps-Roper, a twenty-three-year-old legal assistant, seized the opportunity. “Thank God for AIDS !” she tweeted that morning. “You won’t repent of your rebellion that brought His wrath on you in this incurable scourge, so expect more & worse! #red.” As a member of the Westboro Baptist Church, in Topeka, Kansas, Phelps-Roper believed that AIDS was a curse sent by God. She believed that all manner of other tragedies—war, natural disaster, mass shootings—were warnings from God to a doomed nation, and that it was her duty to spread the news of His righteous judgments. To protest the increasing acceptance of homosexuality in America, the Westboro Baptist Church picketed the funerals of gay men who died of AIDS and of soldiers killed in Iraq and Afghanistan. Members held signs with slogans like “ God Hates Fags ” and “ Thank God for Dead soldiers ,” and the outrage that their efforts attracted had turned the small church, which had fewer than a hundred members, into a global symbol of hatred. Westboro had long used the Internet to spread its message. In 1994, the church launched a Web site, www.godhatesfags.com, and early on it had", "videos": [], "images": ["http://www.newyorker.com/wp-content/assets/dist/img/px.gif", "http://www.newyorker.com/wp-content/assets/dist/img/px.gif", "http://www.newyorker.com/wp-content/assets/dist/img/px.gif", "http://www.newyorker.com/wp-content/uploads/2015/11/11_23_15-200.jpg", "http://www.newyorker.com/wp-content/uploads/2015/11/151123_r27316-690.jpg", "http://www.newyorker.com/wp-content/uploads/2016/02/adrian_chen.jpg", "http://www.newyorker.com/wp-content/assets/dist/img/spacer-mobile-320x240.png", "http://www.newyorker.com/wp-content/assets/dist/img/spacer-mobile-728x375.png", "http://www.newyorker.com/wp-content/uploads/2012/11/121126_r22843_p886-728x375-1447376185.jpg", "http://www.newyorker.com/wp-content/uploads/2012/11/121126_r22843_p886-320x240-1447376172.jpg", "http://www.newyorker.com/wp-content/assets/dist/img/spacer-mobile-320x240.png", "http://www.newyorker.com/wp-content/assets/dist/img/spacer-mobile-728x375.png", "http://www.newyorker.com/wp-content/uploads/2014/03/140331_r24790-728x375-1447376978.jpg", "http://www.newyorker.com/wp-content/uploads/2014/03/140331_r24790-320x240-1447376964.jpg", "http://www.newyorker.com/wp-content/assets/dist/img/px.gif", "http://www.newyorker.com/wp-content/assets/dist/img/icon/ad_choices_arrow.png", "http://www.newyorker.com/wp-content/assets/dist/img/px.gif"], "words": 10548, "date": "", "title": "Unfollow", "url": "http://www.newyorker.com/magazine/2015/11/23/conversion-via-twitter-westboro-baptist-church-megan-phelps-roper", "is_rtl": false, "author": "Adrian Chen", "html": "<div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t<figure>\n\t\t\t\t\t\t\t\t<a href=\"http://www.newyorker.com/wp-content/uploads/2015/11/151123_r27316-863.jpg\">\n\t\t\t\t\t\t\t\t\t<img src=\"http://www.newyorker.com/wp-content/uploads/2015/11/151123_r27316-690.jpg\">\t\t\t\t\t\t\t\t</a>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<figcaption>\n\t\t\t\t\t\t\t\t\t<span>It was easy for Megan Phelps-Roper to tweet things that made people cringe—she knew that they were evil or deluded by God.</span>\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<span>Credit</span> Photograph by Katy Grannan for The New Yorker\t\t\t\t\t\t\t\t\t</span>\t\t\t\t\t\t\t\t</figcaption>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</figure>\n\t\t\t\t\t\t\t<p>On December 1, 2009, to commemorate World <small>AIDS</small> Day, Twitter announced a promotion: if users employed the hashtag #red, their tweets would appear highlighted in red. Megan Phelps-Roper, a twenty-three-year-old legal assistant, seized the opportunity. “Thank God for <small>AIDS</small>!” she tweeted that morning. “You won’t repent of your rebellion that brought His wrath on you in this incurable scourge, so expect more &amp; worse! #red.”</p> <p>As a member of the Westboro Baptist Church, in Topeka, Kansas, Phelps-Roper believed that <small>AIDS</small> was a curse sent by God. She believed that all manner of other tragedies—war, natural disaster, mass shootings—were warnings from God to a doomed nation, and that it was her duty to spread the news of His righteous judgments. To protest the increasing acceptance of homosexuality in America, the Westboro Baptist Church picketed the funerals of gay men who died of <small>AIDS</small> and of soldiers killed in Iraq and Afghanistan. Members held signs with slogans like “<small>God Hates Fags</small>” and “<small>Thank God for Dead soldiers</small>,” and the outrage that their efforts attracted had turned the small church, which had fewer than a hundred members, into a global symbol of hatred.</p> <p>Westboro had long used the Internet to spread its message. In 1994, the church launched a Web site, www.godhatesfags.com, and early on it had a chat room where visitors could interact with members of Westboro. As a child, Phelps-Roper spent hours there, sparring with strangers. She learned about Twitter in 2008, after reading an article about an American graduate student in Egypt who had used it to notify his friends that he had been arrested while photographing riots. She opened an account but quickly lost interest—at the time, Twitter was still used mostly by early-adopting techies—until someone e-mailed Westboro’s Web site, in the summer of 2009, and asked if the church used the service. Phelps-Roper, who is tall, with voluminous curly hair and pointed features, volunteered to tweet for the congregation. Her posts could be easily monitored, since she worked at Phelps Chartered, the family law firm, beside her mother, Shirley, an attorney. Moreover, Megan was known for her mastery of the Bible and for her ability to spread Westboro’s doctrine. “She had a well-sharpened tongue, so to speak,” Josh Phelps, one of Megan’s cousins and a former member of Westboro, told me.</p> <p>In August, 2009, Phelps-Roper, under the handle @meganphelps, posted a celebratory tweet when Ted Kennedy died (“He defied God at every turn, teaching rebellion against His laws. Ted’s in hell!”) and a description of a picket that the church held at an American Idol concert in Kansas City (“Totally <small>awesome</small>! Tons going in &amp; taking pics—even tho others tried to block our signs”). On September 1st, her sister Bekah e-mailed church members to explain the utility of Twitter: “Now Megan has 87 followers and more are trickling in all the time. So every time we find something else to picket, or have some new video or picture we want to post (or just something that we see on the news and want to comment about)—87 people get first-hand, gospel commentary from Megan Marie.”</p> <p>A couple of hours after Phelps-Roper posted her tweet on World <small>AIDS</small> Day, she checked her e-mail and discovered numerous automated messages notifying her of new Twitter followers. Her tweet had been discovered by the comedian Michael Ian Black, who had more than a million followers. He was surprised that a member of the Westboro Baptist Church was on Twitter at all. “I sort of thought they would be this fire-and-brimstone sort of Pentecostal anti-technology clan that would be removed from the world,” he told me. He tweeted, “Sort of obsessed w/ @meganphelps. Sample tweet: ‘<small>AIDS</small> is God’s curse on you.’ Let her feel your love.” The director Kevin Smith and “The Office” star Rainn Wilson mocked her, as did many of their followers.</p> <div><span><span>Losing Religion Through Twitter</span><span>Megan Phelps-Roper comments on tweets she once posted for the church.</span></span></div> <p>Phelps-Roper was exhilarated by the response. Since elementary school, she had given hundreds of interviews about Westboro, but the reaction on Twitter seemed more real than a quote in a newspaper. “It’s not just like ‘Yes, all these people are seeing it,’ ” she told me. “It’s proof that people are seeing it and reacting to it.” Phelps-Roper spent much of the morning responding to angry tweets, citing Bible passages. “I think your plan is back-firing,” she taunted Black. “Your followers are just nasty haters of God! You should do something about that . . . like tell them some truth every once in a while. Like this: God hates America.” That afternoon, as Phelps-Roper picketed a small business in Topeka with other Westboro members, she was still glued to her iPhone. “I did not want to be the one to let it die,” she said.</p> <p>By the end of the day, Phelps-Roper had more than a thousand followers. She took the incident as an encouraging sign that Westboro’s message was well suited to social media. She loved that Twitter let her talk to large numbers of people without the filter of a journalist. During the next few months, Phelps-Roper spearheaded Westboro’s push into the social-media age, using Twitter to offer a window into life in the church and giving it an air of accessibility.</p> <p>It was easy for Phelps-Roper to write things on Twitter that made other people cringe. She had been taught the church’s vision of God’s truth since birth. Her grandfather Fred Phelps established the church, in 1955. Megan’s mother was the fifth of Phelps’s thirteen children. Megan’s father, Brent Roper, had joined the church as a teen-ager. Every Sunday, Megan and her ten siblings sat in Westboro’s small wood-panelled church as her grandfather delivered the sermon. Fred Phelps preached a harsh Calvinist doctrine in a resounding Southern drawl. He believed that all people were born depraved, and that only a tiny elect who repented would be saved from Hell. A literalist, Phelps believed that contemporary Christianity, with its emphasis on God’s love, preached a perverted version of the Bible. Phelps denounced other Christians so vehemently that when Phelps-Roper was young she thought “Christian” was another word for evil. Phelps believed that God hated unrepentant sinners. God hated the politicians who were allowing the United States to descend into a modern-day Sodom and Gomorrah. He hated the celebrities who glorified fornication.</p>    <p>Phelps also believed that fighting the increasing tolerance of homosexuality was the key moral issue of our time. To illustrate gay sin, he described exotic sex acts in lurid detail. “He would say things like ‘These guys are slobbering around on each other and sucking on each other,’ ” Megan said. In awe of his conviction and deep knowledge of Scripture, she developed a revulsion to homosexuality. “We thought of him as a star in the right hand of God,” she said. Westboro had started as an offshoot of Topeka’s East Side Baptist Church, but by the time Phelps-Roper was born its congregation was composed mostly of Fred Phelps’s adult children and their families.</p> <p>Nevertheless, Phelps-Roper didn’t grow up in isolation. Westboro believed that its members could best preach to the wicked by living among them. The children of Westboro attended Topeka public schools, and Phelps-Roper ran track, listened to Sublime CDs, and read Stephen King novels. If you knew the truth in your heart, Westboro believed, even the filthiest products of pop culture couldn’t defile you. She was friendly with her classmates and her teachers, but viewed them with extreme suspicion—she knew that they were either intentionally evil or deluded by God. “We would always say, They have nothing to offer us,” Phelps-Roper said. She never went to dances. Dating was out of the question. The Westboro students had a reputation for being diligent and polite in class, but at lunch they would picket the school, dodging food hurled at them by incensed classmates.</p> <p>Phelps-Roper was constantly around family. Nine of Fred Phelps’s children were still in the church, and most of them had large families of their own. Many of them worked as lawyers at Phelps Chartered. The church was in a residential neighborhood in southwest Topeka, and its members had bought most of the houses on the block around it. Their back yards were surrounded by a tall fence, creating a huge courtyard that was home to a trampoline, an in-ground pool, a playground, and a running track. They called the Westboro compound the Block, and considered it a sanctuary in a world full of evil. “We did lots of fun normal-kids stuff,” Megan said.</p> <p>The Phelps-Roper home was the biggest on the Block, and a room in the basement acted as a kind of community center for Westboro. An alcove in the kitchen had cubbies for the signs that were used in pickets. On summer afternoons, Shirley led Bible readings for young members. She had a central role in nearly every aspect of Westboro’s operations: she was its media coördinator, planned the pickets, and managed Phelps Chartered. A parade of journalists and Westboro members sought meetings with her. Louis Theroux, a British filmmaker who made two documentaries about Westboro, said, “My feeling was that there was a pecking order and there was an unacknowledged hierarchy, and at the top of it was Shirley’s family.” Starting in middle school, Megan worked side by side with Shirley; among her siblings, she had a uniquely strong bond with her mother. “I felt like I could ask her anything about anything,” Megan told me.</p> <p>Other young Westboro members regarded Shirley with a mixture of fear and respect. “Shirley had a very abrasive personality,” Josh Phelps said. But, he added, she could be remarkably tender when dispensing advice or compliments. Megan lacked Shirley’s hard edge. “She was just happy in general,” her cousin Libby Phelps, one of Megan’s close friends, told me.</p> <p>Shirley, as Westboro’s de-facto spokeswoman, granted interviews to almost any outlet, no matter how obscure or adversarial. “She was smart and funny, and would answer impertinent questions and not be offended about it,” Megan said. When reporters wanted the perspective of a young person, Shirley let them speak to Megan. In sixth grade, Megan gave her first live interview when she answered a call from a couple of radio d.j.s who wanted to speak to her mother. Megan recalls, “They thought it was hilarious, this eleven-year-old talking about hating Jews.”</p> <p>Obedience was one of the most important values that Shirley instilled in Megan. She would sum up the Bible in three words: “Obey. Obey. Obey.” The smallest hint of dissent was seen as an intolerable act of rebellion against God. Megan was taught that there would always be a tension between what she felt and thought as a human and what the Bible required of her. But giving place to rebellious thoughts was the first step down the path toward Hell. “The tone of your voice or the look on your face—you could get into so much trouble for these things, because they betray what’s in your heart,” she said. Her parents took to heart the proverb “He that spareth his rod hateth his son.” Her uncle gave them a novelty wooden paddle inscribed with the tongue-in-cheek direction “May be used on any child from 5 to 75,” and her father hung it on the wall next to the family photos. The joke hit close to home for Phelps-Roper, who was spanked well into her teens. Sometimes, she told me, “it went too far, for sure.” But, she added, “I also always knew that they were just trying to do what God required of them.”</p> <p>As she grew older, she came to find comfort, and even joy, in submitting her will to the word of God. Children in Westboro must make a profession of faith before they are baptized and become full members of the church. One day in June, when she was thirteen, her grandfather baptized her in the shallow end of the Block’s pool. “I wanted to do everything right,” she said. “I wanted to be good, and I wanted to be obedient, and I wanted to be the object of my parents’ pride. I wanted to go to Heaven.”</p> <p>Westboro started picketing in June, 1991, when Phelps-Roper was five years old. Fred Phelps believed that Gage Park, less than a mile from the Block, had become overrun with gay men cruising for sex. Phelps claimed that he was inspired to launch the Great Gage Park Decency Drive, as he called it, after one of his young grandsons was propositioned while biking through the park. The church sought redress from city officials, to no avail, so throughout the summer church members, including Megan, protested every day, walking in a circle while holding signs with messages written in permanent marker such as “<small>Warning</small>!<small> Gays in the Bushes</small>!<small> Watch Your Children</small>!” and “<small>And God Over-Threw Sodom</small>.”</p>    <p>The pickets were met with an immediate backlash from the community, but Phelps was not deterred. He had been a committed civil-rights attorney in the nineteen-sixties and seventies, one of the few lawyers to represent black Kansans in discrimination suits, before the state disbarred him, in 1979, for harassing a court reporter who failed to have a transcript ready in time. Now Westboro targeted local churches, politicians, businesses, journalists, and anyone else who criticized Phelps’s crusade. Throughout the nineties, Westboro members crisscrossed the country, protesting the funerals of <small>AIDS</small> victims and gay-pride parades. They picketed the funeral of Matthew Shepard, the gay man whose murder, in what was widely believed to be a hate crime, became a rallying cry for gay-rights activists. They picketed high schools, concerts, conferences, and film festivals, no matter how tenuous the connection to homosexuality or other sins. “Eventually, the targets broadened such that everyone was a target,” Phelps-Roper said.</p> <p>Phelps-Roper enjoyed picketing. When the targets were within driving distance, the group packed into a minivan and her grandfather saw them off from his driveway. “At five in the morning, he’d come out and give us all hugs,” she said. When they flew, she and Libby recounted “Saturday Night Live” skits. Amazing things happened on the trips. In New Orleans, they ran into Ehud Barak, the former Israeli Prime Minister, and serenaded him with an anti-Semitic parody of Israel’s national anthem. Phelps-Roper learned to hold two signs in each hand, a technique that Westboro members called the Butterfly. Her favorite slogans were “<small>God is your enemy</small>,” “<small>No Peace for the Wicked</small>,” “<small>God hates your idols</small>,” and “<small>Mourn for your sins</small>.” She laughed and sang and smiled in the face of angry crowds. “If you were ever upset or even scared, you do not show it, because this is not the time or the place,” she said. Phelps-Roper believed that she was engaged in a profound act of love. Leviticus 19:17 commands, “Thou shalt not hate thy brother in thine heart: thou shalt in any wise rebuke thy neighbour, and not suffer sin upon him.” “When you see someone is backing into traffic, you yell at them,” Phelps-Roper said. “You don’t mope around and say it’s such a good idea.”</p> <p>One of the most common questions she was asked on the picket line was why she hated gay people so much. She didn’t hate gay people, she would reply, God hated gay people. And the rest of the world hated them, too, by cheering them on as they doomed themselves to Hell. “We love these fags more than anyone,” she would say.</p> <p>In the summer of 2005, Westboro began protesting the funerals of soldiers killed in Iraq and Afghanistan, holding signs like “<small>Thank God for IEDs</small>.” “They turned the country over to the fags—they’re coming home in body bags!” Fred Phelps would say. He believed that 9/11 was God’s punishment for America’s embrace of homosexuality, but that, instead of repenting, Americans had drowned this warning in a flood of patriotism. Phelps believed that God had killed the soldiers to warn a doomed America, and that it was the church’s job to make this fact explicit for the mourners. The scale of the picketing increased dramatically. One of Phelps-Roper’s aunts checked the Department of Defense Web site every day for notifications of casualties. The outrage sparked by the soldier-funeral protests dwarfed anything that Phelps-Roper had experienced previously. Crowds of rowdy, sometimes violent counterprotesters tried to block their signs with huge American flags. A group of motorcyclists called the Patriot Guard Riders eventually began to follow Westboro members around the country, revving their engines to drown out their singing.</p> <p>Phelps-Roper picketed her first military funeral in July, 2005, in Omaha. She was nineteen years old and a sophomore at Washburn University, a secular public college in Topeka, where many Westboro children went. The Westboro members stood across the street from the church, in a quiet neighborhood in South Omaha, as the mourners filed in. “Everybody’s in close quarters, and marines in dress blues are just staring at us with—the word that comes to mind is hateful ‘disgust.’ Like ‘How could you possibly do this?’ ” Phelps-Roper said. But, before the picket, she asked her mother to walk her through the Bible passages that justified their actions. “I’m, like, O.K., it’s there,” she said. “This is right.” She added, “This was the only hope for mankind, and I was so grateful to be part of this ministry.”</p> <p>In September, 2009, when Phelps-Roper began to use Twitter in earnest, Westboro was preparing for the end of the world. Fred Phelps had preached for years that the end was near, but his sermons grew more dire after Barack Obama’s election in 2008. Phelps believed that Obama was the Antichrist, and that his Presidency signalled the beginning of the Apocalypse. The sense of looming calamity was heightened by a multimillion-dollar judgment against the church that had been awarded, in 2007, to Albert Snyder, who sued Westboro after it picketed the funeral of his son Matt, a U.S. marine killed in Iraq. Westboro members drew prophecies from the Book of Revelation about how the end might unfold. First, the Supreme Court would overturn the Snyder verdict. The country would be so enraged by Westboro’s victory that its members would be forced to flee to Israel. Obama would be crowned king of the world, then lead every nation in war against Israel. Israel would be destroyed, and only a hundred and forty-four thousand Jews who repented for killing Jesus would be spared. (Revelation says that a hundred and forty-four thousand “children of Israel” are “redeemed from among men.”) Westboro members would lead these converted Jews through the wilderness until Christ returned and ushered them into Heaven. Phelps-Roper and her family members all got passports, so that they could travel to Israel. One day, she was in the grocery store and picked up a container of yogurt with Oreo pieces. She stared at it, thinking, We won’t have modern conveniences like this in the wilderness. Is it better to learn to live without them, or to enjoy them while we can?</p> <p>Still, she had a hard time believing in aspects of the future foretold by some church members, like the idea that they would soon be living in pink caves in Jordan. “We were making specific predictions about things without having, in my mind, sufficient scriptural support,” she said. Many other members shared her bewilderment, she found, and so she turned to Twitter for answers. Most of the prophecies centered on Jews, so she found a list, published by the Jewish Telegraphic Agency, a syndicated news service, of the hundred most influential Jewish Twitter users. She created an account under the pseudonym Marissa Cohen and followed many of the people on the list, hoping to learn if Westboro’s prophecies were coming true.</p>    <p>As the prophecies were developed, Westboro expanded the focus of its preaching to include the Jewish community. Members hoped to find the hundred and forty-four thousand repentant Jews. They picketed synagogues and sent anti-Semitic DVDs to Jewish organizations. Westboro called the protests the Fateful Fig Find, after a parable in the Book of Jeremiah that compares Jews who had been captured by the Babylonians to two baskets of figs, one good and one “naughty.” Phelps-Roper thought that this initiative was more explicitly supported by the Bible than other parts of the prophecies were, so she threw herself into the effort. She wrote the church’s press release: “<small>WBC is looking for the good figs among the Christ-rejecting hypocrites</small>!” She looked at the J.T.A. list of influential Jews and saw that No. 2 was David Abitbol, a Jerusalem-based Web developer and the founder of the Jewish-culture blog Jewlicious. With more than four thousand followers and a habit of engaging with those who tweeted at him, he would be a prime target for Westboro’s message of repentance, she figured.</p> <p>On September 9, 2009, Shirley gave an interview to an Atlanta radio station, and Phelps-Roper shared a quote on Twitter. Phelps-Roper tagged Abitbol in the post so that he would see it. She wrote, “Atlanta: radio guy says ‘Finish this sentence: the only good Jew is a . . .’ Ma says ‘<small>Repentant</small> Jew!’ The only answer that suffices @jewlicious.” “Thanks Megan!” he responded. “That’s handy what with Yom Kippur coming up!” Phelps-Roper posted another tweet, spelling it out more clearly. “Oh &amp; @jewlicious? Your dead rote rituals == true repentance. We know the diff. Rev. 3:9 You keep promoting sin, which belies the ugly truth.” “Dead rote rituals?” he responded. “U mean like holding up God Hates Shrimp, err I mean Fag signs up? Your ‘ministry’ is a joke.”</p> <p>“Anybody’s initial response to being confronted with the sort of stuff Westboro Baptist Church says is to tell them to fuck off,” Abitbol told me. Abitbol is a large man in his early fifties who often has a shaggy Mohawk, which he typically covers with a Montreal Expos baseball cap. He was familiar with Westboro from its godhatesfags.com Web site. He had lived in Montreal in the nineties, and had become fascinated with the explosion of hate sites on the early Internet. “Most people, when they first get access to the Internet, the first thing they wanted to see was naked ladies,” he told me. “The first thing I wanted to see was something I didn’t have access to in Montreal: neo-Nazis and hate groups.” There were few widely available search engines at the time, so he spent hours tracking down the Web sites of Holocaust deniers, anti-Semites, and racists of all types. He and a friend eventually created a directory called Net Hate, which listed the sites along with mocking descriptions. “We didn’t want to debate them, we just wanted to make fun of them,” he said. As for the Westboro members, “I just thought they were crazy.”</p> <p>Phelps-Roper got into an extended debate with Abitbol on Twitter. “Arguing is fun when you think you have all the answers,” she said. But he was harder to get a bead on than other critics she had encountered. He had read the Old Testament in its original Hebrew, and was conversant in the New Testament as well. She was taken aback to see that he signed all his blog posts on Jewlicious with the handle “ck”—for “christ killer”—as if it were a badge of honor. Yet she found him funny and engaging. “I knew he was evil, but he was friendly, so I was especially wary, because you don’t want to be seduced away from the truth by a crafty deceiver,” Phelps-Roper said.</p> <p>Abitbol had learned while running Net Hate that relating to hateful people on a human level was the best way to deal with them. He saw that Phelps-Roper had a lot of followers and was an influential person in the church, so he wanted to counter her message. And he wanted to humanize Jews to Westboro. “I wanted to be like really nice so that they would have a hard time hating me,” he said. One day, he tweeted about the television show “Gossip Girl,” and Phelps-Roper responded jocularly about one of its characters. “You know, for an evil something something, you sure do crack me up,” Abitbol responded.</p> <p>On December 20, 2009, Phelps-Roper was in the basement of her house, for a church function, when she checked Twitter on her phone and saw that Brittany Murphy, the thirty-two-year-old actress, had died. When she read the tweet aloud, other church members reacted with glee, celebrating another righteous judgment from God. “Lots of people were talking about going to picket her funeral,” Phelps-Roper said. When Phelps-Roper was younger, news of terrible events had given her a visceral thrill. On 9/11, she was in the crowded hallway of her high school when she overheard someone talking about how an airplane had hit the World Trade Center. “Awesome!” she exclaimed, to the horror of a student next to her. She couldn’t wait to picket Ground Zero. (The following March, she and other Westboro members travelled to New York City to protest what they described in a press release as “FDNY fags and terrorists.”) But Phelps-Roper had loved Murphy in “Clueless,” and she felt an unexpected pang—not quite sadness, but something close—over her death. As she continued scrolling through Twitter, she saw that it was full of people mourning Murphy. The contrast between the grief on Twitter and the buoyant mood in the basement unsettled her. She couldn’t bring herself to post a tweet thanking God for Murphy’s death. “I felt like I would be such a jackass to go on and post something like that,” she said.</p> <p>Her hesitance reflected a growing concern for the feelings of people outside Westboro. Church members disdained human feelings as something that people worshipped instead of the Bible. They even had a sign: “<small>God hates your feelings</small>.” They disregarded people’s feelings in order to break their idols. Just a few months earlier, the Westboro Web site had received an e-mail arguing that the church’s constant use of the word “fag” was needlessly offensive. “Get a grip, you presumptuous toad,” Phelps-Roper had replied. She signed off, “Have a lovely day. You’re going to Hell.”</p> <p>But on Twitter Phelps-Roper found that it was better to take a gentler tone. For one thing, Twitter’s hundred-and-forty-character limit made it hard to fit both a florid insult and a scriptural point. And if she made things personal the conversation was inevitably derailed by a flood of angry tweets. She still preached God’s hate, and still liberally deployed the word “fag,” but she also sprinkled her tweets with cheerful exclamations and emoticons. She became adept at deflecting critics with a wry joke. “So, when do you drink the Kool-aid?” one user tweeted at her. “More of a Sunkist lemonade drinker, myself. =)” she replied. Phelps-Roper told me, “We weren’t supposed to care about what people thought about us, but I did.” As she developed her affable rhetorical style, she justified it with a proverb: “By long forbearing is a prince persuaded, and a soft tongue breaketh the bone.”</p>    <p>Other Twitter users were fascinated by the dissonance between Westboro’s loathsome reputation and the goofy, pop-culture-obsessed millennial who Phelps-Roper seemed to be on Twitter. “I remember just thinking, How can somebody who appreciates good music believe so many hateful things?” Graham Hughes said. In November, 2009, Hughes, then a college student in British Columbia, interviewed Phelps-Roper for a religious-studies class. Afterward, they corresponded frequently on Twitter. When Hughes was hospitalized with a brain infection, Phelps-Roper showed him more concern than many of his real-life friends. “I knew there was a genuine connection between us,” he said.</p> <p>As Phelps-Roper continued to tweet, she developed relationships with more people like Hughes. There was a Jewish marketing consultant in Brooklyn who abhorred Westboro’s tactics but supported the church’s right to express its views. There was a young Australian guy who tweeted political jokes that she and her younger sister Grace found hilarious. “It was like I was becoming part of a community,” Phelps-Roper said. By following her opponents’ feeds, she absorbed their thoughts on the world, learned what food they ate, and saw photographs of their babies. “I was beginning to see them as human,” she said. When she read about an earthquake that struck off Canada’s Pacific coast, she sent a concerned tweet to Graham Hughes: “Isn’t this close to you?”</p> <p>In February, 2010, Westboro protested a festival in Long Beach, California, that David Abitbol had organized through Jewlicious. Phelps-Roper’s conversations with Abitbol had continued through the winter, and she knew that debating him in person would be more challenging than on Twitter. The church set up its picket a block from the Jewish community center where the festival was taking place. Phelps-Roper held four signs, while an Israeli flag dragged on the ground from her leg. The church members were quickly mobbed by an angry crowd. “Each of us was really surrounded,” Phelps-Roper said. “Two really old women came up behind me and started whispering the filthiest stuff I’d ever heard.”</p> <p>She recognized Abitbol from his Twitter avatar. They made some small talk—Abitbol was amused by a sign, held by one of Phelps-Roper’s sisters, that said “<small>Your Rabbi Is a Whore</small>”—then began to debate her about Westboro’s doctrine. “Our in-person interaction resembled our Twitter interaction,” Phelps-Roper said. “Funny, friendly, but definitely on opposite sides and each sticking to our guns.” Abitbol asked why Westboro always denounced homosexuality but never mentioned the fact that Leviticus also forbade having sex with a woman who was menstruating. The question embarrassed Phelps-Roper—“I didn’t want to talk about it because, ugh”—but it did strike her as an interesting point. As far as she could remember, her grandfather had never addressed that issue from the pulpit. Still, Phelps-Roper enjoyed the exchange with Abitbol. Not long after, she told him that Westboro would be picketing the General Assembly of the Jewish Federations, in New Orleans, that year. Abitbol said that he’d be there, too, and when they met again they exchanged gifts.</p> <p>Phelps-Roper and Abitbol continued their conversations via e-mail and Twitter’s direct-message function. In Phelps-Roper’s effort to better understand Westboro’s new prophecies, she had bought a copy of “The Complete Idiot’s Guide to Understanding Judaism,” but she found it more profitable just to ask Abitbol her questions. Here was a real live Orthodox Jew who lived in Israel and was more than happy to enlighten her. During their debates over Scripture, Phelps-Roper sometimes quoted passages from the Old Testament; Abitbol often countered that their meaning differed in the original Hebrew, so Phelps-Roper bought some language-learning software. She figured that, since she would soon be living in Israel awaiting the end of the world, she should learn the language. Abitbol helped her with the vocabulary.</p> <p>Phelps-Roper still urged Abitbol to repent, but as someone who was concerned about a wayward friend. “I just wish you would obey God and use your considerable platform to warn your audience about the consequences of engaging in conduct that God calls abomination,” she e-mailed Abitbol in October, 2010.</p> <p>In response, Abitbol kept pressing Phelps-Roper on Westboro’s doctrine. One day, he asked about a Westboro sign that said “<small>Death Penalty for Fags</small>,” referring to a commandment from Leviticus. Abitbol pointed out that Jesus had said, “He that is without sin among you, let him first cast a stone.” Abitbol knew that at least one member of Westboro had committed a sin that Leviticus also deems a capital crime. Phelps-Roper’s oldest brother, Sam, was the product of a relationship that Shirley had had with a man she met while she was in law school, before she married Megan’s father.</p> <p>Shirley’s sin of fornication was often thrown in the church members’ faces by counterprotesters. Westboro always argued that the difference between Shirley and gay people was that Shirley had repented of her sin, whereas gays marched in pride parades. But Abitbol wrote that if gay people were killed they wouldn’t have the opportunity to repent.</p> <p>Phelps-Roper was struck by the double standard, and, as she did whenever she had a question about doctrine, she brought up the issue with her mother. Shirley responded that Romans said gays were “worthy of death,” and that if it was good enough for God it was good enough for Westboro. “It was such a settled point that they’ve been preaching for so long it’s almost like it didn’t mean anything to her,” Phelps-Roper said. Still, she concluded that Westboro was in the wrong. “That was the first time I came to a place where I disagreed, I knew I disagreed, and I didn’t accept the answer that they gave,” she said. Phelps-Roper knew that to press the issue would create problems for her in the church, so she quietly stopped holding the “<small>Death Penalty for Fags</small>” sign. There were plenty of other signs whose message she still believed in wholeheartedly. She also put an end to the conversations with Abitbol.</p>    <p>Phelps-Roper found it easy to ignore her doubt amid the greater publicity that Westboro was receiving, much of it tied to her Twitter activity. In February, 2011, the hacker collective Anonymous declared war against Westboro. On Twitter, Phelps-Roper taunted the group’s members as “crybaby hackers.” Anonymous retaliated by hacking godhatesfags.com, and blogs seized on the drama. “Thanks, Anonymous! Your efforts to shut up God’s word only serve to publish it further,” Phelps-Roper tweeted. In March, Westboro members walked out of a screening of the film “Red State,” which spoofed the church. They had been invited by the director, Kevin Smith, with whom Phelps-Roper had kept up a running feud on Twitter since World <small>AIDS</small> Day. Ten days earlier, the Supreme Court had overturned the judgment against Westboro in the Albert Snyder case. Phelps-Roper was inundated with tweets and new followers. That month, she tweeted more than two thousand times; by the end of the month, she had more than seven thousand followers. “That explosion of activity, it was insane,” she said.</p> <p>But as other members of the church joined Twitter they began to question her friendly relations with outsiders. In April, 2011, the BBC aired one of Louis Theroux’s documentaries about Westboro. In one scene, Phelps-Roper explained how she used Twitter to keep up with a group of four Dutch filmmakers who had visited Westboro in 2010. She showed Theroux a picture of one of the filmmakers, Pepijn Borgwat, a smiling, handsome young man holding a package of chocolate truffles that she and her sister Grace had given to him.</p> <p>The day after the documentary aired, Sam Phelps-Roper sent an e-mail to church members urging more discretion in their tweets. “I understand the concept of showing the world our brotherly kindness, but we don’t have to let it all hang out,” he wrote. Megan’s father made her block the Dutch journalists from her private Twitter account. “It feels like we are opening ourselves up for entangling ourselves with the affairs or cares of this life,” he e-mailed Phelps-Roper and her siblings. Phelps-Roper said, “It made me scared for myself that I wanted that. And so I was, like, ‘O.K., you gotta step back.’ ”</p> <p>Another online relationship proved more threatening. In February, 2011, Phelps-Roper began to have conversations on Twitter with a user named @F_K_A. His avatar was Robert Redford in “The Great Gatsby.” He had learned of Westboro after reading an article about the Anonymous hack. “He sent me a tweet, and initially it was like this angry, nasty tweet,” Phelps-Roper said. But @F_K_A was disarmed by Phelps-Roper’s friendly demeanor. He began to ask her questions about life in Westboro, and, because he was curious instead of condemning, she kept answering them. One day, Phelps-Roper recalled, “I asked him some kind of pointed question about the Bible. He said something like, ‘I can’t answer that, but I have never been beaten in Words with Friends’ ”—the popular online Scrabble knockoff. Phelps-Roper replied, “I can’t boast the same. =)” She put her Words with Friends username at the end of the tweet.</p> <p>They began to talk about the church using the in-game chat function, free from Twitter’s character limit. @F_K_A told Phelps-Roper to call him C.G. But C.G. remained a mystery. She knew that he was an attorney, but she didn’t know where he lived or how old he was. “He was careful not to reveal anything about himself,” Phelps-Roper said.</p> <p>Like David Abitbol, C.G. argued against Westboro’s beliefs and practices, but while Abitbol’s arguments were doctrinal C.G. was most critical of Westboro’s cruelty. “We had the same discussion several times when someone would die,” Phelps-Roper said. C.G. urged Phelps-Roper to think of how much hurt it must cause the families of the deceased to see Phelps-Roper and her family rejoicing. Westboro divided people into good and evil, but, Phelps-Roper said, C.G. “always tried to advocate for a third group of people: people who were decent but not religious.” She had heard all these arguments before, but they had never affected her as they did when C.G. made them. “I just really liked him,” she said. “He seemed to genuinely like people and care about people, and that resonated with me.”</p> <p>Phelps-Roper increasingly found herself turning to Bible passages where tragedy is not met with joy. The Old Testament prophet Elisha, for example, weeps when he foresees disaster for Israel. One day in July, 2011, Phelps-Roper was on Twitter when she came across a link to a series of photographs about a famine in Somalia. The first image was of a tiny malnourished child. She burst into tears at her desk. Her mother asked what was wrong, and Phelps-Roper showed her the gallery. Her mother quickly composed a triumphant blog post about the famine. “Thank God for famine in East Africa!” she wrote. “God is longsuffering and patient, but he repays the wicked <small>TO THEIR FACE</small>!” When Brittany Murphy died, Phelps-Roper had seen the disparity between her reaction and that of the rest of the church as a sign that something was wrong with her. Now the contradiction of her mother’s glee and her own sadness made her wonder if something was wrong with the church.</p> <p>Phelps-Roper’s conversations with C.G. often drifted away from morality. C.G. liked indie rock and literary fiction. He introduced Phelps-Roper to bands like the Antlers, Blind Pilot, and Cults—“funnily enough,” she said—and to the novels of David Foster Wallace and Marilynne Robinson. “Hipster shit,” Phelps-Roper said. He turned her on to the Field Notes brand of notebooks. He poked fun at the inelegant fonts that Westboro used for its press releases. After C.G. complimented her on her grammar, she took pains to make sure that her tweets were free of clunky text-message abbreviations.</p> <p>As Phelps-Roper developed her relationship with C.G., her sister Grace grew suspicious. “Suddenly, her taste in music started changing,” Grace told me. “It annoyed me, because it wasn’t coming from Megan. It was coming from him, this question mark of a person that I don’t get to know about, but she has some kind of thing with.” As young children, Grace and Megan had squabbled constantly, but they had grown close. Grace was seven years younger than Megan, and still in high school at the time. Grace would scroll through Megan’s iPhone, asking about the various messages and e-mails. But soon after Megan started talking to C.G. she stopped letting Grace look at her phone. “I remember thinking, What the heck? What are you hiding?” Grace said.</p>    <p>For young women in Westboro, having romantic interactions with someone outside the church was forbidden. When Phelps-Roper was growing up, one of her cousins had been pushed out of the church for, among other things, getting entangled with boys; other young women had been harshly punished. Phelps-Roper had long assumed that she would likely never get married, since she was related to almost every male in the church. “I was terrified of even thinking about guys,” she said. “It’s not just the physical stuff that can get you in trouble.” She did her best to displace her feelings for C.G. onto the music and books he recommended, which she fervently consumed. “I was in denial,” she said.</p> <p>Then, on September 30, 2011, she had a dream: It was a beautiful summer day, and she was standing on the driveway of the church. A black car with tinted windows pulled up, and a tall, blond man got out. She couldn’t see his face, but she knew it was C.G. She walked up to him, and they embraced. She knew her family could see them on the surveillance cameras that line the Block, but she didn’t care. “It was so real, that feeling of wanting to be with him,” Phelps-Roper told me. She woke up fighting back tears. “He was not a good person, according to the church,” she said. “And the fact that I dreamed about him, and the strong feeling of wanting that relationship, represented huge danger to me.” That day, she told C.G. that they couldn’t talk anymore. She deleted her Words with Friends account. C.G. deleted his Twitter account.</p> <p>Phelps-Roper tried to throw herself back into the Westboro community, but the atmosphere had changed while she was distracted by her relationship with C.G. It had started in April, 2011. Her mother seemed mysteriously troubled. After Phelps-Roper pressed her parents, they showed her an e-mail they’d received from her oldest brother, Sam, and Steve Drain, another church member. It accused her mother of lacking humility, saying that she was too zealous in correcting other members’ behavior and had overreached her authority on a number of occasions, Phelps-Roper told me. Reading the e-mail made her sick with fear. When a Westboro member was singled out for bad behavior, it often triggered a harrowing period of discipline. The smallest transgression could spark another round of punishment, until the member either shaped up or was kicked out of the church.</p> <p>Shirley’s role in the church was reduced dramatically. “My mother was supposed to be primarily a mother and a caretaker,” Zach Phelps-Roper, Megan’s younger brother, told me. Megan took over picket planning, while Steve Drain became the church’s media manager. The Phelps-Roper house was now quiet, as the flow of church members and reporters stopped. “I watched her all my life work so hard and sacrifice so much, and just be so willing to do anything for anybody,” Phelps-Roper said. “She had to be put in her place, essentially, and that feeling—it just was really, really wrong to me.” (Drain insists that Megan’s description of the letter is inaccurate. He said that it was a “disciplinary message,” but wouldn’t reveal its contents. “We don’t air our dirty laundry,” he said.)</p> <p>An all-male group of nine elders took control of church affairs. Previously, decisions at Westboro had been hashed out in church meetings, where consensus was required before moving forward. But the elders met separately before bringing their decisions to the rest of the group. The church became more secretive, as members were reluctant to discuss important issues for fear of appearing to go behind the elders’ backs.</p> <p>Women like Shirley and her older sister Margie—an attorney who had argued the Snyder case in front of the Supreme Court—had always been among the most public and influential members of the church. Westboro members drew on stories of powerful women in the Bible, like Deborah, a prophet and judge of Israel. But now the emphasis shifted to passages about women submitting to their husbands. Fred Phelps encouraged church members to read the Evangelical writer John R. Rice’s book “Bobbed Hair, Bossy Wives, and Women Preachers,” from 1941, which offered a view of gender roles that was regressive even when it was published. “It suddenly sucked to be a woman,” Phelps-Roper said. “It was, like, I would need to get permission from Dad to talk to anybody else.”</p> <p>Westboro women had long been forbidden to cut their hair, and had restrictions on other aspects of their appearance. But now the elders required more severe standards of modesty. Phelps-Roper had to wear high-necked shirts and dresses or shorts that covered her knees. After one shopping trip with her mother and her sisters, Phelps-Roper had to show her clothes to her father and her brother Sam, to make sure that they were appropriate. She was barred from wearing colorful nail polish and her favorite gold sandals to church. Phelps-Roper was upset to learn that some of her cousins lived under more liberal standards. How could God’s judgment differ from house to house?</p> <p>Phelps-Roper’s confusion soon turned to outrage. In 2012, she was twenty-six years old, but she was still being treated like a child. Once-minor indignities, like being accompanied by an adult chaperone while eating lunch at a restaurant with other young church members, now seemed unbearable. In April, she was shocked when Westboro expelled a cousin of hers without adhering to the process that the church had always followed, which was derived from the Book of Matthew. Typically, expulsion resulted only after a unanimous decision, but in the cousin’s case she was excluded over other members’ objections. (Drain recalls no objections, and said, “Everything was done decently and in accordance with Scripture.”) “It stopped feeling like this larger-than-life divine institution ordained and led by God, and more like the sniping and sordid activity of men who wanted to be in control,” Phelps-Roper said.</p> <p>She resented the increasing authority wielded by Drain. One of the few Westboro members unrelated to Fred Phelps, Drain had visited Topeka in 2000 to film a skeptical documentary about the church, but he soon became convinced of its message. The next year, he and his family joined the church. He’d long pushed for a larger role in Westboro, and after the elders came to power his influence increased. In February, 2012, during the funeral of Whitney Houston, in New Jersey, Drain urged Phelps-Roper and other members to tweet poorly Photoshopped images that depicted them haranguing mourners. The media quickly unravelled the hoax. (Drain told me that the fake picket was never meant to be taken literally.)</p>    <p>Phelps-Roper was embarrassed by the debacle. It undermined her own proud claims on Twitter to be spreading God’s truth—and lying violated Scripture. In addition, she now had to have all her media appearances approved by Drain. “It seems like he wants to be Pope Steve and for no one else to do anything without his permission,” she wrote in her journal. “I hate it so much.”</p> <p>Megan’s doubt engendered by the “<small>Death Penalty for Fags</small>” sign grew. She started to complain to her mother, saying that the elders were not obeying the Bible. They treated her mother and other members with cruelty when the Bible required brotherly love, she said. The elders acted arrogantly and tolerated no dissent, when God demanded meekness and humility. Phelps-Roper was struck by the similarities between her arguments and what C.G. and David Abitbol had always said about the church. “It was like we were finally doing to ourselves what we had done to everyone else,” she said. “Seeing those parallels was really disorienting.”</p> <p>Drain disputed many of Phelps-Roper’s characterizations of the changes in the church. He acknowledged that an all-male group of elders assumed preaching duties, but not that this led to a less open atmosphere in the church. “There’s definitely more participation than when I first got here, in 2001, when you had one person doing all the sermons,” he said, referring to Fred Phelps.</p> <p>He also denied that women in the church had been significantly marginalized. “Women do a lot at Westboro now, as they always have,” he said. Shirley’s role was not reduced as a punishment for overstepping her bounds, he said. Instead, after the Snyder decision, other members had volunteered to help her deal with an overwhelming torrent of media. “We lifted her burden,” he said. He pointed out that Shirley had recently spoken at a picket protesting Kim Davis, the Kentucky clerk who had refused to issue marriage licenses to gay couples—the church took issue with Davis’s remarriages after divorce. (Through Drain, Megan’s parents declined to comment.)</p> <p>Phelps-Roper first considered leaving the church on July 4, 2012. She and Grace were in the basement of another Westboro family’s house, painting the walls. The song “Just One,” by the indie folk group Blind Pilot—a band that C.G. had recommended—played on the stereo. The lyrics seemed to reflect her dilemma perfectly: “And will I break and will I bow / if I cannot let it go?” Then came the chorus: “I can’t believe we get just one.” She suddenly thought, What if Westboro had been wrong about everything? What if she was spending her one life hurting people, picking fights with the entire world, for nothing? “It was, like, just the fact that I thought about it, I had to leave right then,” she said. “I felt like I was going to jump out of my skin.”</p> <p>The next day, she mentioned the possibility of leaving to Grace. Grace was horrified. “It just sounded ridiculous to even suggest it,” Grace told me. “These were the points I brought up: we’re never going to see our families again, we’re going to go to Hell for eternity, and our life will be meaningless.” Megan, still uncertain, agreed. But she plunged into a profound crisis of faith. “It was like flipping a switch,” she said. “So many other thoughts came in that I’d never pursued, and that’s every doubt that I’d ever had, everything that had ever seemed illogical or off.”</p> <p>When they were together, Megan engaged Grace in interminable theological conversations. When they were apart, Megan detailed her doubts in text messages. One day, she texted Grace, “What if the God of the Bible isn’t the God of creation? We don’t believe that the Koran has the truth about God. Is it just because we were told forever that this is How Things Are?” She added, “Does it really make you happy when you hear about people dying or starving or being maimed? Do you really want to ask God to hurt people? I ask myself these questions. I think the answer is no. When I’m not scared of the answer, I know the answer is no.” Two days later, she texted Grace about Hell: “Why do we think it’s real? It’s starting to seem made up to scare people into doing what they say.” Grace replied, “But what if?”</p> <p>That day, Grace wrote to Megan, “Our belief in God has always curbed everything. Like, pain &amp; sorrow, I mean. Without that we’d only have our belief in each other. But we are human &amp; humans die. What would we have if we didn’t have each other?” For Megan, the answer could be found in other people. “We know what it is to be kind &amp; good to people,” she wrote. “We would just have to find somewhere else, other people to love and care about and help, too.” Grace wrote back, “I don’t want other people.” In truth, Megan didn’t want other people, either; she desperately wanted things in Westboro to go back to the way they had been. But the idea of living among outsiders was no longer unimaginable.</p> <p>Phelps-Roper spent the summer and the fall in an existential spiral. She would conclude that everything about Westboro’s doctrine was wrong, only to be seized with terror that these thoughts were a test from God, and she was failing. “You literally feel insane,” she said. Eventually, her doubts won out. “I just couldn’t keep up the charade,” she said. “I couldn’t bring myself to do the things we were doing and say the things we were saying.”</p> <p>She largely stopped tweeting and tried to avoid journalists on the picket line, for fear that she might say something that revealed her misgivings. At one protest, a journalism student cornered her and asked if she ever got tired of picketing. “I honestly replied no,” she wrote in her journal. “It’s not about being tired, it’s about not believing in it anymore. If I believed it, I could do it forever.” In October, Megan finally persuaded Grace to leave. At the end of October, the sisters started secretly moving their possessions to the house of one of their high-school teachers, who agreed to help them. Many of Megan and Grace’s young relatives who left the church had slipped away quietly, in order to avoid confronting their families. But the sisters wanted to explain to their parents the reasons behind their decision.</p>    <p>As the sisters agonized over whether to leave, they befriended an older man in the church and his wife, eventually becoming allies in discontent. For a while, they all planned to leave together. Then the couple’s marriage began to deteriorate, and the husband told Megan and Grace that they were going to divorce. Grace became involved in a brief romantic relationship with the man. After the relationship ended, the wife learned about it, and sent a letter to Megan and Grace’s parents revealing both the relationship and the sisters’ plan to leave.</p> <p>On Sunday, November 11th, the family had just returned from church when Megan and Grace were called into their parents’ bedroom, where their father began to read the letter out loud. Megan told Grace quietly that they had to leave: “It was like the world was exploding and I didn’t want to be around to see it.” Their mother tried to calm things down. Their parents wanted to talk things over—they seemed to think that the sisters could be persuaded to stay—but Megan and Grace had made up their minds. As Grace packed, their father came into her room and asked what she wanted the church to do differently. “I want you and everyone else to leave with me,” Grace replied. Their parents were stunned, but they didn’t try to force the sisters to stay.</p> <p>As the sisters packed, their younger brother Zach sat at the piano downstairs, crying and playing hymns, which he hoped might change their mind. Other church members stopped by to say goodbye and to warn the sisters of the consequences of their decision. “The fact that I’m coming face to face with the damage that I was doing to them was even worse than anything else that was happening to me,” Phelps-Roper said. Her parents told her to say goodbye to her grandfather. She walked over to the residence where her grandparents lived, above the church sanctuary. When Megan told them she was leaving, her grandfather looked at her grandmother and said, “Well, I thought we had a jewel this time.”</p> <p>Megan and Grace’s father drove them to a hotel in Topeka, where he had paid for a room, but they were too scared to spend the night alone, so they called the teacher who had agreed to store their boxes. That night, they cried themselves to sleep on couches in his basement. Megan and Grace returned to their house the next day with a U-Haul truck to pick up their remaining possessions. As they walked away for the last time, Shirley called after them, “You know you can always come back.”</p> <p>For the next few months, the sisters drifted. They lived in Lawrence for a month with their cousin Libby, who had also left the church, while Grace finished the first semester of her sophomore year at Washburn. They travelled to Deadwood, South Dakota, because Megan wanted to see the Black Hills. As she drove there, she kept imagining her car careering off the highway—she was so afraid of God’s wrath. “We were a mess, crying all the time,” she said. Phelps-Roper was tempted to hide in the Black Hills forever, but soon decided that, after spending so many years as the public face of Westboro, she wanted to go public with how she’d left the church, and to start making amends for the hurt she had caused. In February, 2013, she wrote a statement on the blogging platform Medium. “Until now, our names have been synonymous with ‘God Hates Fags,’ ” she wrote. “What we can do is try to find a better way to live from here on.” She posted a link to the statement on Twitter. It was her first tweet in three months. “Hi,” she wrote. Tweets of encouragement and praise poured in. “I expected a lot more people to be unforgiving,” she said.</p> <p>When David Abitbol learned that the sisters had left Westboro, he invited them to speak at the next Jewlicious festival in Long Beach. They agreed, hoping that the experience might help them to find their way, and to finally understand a community that they had vilified for so long. “It was like we were just reaching out and grabbing on to whatever was around,” Megan said. Abitbol said, “People, before they met them, were, like, ‘So, now they’re not batshit-crazy gay haters and we’re supposed to love them? Fuck that.’ ” He added, “And then they heard them speak, and there wasn’t a dry eye in the house.” The sisters befriended their hosts, an Orthodox rabbi and his family. They went kosher-grocery shopping together, and Megan and Grace looked after the kids. Grace became especially close with the family, and ended up staying for more than a month. “They were amazing and super-kind,” Phelps-Roper said. Abitbol joked about the dramatic role reversal: “ ‘Your Rabbi Is a Whore’? Your rabbi is a <em>host</em>.”</p> <p>Megan tried to put herself in situations that challenged the intolerance she had been indoctrinated with. One evening, after speaking at a Jewish festival in Montreal, she and Grace passed a group of drag queens on the sidewalk outside a cabaret. She felt a surge of disgust, but when Grace asked if they could watch the show she agreed. “It felt illicit,” she said. “Like, oh, my gosh, I can’t believe I’m here.” She and Grace ended up dancing onstage during the intermission. Wherever Megan and Grace went, they met people who wanted to help them, despite all the hurt they had caused. The experience solidified Megan’s increasing conviction that no person or group could claim a monopoly on moral truth. Slowly, her fears about God’s judgment—the first terrifying understanding of her faith as a child, and its most stubborn remnant—faded. “As undeniable as they had seemed before, they seemed just as impossible now,” she said.</p>    <p>One Sunday last February, I went with Megan and Grace to visit their old neighborhood. We parked a few blocks from the church and walked down a quiet street lined with ranch-style homes. It was sunny and warm for a winter day in Kansas. Phelps-Roper wore a green polka-dot dress and high leather boots, and her long curly hair—she still hadn’t cut it since leaving the church—fell down her back. Now twenty-nine, she lives in a small town in South Dakota, where she works at a title company. Six months after she left the church, she went on a date with C.G. They met in Omaha, in driving distance for both of them, and saw “The Great Gatsby,” the Baz Luhrmann movie. “It’s hard to even describe how weird it was,” she told me. It was her first date ever, and it was with someone who had become a symbol of the unattainable. “I was quite a bit like a teen-ager. He put his arm around my waist at one point, and I just stood up so straight.” She and C.G. connected as strongly in person as they had online, and they now live together.</p> <p>When we reached the Block, we walked along the privacy fence. In front of each house where Westboro members live, Megan pointed out colorful numbers on the curb; Grace had helped paint them when she was a teen-ager. We passed the Phelps-Roper house and came to an intersection. A group of men and boys came toward us. “I can’t tell yet, but it sure looks like a group of brothers and cousins,” Megan said. First came five of their young cousins, followed by two of their brothers, Sam and Noah. Steve Drain, a large bearded man, trailed behind. They carried tools. Megan later explained that they had probably just come from doing repairs on a Westboro member’s house. The group passed us without stopping. Grace called out, “Hi!” Sam nodded and gave a terse smile and a small wave. “Hi, how are you?” he said. Sam and Noah had recently had birthdays, and Megan wished them a belated happy birthday. The sisters said nothing to Drain. The crew quickly disappeared into a house.</p> <p>We reached the church, an unremarkable white and brown mock-Tudor building on the northeast corner of the Block. A banner advertised a Westboro Web site, godhatesamerica.com. Two American flags—one of them rainbow colored—flew upside down from a pole. The church sign read “<small>ST. VALENTINE IS A CATHOLIC IDOL AND AN EXCUSE TO FORNICATE! JUDE 7</small>.”</p> <p>Directly across the street stood a house painted in bright, horizontal rainbow stripes. The house had been bought, in 2012, by Planting Peace, a nonprofit group whose mission, according to its Web site, is “spreading peace in a hurting world.” The Equality House, as it’s known, is home to a group of young L.G.B.T. activists. Planting Peace has worked with former Westboro members to spread its message of tolerance. Megan first visited the house in 2013, after her cousin Libby encouraged her to visit. She sneaked in the back door, for fear of being spotted by her family.</p> <p>Today, Megan and Grace’s only connection to Westboro is virtual. Although Phelps-Roper no longer believes that the Bible is the word of God, she still reads it to try to find scriptural arguments that could encourage Westboro to take a more humane approach to the world. Sometimes she’ll tweet passages, knowing that church members will see them. After they left the church, Megan and Grace were blocked from Westboro’s Twitter accounts, but they created a secret account to follow them. Sometimes, when her mother appears in a video, Megan will loop it over and over, just to hear her voice.</p> <p>Fred Phelps died in March, 2014, at the age of eighty-four. Former members of the church told me that Fred had had a softening of heart at the end of his life and had been excommunicated. (The church denies these claims.) Zach Phelps-Roper, Megan’s younger brother, who left the church later that year, said that one of the precipitating events in Fred’s exclusion had been expressing kindness toward the Equality House. At a church meeting, Zach recalls, members discussed the episode: “He stepped out the front door of the church and looked at the Rainbow House, the Planting Peace organization, and looked over and said, ‘You’re good people.’ ” <span>♦</span></p> <aside>\n</aside><section><p><em>Sign up for the daily newsletter.</em><em>Sign up for the daily newsletter: the best of The New Yorker every day.</em></p>  \t<div>      \t        </div></section>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\n    \t\t\t\t\t\t</div>\n\n\t\t\t\t\t\t\n\t\t\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t", "thumbnail": "http://www.newyorker.com/wp-content/uploads/2015/11/151123_r27316-1200x630-1447279211.jpg"}