{"site_name": "nytimes.com", "description": "P im Koeslag designs and fabricates some of the world’s most complicated mechanical timepieces. Especially ambitious is his Grand Tourbillon Minute Repeater, created for Ateliers deMonaco, a watch company he helped start. When I visited his bright, sunlit factory in Geneva in May, he opened a refrigerator-size safe to show me one of them. “If you want to go for the real complex stuff,” he said, “here it is.” The watch, a gorgeous chunk of white gold, includes more than 400 painstakingly machined, polished and hand-assembled parts. One of them is a circular metal gong, struck by small hammers that mark the time with two-tone melodies. The watch’s mechanisms — including its “balance wheel,” whose oscillation is visible through an opening in the watch face — are so precise that the device loses or gains only two seconds a day. The Grand Tourbillon Minute Repeater sells for just over $200,000, and Koeslag has made just eight of them. “A Prince of Qatar has bought three already,” said Koeslag, a mannerly blond man who wore a trim pinstriped suit. “Very special watches, for very special people.” On the factory floor behind us, a dozen white-coated women were piecing together other watches that Koeslag has designed for Frédérique Constant, a midrange watch brand. These will sell for as much as $30,000. One woman peered into a microscope as she carefully wielded a long, thin needle to apply a drop of pink oil, before setting a tiny pin in place. This is the", "videos": [], "images": ["https://static01.nyt.com/images/2015/06/07/magazine/07watch2/07mag-07watch-t_CA0-blog427.jpg"], "words": 4166, "date": 1433289600.0, "title": "Can the Swiss Watchmaker Survive the Digital Age?", "url": "http://www.nytimes.com/2015/06/07/magazine/can-the-swiss-watchmaker-survive-the-digital-age.html", "is_rtl": false, "author": "CLIVE THOMPSON", "html": "<article>\n\n            \n\n        \n    <div>\n    <div>\n        \n<p><span>P</span>im Koeslag designs and fabricates some of the world’s most complicated mechanical timepieces. Especially ambitious is his Grand Tourbillon Minute Repeater, created for Ateliers deMonaco, a watch company he helped start. When I visited his bright, sunlit factory in Geneva in May, he opened a refrigerator-size safe to show me one of them.</p><p>“If you want to go for the real complex stuff,” he said, “here it is.” The watch, a gorgeous chunk of white gold, includes more than 400 painstakingly machined, polished and hand-assembled parts. One of them is a circular metal gong, struck by small hammers that mark the time with two-tone melodies. The watch’s mechanisms — including its “balance wheel,” whose oscillation is visible through an opening in the watch face — are so precise that the device loses or gains only two seconds a day. The Grand Tourbillon Minute Repeater sells for just over $200,000, and Koeslag has made just eight of them.</p><p>“A Prince of Qatar has bought three already,” said Koeslag, a mannerly blond man who wore a trim pinstriped suit. “Very special watches, for very special people.” On the factory floor behind us, a dozen white-coated women were piecing together other watches that Koeslag has designed for Frédérique Constant, a midrange watch brand. These will sell for as much as $30,000. One woman peered into a microscope as she carefully wielded a long, thin needle to apply a drop of pink oil, before setting a tiny pin in place. This is the tradition that Koeslag is selling to his customers: the patient Swiss art of manufacturing complex, handmade mechanisms.</p><p>Last fall, however, Koeslag set off on a very different, decidedly 21st-century project: a smartwatch. In response to Apple’s plans to introduce a high-tech watch this year, the chief executive of Frédérique Constant, Peter Stas, decided the company would produce its own. It would not be a minicomputer with a screen, like Apple’s. Instead, it would combine the functions of a Fitbit, a device that tracks physical activity, with a traditional Swiss timepiece, a $1,200 entry-level Frédérique Constant watch. A Silicon Valley company would produce the tiny sensors that count steps and measure sleep cycles, and this information would be transmitted to a phone through a Bluetooth connection. The phone would also control the watch — resetting its hands in different time zones, for example. From the outside, the watch wouldn’t look “smart” at all, but it would be packed with electronics. Koeslag’s job was to bring to life this chimera of Swiss engineering and Silicon Valley wizardry.</p><p>Koeslag faced a significant problem, though: He had never worked with chips and sensors before. He didn’t even own a soldering iron. Swiss watchmakers don’t need them; their devices are put together with screws and screwdrivers.</p>\n<p>He led me to a large microscope and placed one of the chip sets under it. When the image appeared on a large computer screen, he zoomed in on the Bluetooth antenna, which looked like a dark, square block. Getting that into the right spot caused him a great deal of trouble, he said.</p><p>“Under the microscope, we actually welded it on, by hand,” he said. To install it properly, he sought advice from an associate at a technology company. “I said, ‘I have to place this big antenna, which way do I put it?’ ” The technician told him it couldn’t be done manually; technology companies use robots to fix in place components that require that kind of precision. “And I said, ‘Well, we’ll see.’ ” He had to shave the tip of his soldering iron down to a fine point to use it successfully.</p><p>By January, he finally had a prototype working well, just in time to show it off at Baselworld, the annual Swiss jewelers’ and watchmakers’ fair. Watch designers typically boast about their latest “complications,” clever ways of creating gear work to power new features, like calendars or extra dials. This year, though, the chatter at Basel kept coming nervously back to the Apple smartwatch. Frédérique Constant was producing its enhanced watch, and a few Swiss companies were announcing similar plans. But what did this trend mean for the industry? Should they move into smartwatches? Adding chips might help these watchmakers ride the high-tech wave, but it also risked eroding what made them special.</p><p>The prospect made Koeslag jittery. The night before the show, he wore his smartwatch to bed. It tracked his sleep patterns. “I was so stressed I woke up eight times,” he said. His deep sleep totaled just 25 minutes. Many observers had predicted that Apple would spell trouble for Swiss watchmakers, and now Koeslag had some personal data to prove it.</p><p><strong>Smartwatches have been</strong> around for years, but none have received as much attention as the Apple Watch. Much of the allure, of course, was Apple’s famously elegant design. It was recognizably a watch, complete with a crown that controlled on-screen apps, but it had Apple’s distinctive aesthetic, with its minimal lines and sleek curves; the watch is a smaller version of an iPhone, essentially.</p><p>Very few companies can turn out such consistently glossy electronics, because few sell enough of their devices to justify the automated processes that keep quality high and prices relatively affordable. For example, to achieve the satiny finish on the bodies of the Apple Watch Sport, the company uses robotized nozzles to blast the aluminum surface with microscopic beads of zirconia. “No company in the world is finishing and anodizing to Apple’s level,” the product designer Greg Koenig has written. The company’s design prowess rests in part on its mastery of high-volume operations like this.</p><p>Swiss watchmaking emerged from a radically different background, one rooted in meticulous manual labor. The industry got its start in the 16th century after John Calvin persuaded the City Council in Geneva to impose sumptuary laws banning jewelry, and the city’s skilled jewelers joined forces with the makers of pocket watches instead. Later, French Catholics chased Protestant Huguenots out of their country; many of these French exiles happened to be watchmakers, and they settled in Switzerland. In the mountains of the Jura region, they encountered local farmers who spent half the year indoors and idle and who turned out to be extremely patient and detail-oriented. The émigrés hired them to spend their winters hand-polishing tiny metal components for the “movements,” the watch’s spring-driven inner workings.</p><figure>\n    \n    <div>\n            <img src=\"https://static01.nyt.com/images/2015/06/07/magazine/07watch2/07mag-07watch-t_CA0-blog427.jpg\">\n            \n            \n    </div>\n        <figcaption>\n                <span>A technician inspects the movement of a watch at the Frederique Constant factory.</span>\n                        <span>\n            \n            Jonathan De Villiers for The New York Times        </span>\n            </figcaption>\n    </figure>\n<p>By the 20th century, Swiss watches had become famous for their reliability and complexity. They are also marvels of energy efficiency, because dozens or even hundreds of components depend on tiny wound springs for power. Each new “complication” — say, a calendar that advances the date with a satisfying snap at midnight — demanded a new set of gears and more energy, thus requiring ever more clever compensations. A mechanical watch is both a dance with and a fight against physics.</p>\n<p>In the early 1970s, centuries of tradition were overturned by an upstart technology: quartz watches. In these, a battery’s electricity causes a quartz crystal to vibrate at an extremely regular frequency, running a motor that turns the watch hands. The resulting timepiece is far more accurate and much cheaper than most mechanical watches. Swiss inventors actually helped pioneer this technology, but watchmakers regarded it as beneath them. A quartz watch might have only a few dozen parts, compared with hundreds in a mechanical one. Where was the challenge?</p><p>When Swiss companies declined to make quartz devices, inexpensive Japanese watches from companies like Seiko became popular around the world. The “quartz crisis” killed off so many Swiss watchmakers that by the end of the 1970s, the number of workers in the industry had shrunk to 30,000 from 90,000. Brands in existence for centuries vanished in a puff of disruption.</p><p>In the 1980s, Swiss companies came back. Swatch introduced a line of inexpensive quartz watches, and other Swiss companies followed its lead. In the 1990s, as Ryan Raffaelli, a Harvard business professor who has studied the Swiss industry, has written, Swiss watchmakers hit on an even more profitable strategy: marketing their expensive mechanical watches as luxury items steeped in history. If you wanted to hand something down to your children, the sales pitch went, spend thousands of dollars on a Rolex or, at the very least, several hundred on a quartz watch with elegant Swiss design. Sales of Swiss watches rebounded; exports have more than doubled since 2000, rising even in the years after the economic meltdown.</p><p>These days, nobody needs a watch to know the time. Time is all around us, displayed on every computer, phone and microwave oven. The Swiss watchmakers realize this. They market their mechanical watches as not only accurate but also deeply symbolic. For those willing to spend $30,000, a traditional Swiss watch marks its owner as a man or woman who appreciates quality, artistry and ingenuity (and, of course, as a wealthy and conspicuous consumer). Wearing a mechanical watch today makes an explicitly antidigital statement, embracing the long pedigree of a device that predates not only computers but electricity itself. It tells the time but is timeless. “A mechanical watch,” Jean-Claude Biver, the chief executive of TAG Heuer, said, “is a piece of eternity in a box.”</p><p>Is the smartwatch the next “quartz crisis”? Few Swiss executives think smartwatches will kill off the high-end market. Nobody, they argue, who spends $50,000 on a piece of handmade eternity will regard an Apple Watch as a substitute. But luxury brands also sell a great many less-expensive quartz watches, and this is where the Apple Watch poses a threat.</p>        \n    </div>\n    <div>\n    </div>\n</div>\n<div>\n    \n</div>\n<div>\n    <div>\n        \n<p>“If a young man, young woman, is 25 years old, would they rather put 1,200 Swiss francs” — about $1,300 — “for a watch that tells you what time it is and the date, or will they buy, for only $800, a watch that tells you everything?” Biver said. “For me there is no doubt we will have a very tough competition in the $1,200 price segment.”</p><p>For Switzerland to compete with Silicon Valley, it needed to answer a question that was no longer just stylistic or technical but existential. Raffaelli said, “What does it mean to be a watchmaker in a digital world?”</p><p><strong>Peter Stas began</strong> pondering that question two years ago. A Dutch émigré in Switzerland, Stas and his wife, Aletta, founded Frédérique Constant in 1988 to make the sort of midlevel quartz timepieces now threatened by Apple. Their watches retail for $1,000 and more: “Classical, accessible luxury,” he called them as he sat in his office, surrounded by models of his mahogany motorboat.</p>\n<p>At first, Stas considered making a smartwatch through and through — LCD screen, apps, Google’s free operating system for wearable devices. He consulted a Portuguese design team but couldn’t find a concept he liked. One crucial issue was power. Watches can accommodate only very small batteries, so users would have to charge their watches every night. (This has been a complaint leveled against the Apple Watch.) The energy-hungry display would be turned off most of the time and activated with a flick of the wrist, but the gesture isn’t always successful. (Another complaint about Apple’s watch: You turn your wrist to check the time, and the screen remains dark.) Like most watchmakers, Stas wanted his quartz watches to run for two years on a single battery.</p><p>A subtler problem was the screen shape. In 2013, the only LCDs available to him were rectangular. “And in the watch industry,” Stas told me, “we know actually that square screens don’t sell to men.”</p><p>So if a screen-based smartwatch wasn’t viable, he wondered, was there another alternative? Stas knew that “activity tracker” wristbands were popular. A watch is inherently a wristband, albeit a prettier one. After hunting online for suitable electronics to work with, Stas found Fullpower Technologies, a company in Santa Cruz, Calif., that makes the sensors and firmware in activity-trackers built by companies like Nike. He contacted Philippe Kahn, the chief executive, who told Stas that Fullpower’s technology could run for two years on one watch battery. Better yet, Kahn could make the phone software for Stas. It would analyze activity and deep-sleep patterns, so the watch’s alarm could go off at precisely the least disruptive time to wake its wearer.</p>\n<p>The prospect of a partnership excited Stas. Kahn too: He detested the environmental waste of many disposable electronics and loved the idea of building sensors into a watch sufficiently expensive that it would be regarded as an heirloom. Watches are easy to open and repair, unlike many of today’s electronics. When Fullpower develops new sensors a few years from now, owners can have their Frédérique Constant watches upgraded with better electronics.</p><p>“The Swiss watch industry sells tens of millions of watches a year, and they are wearable objects that people tend to keep,” Kahn told me. “I’m a dad, and I’ve got kids, and I don’t want to leave a Kleenex world where nothing’s worth fixing and everything gets thrown away.”</p><p>In pursuing an analog design, they hit upon an intriguing concept. Using the phone app, the owner can set an activity goal, like 8,000 steps for a day. Then the watch displays how close you are to meeting it, using the hand on a small, secondary dial: At 2,000 steps, for example, the hand would point to 3 o’clock, signifying 25 percent. Eventually, the dial could quantify all sorts of data: How full is your inbox? How close is your friend to arriving at the restaurant? To Ronnie Bernheim, co-owner (with his brother André) of the watchmaker Mondaine, which is licensing some of Stas’s and Koeslag’s technology, this approach is superior to the blunt accuracy of a screen. A watch hand is “glanceable,” as he puts it, because it’s only semi-accurate; we peek at an analog wall clock to get a general sense of the time of day, not a precise one.</p><p>“You’re not interested if it’s 23 percent or 27 percent.” Bernheim said. “You only want to know ‘Do I have to move or have I already done pretty good?’ ” (The French watchmaker Withings began selling a cheaper watch with similar capabilities this spring.)</p><p>When Koeslag handed me a Frédérique Constant smartwatch to try on, it had a pleasantly hefty feel. It didn’t seem like a smartwatch at all; there was nothing visibly electronic about it. I loved it. I’m a fan of gadgets and even wore early, clunky smartwatches with LCD screens able to display texts and tweets. But Koeslag’s stylish analog design felt like a steampunk midpoint, the best of both domains: a device that delivered modern types of information, with the romance of old-fashioned dials.</p>\n<p>Bernheim and Stas are diplomatic about the Apple Watch. “We try to be nice,” Stas said. But he thinks its limitations — especially the hassle of charging it every night — will deter some would-be owners. “There will be plenty of people who are going to buy them. I think the real question will be in three months, five months, if people are still going to wear them.”</p><p>He is even more dubious that any Silicon Valley company could create something with aesthetics lovely enough to penetrate the European luxury market. “We have to be very clear here,” he told me, leaning back on his black chaise longue. “Luxury business is coming either from Paris, or it’s coming from Italy, and watches are coming from Switzerland. They’re not coming from the U.S.” He shook his head. “Silicon Valley — my God, what they’re wearing and everything! They really don’t have this culture of refinement. We bring something else to the story.”</p><p><strong>A traditional watch</strong> with hidden electronics is one solution to the smartwatch challenge. Montblanc, the European luxury-goods brand, has another, more unusual idea.</p><p>When I visited Alexander Schmiedt, who runs the company’s watch business, in the village of Villeret, he handed me a smartwatch prototype. The actual timepiece is entirely mechanical, from Montblanc’s “TimeWalker” line of watches. It contains no circuitry.</p><p>Instead, the computerized parts are in the wristband. This “e-Strap” features a small rubber module that sits on the wrist’s underside. The module has an inch-and-a-half touch-screen, where white text and images alert the wearer to incoming calls, SMS messages, emails and social-media messages. The screen can only display 16 characters at a time, so reading a message means swiping back and forth across it. Internal activity sensors track and send data to your phone. (The module I saw was a nonworking mock-up.) Watch and e-Strap together will sell for roughly $5,000.</p><p>“You don’t want to put the technology inside the watch,” Schmiedt said as he strapped on the TimeWalker, a handsome brushed-stainless-steel body whose black-and-red face was encircled by a black ceramic ring. “It would mean that after a predetermined while, the watch itself would become outdated.”</p><p>At Montblanc, he said, the engineers tell a story to illustrate the perils of high-tech obsolescence: At graduations in the 1990s, students receive gifts from their parents — some the latest mobile phone, others a Montblanc fountain pen. Decades later, a phone from the ’90s is a useless relic. But the Montblanc pen is as good as ever; indeed, the years have imparted character. “It has a meaning, it has little scratches,” Schmiedt said. “If I ever scratch up a watch, or — I don’t know, my child maybe dropped it — it’s a mark of life.” Our electronics are much less tolerant of faults, he noted, grinning as he held up his own iPhone, whose screen was spider-webbed with cracks.</p>\n<p>Dividing the Montblanc smartwatch into two components may make it less intrusive, Schmiedt believes, because the e-Strap’s screen usually faces away from the wearer. “You don’t always have it in your sight,” he said. “You can choose when you want to see it.” The OLED screen preserves battery life, too. Montblanc promises five days before the device needs charging.</p>\n<p>Schmiedt is enthusiastic about the e-Strap, of course. But looking at this Janus device — analog and digital faces on opposing sides — I couldn’t help thinking that it would be harder for Montblanc to strike a balance between smartwatch and mechanical device than for Frédérique Constant or Mondaine. The latter are younger companies, and Mondaine primarily sells affordable quartz watches. Montblanc, however, is trying to safeguard a much older brand name: In 2007, it bought Minerva, a storied Swiss watchmaker founded in 1858. Famous for producing deeply complex movements beloved by collectors, Minerva foundered during the quartz crisis. When Schmiedt walked into the Minerva factory for the first time, it had a mere 20 workers, fashioning watches using century-old tools.</p><p>“You had really this living heritage, like a sleeping beauty, as if the thing had been stopped in time,” he told me.</p><p>When I visited that factory, it was alive with quiet, careful activity. In one room, a line of expert watchmakers polished individual pieces. One man in a white coat was hunched over an elongated figure eight of stainless steel, which he would spend a week shaping; next to him, a woman used a 40x magnification microscope and color-coded emery boards to etch 45-degree beveled edges into a half-inch-long “bridge.” Across the room sat a master watchmaker with tattoos down his left arm and on his elbow. His job was to assemble the watch and ensure it worked, then to disassemble it, recleaning and reoiling the parts before putting it back together one final time. On the wall was pinned one of the oldest types of technology in the building: the dried stalk of a local flower. It’s used, I was told, to polish brass parts to a luminous glow.</p><p><strong>At Basel this year,</strong> Edouard Meylan, chief executive of the high-end watchmaker H. Moser, issued a news release claiming that he, too, would be introducing a smartwatch. But at the Basel fair, he displayed a traditional mechanical timepiece — a “perpetual calendar” with bold dials and a meter showing how much energy the spring has left in it. In a promotional video, H. Moser called it “the original smartwatch,” joking that even “our grandmother could use it.” The message was clear: Watches are already smart.</p><p>When I spoke to Meylan, he was even more direct. Making smartwatches is a mistake, he argued, particularly for elite brands. To be sure, he said — as many of his peers did — the Apple Watch will probably be successful. “With the right battery, eventually it’ll become something very useful that I will probably wear myself,” he said. But he considers putting smartwatch technology inside a mechanical Swiss timepiece to be brand suicide. “It shouldn’t be a gimmick,” he said. “Especially in our range.” His company, like Montblanc and Ateliers deMonaco, sells watches that cost tens of thousands of dollars. They shouldn’t be creating “some kind of monsters that are a merger of a mobile phone and an actually beautiful mechanical watch.”</p><p>Once a timepiece becomes a computer, what should it <em>not</em> do? Should there be limits? Does watchness become only a trivial part of a smartwatch’s function? “That’s a little bit the scary thing,” says Pim Koeslag of his work at Frédérique Constant. “Once you get into it, you see that this is only the beginning of the beginning.” There’s no GPS in his smartwatch now, but he could imagine putting it in. “You could put in cameras or weather stations or whatever. The only limit is imagination.”</p><p>TAG Heuer is one high-end brand that plans to produce what Silicon Valley might recognize as a smartwatch: a digital version of the TAG Heuer Carrera. TAG Heuer’s engineers will design the physical case, but everything else will come from technology partners. Intel will make the touch screen and the electronics; Google will provide Android Wear software. The goal is to release something by the end of this year that can compete with Apple on the apps front while also being unmistakably Swiss.</p><p>“At two meters distance, you will not know, ‘Is this guy wearing a TAG Heuer Carrera connected or is this guy wearing a chronograph Carrera normal?’ ” said Biver, the chief executive of TAG Heuer, when I visited his office in Nyon. “That will give us the watchmaking appeal, which the computer guys at Apple, Samsung don’t have.”</p>\n<p>Biver is a famously voluble, opinionated figure, prone to grand statements and poetic riffs on the beauty of timepieces. He wears, and occasionally caresses, a chunky watch from Hublot (another luxury brand that he oversees). He says the design of the Apple Watch is “not very sexy.”</p><p>“There is not enough emotion,” he said. “It’s just a reduction of the phone for the wrist.”</p><p>Yet it’s fair to ask how “Swiss” his prospective watch will really be. As several observers told me, it’s just as much an Intel-and-Google watch. “Where is your value-add?” asks Amy Glasmeier, an M.I.T. professor who has written about the watch industry. Swiss watchmakers, she adds, will need to create their own high-tech intellectual property in smartwatches. “Otherwise,” she says, “what they’ve got is just the use of their name. It’s not the use of their human capital.” Raffaelli, the Harvard professor, is a bit more sanguine. He says that the Swiss watchmakers may promote their preindustrial history, but they’ve long been experts at innovating. All those mechanical features — perpetual calendars, self-winding mechanisms — were the transformative high tech of their day. The clock itself was a first step toward the “quantified self,” making visible information that was previously hidden, your precise progress through the day.</p>\n<p>Even if the Swiss smartwatch never takes off, many of the watch executives I spoke with said that the Apple Watch might be good for sales of high-end mechanical watches. Why? Because a generation of Americans has grown up without the habit of wearing a watch. Apple is now spending millions to convince younger consumers — those who coordinate their lives not by looking at a wristwatch, but with “I’m on my way!” text messages and shared Google Calendar events — that a watch can be useful and fashionable again. “Many young people who would never wear something on their wrist, they will start wearing something on their wrist, which is the connected watch,” Biver said. Having acquired the habit of glancing down, maybe they’ll eventually decide they want to look at an older sort of device instead — a machine that, in a sense, is outside time.</p><footer>\n    <div>\n                <em><div><p>Clive Thompson is a contributing writer for the magazine and the author of “Smarter Than You Think.” He last wrote for the magazine about how <a href=\"http://www.nytimes.com/2014/10/26/magazine/can-video-games-fend-off-mental-decline.html\">video games could help the aging mind</a>.</p></div></em>\n        <div><p><em>Sign up for <a href=\"http://www.nytimes.com/newsletters/magazine/\">our newsletter</a> to get the best of The New York Times Magazine delivered to your inbox every week.</em></p></div>\n\n        \n        <em><p>A version of this article appears in print on June 7, 2015, on page MM28 of the <span>Sunday Magazine</span> with the headline: Face-Off. \n</p></em>\n    </div>\n    </footer>\n        \n    </div>\n    <div>\n    </div>\n</div>\n\n    \n    <div>\n        <div>\n    \n</div>\n<div>\n    \n</div>\n<div>\n    <aside>\n</aside>\n</div>\n<div>\n    <aside>\n</aside>\n</div>\n<div>\n    <aside>\n</aside>\n</div>\n    </div>\n\n</article>\n\n\n\n\n                    \n            ", "thumbnail": "https://static01.nyt.com/images/2015/06/07/magazine/07watch1/07watch1-facebookJumbo-v3.jpg"}